Repository: daroczig/R-weblate-fork
Catalog: src/library/graphics/po/R-*.po
Languages: es

source: 'a' is overridden by 'reg'
es: 'a' es invalidado por 'reg'

source: only using the first two of %d regression coefficients
es: utilizando solo los dos primeros de %d coeficientes de regresión

source: 'a' and 'b' are overridden by 'coef'
es: 'a' y 'b' invalidados por 'Coef'

source: one of 'x1' and 'y1' must be given
es: Se requiere uno de entre 'x1' y 'y1'

source: 'length', 'angle', or 'code' greater than length 1; values after the first are ignored
es: 'length', 'angle' o 'code' son de longitud mayor que 1; se ignoran todos los valores excepto los primeros

source: 'x' must be a 2-d contingency table
es: 'x' debe ser una tabla de contingencia 2D

source: all entries of 'x' must be nonnegative and finite
es: todas las entradas de 'x' deben ser no negativas y finitas

source: at least one entry of 'x' must be positive
es: al menos una entrada de 'x' debe ser positiva

source: incorrect 'col': must be length 2
es: 'col' incorrecto: debe ser de longitud de 2

source: only for 1-D table
es: solo para tabla 1-D

source: 'side' must be in {1:4}
es: 'side' debe estar en {1:4}

source: invalid 'axp'
es: 'axp' no válido

source: invalid 'log'
es: 'log' no válido

source: invalid positive 'axp[3]'
es: 'axp[3]' positivo no válido

source: invalid 'usr'
es: 'usr' no válido

source: 'height' must be a vector or a matrix
es: 'height' debe ser un vector o una matriz

source: Cannot use shading lines in bars when log scale is used
es: No se pueden utilizar líneas de sombreado en barras cuando se usa escala logarítmica

source: log scale error: at least one 'height + offset' value <= 0
es: error de escala logarítmica: al menos un valor de 'height + offset' <= 0

source: log scale error: 'xlim' <= 0
es: error de escala logarítmica: 'xlim' <= 0

source: log scale error: 'ylim' <= 0
es: error de escala logarítmica: 'ylim' <= 0

source: incorrect number of names
es: número incorrecto de nombres

source: 'formula' missing or incorrect
es: 'formula' faltante o incorrecta

source: formula must specify 1 or 2 categorical variables
es: la fórmula debe especificar 1 o 2 variables categóricas

source: duplicated categorical values - try another formula or subset
es: valores categóricos duplicados: pruebe con otra fórmula o subconjunto

source: formula with cbind() must specify 1 categorical variable
es: fórmula con cbind() debe especificar 1 variable categórica

source: invalid first argument
es: primer argumento no válido

source: 'at' must have same length as 'z$n', i.e. %d
es: 'at' debe tener la misma longitud que 'z$n', es decir, %d

source: invalid boxplot widths
es: anchos de diagrama de caja no válidos

source: some notches went outside hinges ('box'): maybe set notch=FALSE
es: algunas 'muescas' quedan fuera de las bisagras de la caja: tal vez debe establecer notch=FALSE

source: 'formula' should specify exactly two variables
es: 'formula' debe especificar exactamente dos variables

source: dependent variable should be a factor
es: la variable dependiente debe ser un factor

source: y axis is on a cumulative probability scale, 'ylim' must be in [0,1]
es: eje y está en una escala de probabilidad acumulada, 'ylim' debe estar en [0,1]

source: no 'z' matrix specified
es: No se ha especificado ninguna matriz 'z'

source: increasing 'x' and 'y' values expected
es: Aumento de los valores 'x' e 'y' esperados

source: no proper 'z' matrix specified
es: No se ha especificado una matriz 'z' adecuada

source: 'labels' is length zero. Use 'drawlabels = FALSE' to suppress labels.
es: 'labels' es de longitud cero. Utilice 'drawlabels = FALSE' para suprimir las etiquetas.

source: invalid conditioning formula
es: fórmula de condicionamiento no válida

source: incompatible variable lengths
es: longitudes variables incompatibles

source: 'number' must be integer >= 1
es: 'number' debe ser entero >= 1

source: 'overlap' must be < 1 (and typically >= 0).
es: 'overlap' debe ser < 1 (y normalmente >= 0).

source: invalid 'given.values'
es: 'given.values' no válido

source: rows * columns too small
es: filas * columnas demasiado pequeño

source: Missing rows: %s
es: Filas faltantes: %s

source: 'expr' must be a function, or a call or an expression containing '%s'
es: 'expr' debe ser una función, una llamada o una expresión que contenga '%s'

source: 'add' will be ignored as there is no existing plot
es: 'add' se ignorará ya que no hay un gráfico existente

source: 'from' and 'to' must be > 0 with log="x"
es: 'from' y 'to' deben > 0 con log="x"

source: 'expr' did not evaluate to an object of length 'n'
es: 'expr' no se evaluó como un objeto de longitud 'n'

source: wrong method
es: método equivocado

source: Must specify 'breaks' in hist(<POSIXt>)
es: Debe especificar 'breaks' en hist(<POSIXt>)

source: invalid specification of 'breaks'
es: especificación de 'breaks' inválida

source: Must specify 'breaks' in hist(<Date>)
es: Debe especificar 'breaks' en hist(<Date>)

source: 'x' must be a numeric vector or matrix
es: 'x' debe ser un vector numérico o una matriz

source: 'x' is neither a vector nor a matrix: using as.numeric(x)
es: 'x' no es ni un vector ni una matriz: usando as.numeric(x)

source: 'x' must be an array
es: 'x' debe ser una matriz

source: 'x' must be 2- or 3-dimensional
es: 'x' debe ser de 2 o 3 dimensiones

source: table for each stratum must be 2 by 2
es: La tabla para cada estrato debe ser de 2 por 2

source: 'conf.level' must be a single number between 0 and 1
es: 'conf.level' debe ser un solo número entre 0 y 1

source: incorrect 'margin' specification
es: especificación incorrecta de 'margin'

source: incorrect geometry specification
es: Especificación de geometría incorrecta

source: 'x' must be numeric
es: 'x' debe ser numérico

source: invalid length(x)
es: Longitud no válida para x: length(x)

source: 'nclass' not used when 'breaks' is specified
es: 'nclass' no se usa cuando se especifica 'breaks'

source: 'include.lowest' ignored as 'breaks' is not a vector
es: 'include.lowest' ignorado como 'breaks' no es un vector

source: unknown 'breaks' algorithm
es: Algoritmo de 'rupturas' desconocido

source: invalid number of 'breaks'
es: Número no válido de 'descansos'

source: 'breaks = %g' is too large and set to 1e6
es: 'breaks = %g' es demasiado grande y se establece en 1e6

source: hist.default: pretty() error, breaks=%s
es: hist.default: error en pretty(), breaks=%s

source: Invalid breakpoints produced by 'breaks(x)': %s
es: Puntos de interrupción no válidos producidos por 'breaks(x)': %s

source: invalid length(breaks)
es: Longitud no válida (descansos)

source: 'breaks' are not strictly increasing
es: Los 'descansos' no están aumentando estrictamente

source: 'probability' is an alias for '!freq', however they differ.
es: 'probability' es un alias de '!freq', sin embargo, difieren.

source: some 'x' not counted; maybe 'breaks' do not span range of 'x'
es: alguna 'x' no se cuenta; tal vez 'breaks' no abarque el rango de 'x'

source: the AREAS in the plot are wrong -- rather use 'freq = FALSE'
es: las ÁREAS en la gráfica son incorrectas, en su lugar use 'freq = FALSE'

source: 'x' is wrongly structured
es: 'x' está mal estructurado

source: argument must be matrix-like
es: el argumento debe ser matriz o similar

source: 'x' and 'y' values must be finite and non-missing
es: los valores 'x' e 'y' deben ser finitos y no faltantes

source: 'z' must be a matrix
es: 'z' debe ser una matriz

source: 'z' must be numeric or logical
es: 'z' debe ser numérico o lógico

source: invalid z limits
es: límites z no válidos

source: must have one more break than colour
es: debe tener un descanso más que el color

source: 'breaks' must all be finite
es: Las 'rupturas' deben ser todas finitas

source: unsorted 'breaks' will be sorted before use
es: Los "descansos" no clasificados se ordenarán antes de su uso

source: dimensions of z are not length(x)(-1) times length(y)(-1)
es: Las dimensiones de z no son longitud(x)(-1) por longitud(y)(-1)

source: %s can only be used with a regular grid
es: %s solo se puede usar con una cuadrícula normal

source: integer colors must be non-negative
es: los colores de valor entero no deben ser negativos

source: 'respect' must be logical or matrix with same dimension as 'mat'
es: 'respect' debe ser lógico o matriz con la misma dimensión que 'mat'

source: layout matrix must contain at least one reference to each of the values {1 ... %d}
es: La matriz de diseño debe contener al menos una referencia a cada uno de los valores {1 ... %d}

source: invalid 'title'
es: 'Título' no válido

source: 'legend' is of length 0
es: 'legend' tiene longitud 0

source: invalid coordinate lengths
es: longitudes de coordenadas no válidas

source: horizontal specification overrides: Number of columns := %d
es: Anulaciones de especificación horizontal: Número de columnas := %d

source: 'text.width' must be numeric, >= 0, or a scalar NA
es: 'text.width' debe ser numérico, >= 0 o un NA escalar

source: 'merge = TRUE' has no effect when no line segments are drawn
es: 'merge = TRUE' no tiene ningún efecto cuando no se dibujan segmentos de línea

source: not using pch[2..] since pch[1L] has multiple chars
es: no usar pch[2..] ya que pch[1L] tiene varios caracteres

source: must specify at least one of 'x' and 'y'
es: debe especificar al menos una de las opciones 'x' e 'y'

source: 'x' and 'y' must have same number of rows
es: 'x' e 'y' deben tener el mismo número de filas

source: 'x' and 'y' must have only 1 or the same number of columns
es: 'x' e 'y' deben tener solo 1 o el mismo número de columnas

source: default 'pch' is smaller than number of columns and hence recycled
es: El valor predeterminado 'pch' es menor que el número de columnas y, por lo tanto, se recicla

source: missing values in contingency table
es: Valores faltantes en la tabla de contingencia

source: 'x' must not have 0 dimensionality
es: 'x' no debe tener 0 dimensionalidad

source: invalid 'shade' specification
es: Especificación de 'sombra' no válida

source: length of 'sort' does not conform to 'dim(x)'
es: La longitud de 'sort' no se ajusta a 'dim(x)'

source: non-numeric argument to 'pairs'
es: argumento no numérico a 'pares'

source: only one column in the argument to 'pairs'
es: solo una columna en el argumento de 'pares'

source: invalid argument 'horInd'
es: argumento no válido 'horInd'

source: invalid argument 'verInd'
es: argumento no válido 'verInd'

source: the 'panel' function made a new plot
es: La función 'panel' creó un nuevo gráfico

source: surface extends beyond the box
es: La superficie se extiende más allá de la caja

source: 'x' values must be positive.
es: Los valores 'x' deben ser positivos.

source: invalid table 'x'
es: Tabla 'x' no válida

source: the formula '%s' is treated as '%s'
es: La fórmula '%s' se trata como '%s'

source: cannot handle more than one 'x' coordinate
es: No se puede manejar más de una coordenada 'x'

source: must have a response variable
es: debe tener una variable de respuesta

source: invalid plot type
es: tipo de gráfico inválido

source: plot type '%s' will be truncated to first character
es: El tipo de trama '%s' se truncará al primer carácter

source: invalid plot type '%s'
es: tipo de gráfico inválido '%s'

source: 'plot.data.frame' applied to non data frame
es: 'plot.data.frame' aplicado a un marco que no es de datos

source: 'y' must be a numeric vector
es: 'y' debe ser un vector numérico

source: 'x' must be a data frame
es: 'x' debe ser un marco de datos

source: all columns/components of 'x' must be factors
es: Todas las columnas/componentes de 'x' deben ser factores

source: some levels of the factors are empty
es: Algunos niveles de los factores están vacíos

source: 'x' must be a dataframe or a formula
es: 'x' debe ser un marco de datos o una fórmula

source: a variable in 'y' is not numeric
es: Una variable en 'y' no es numérica

source: there must be at least one numeric variable!
es: ¡Debe haber al menos una variable numérica!

source: cannot hatch with logarithmic scale active
es: no se puede eclosionar con la escala logarítmica activa

source: Invalid fill rule for graphics path
es: Regla de relleno no válida para la ruta de gráficos

source: invalid rectangle specification
es: Especificación de rectángulo no válida

source: some values will be clipped
es: Algunos valores se recortarán

source: invalid screen number
es: Número de pantalla no válido

source: 'figs' must be a vector or a matrix with 4 columns
es: 'figs' debe ser un vector o una matriz con 4 columnas

source: 'figs' must specify at least one screen
es: 'figs' debe especificar al menos una pantalla

source: 'nrpoints' should be numeric scalar with value >= 0.
es: 'nrpoints' debe ser escalar numérico con valor >= 0.

source: a 2-way table has to be specified
es: Se debe especificar una tabla de 2 vías

source: weights are not supported for 2-way table specification
es: Los pesos no son compatibles con la especificación de tabla de 2 vías

source: x axis is on a cumulative probability scale, 'xlim' must be in [0,1]
es: x está en una escala de probabilidad acumulativa, 'xlim' debe estar en [0,1]

source: 'x' must be a matrix or a data frame
es: 'x' debe ser una matriz o un marco de datos

source: data in 'x' must be numeric
es: Los datos en 'x' deben ser numéricos

source: 'nrow * ncol' is less than the number of observations
es: 'nrow * ncol' es menor que el número de observaciones

source: labels do not make sense for a single location
es: Las etiquetas no tienen sentido para una sola ubicación

source: 'locations' must be a 2-column matrix.
es: 'locations' debe ser una matriz de 2 columnas.

source: number of rows of 'locations' and 'x' must be equal.
es: El número de filas de 'locations' y 'x' debe ser igual.

source: length of 'angles' must equal 'ncol(x)'
es: La longitud de los 'ángulos' debe ser igual a 'ncol(x)'

source: no finite and non-missing values
es: Sin valores finitos y no faltantes

source: 'scale' must be positive
es: La 'escala' debe ser positiva

source: invalid plotting method
es: Método de trazado no válido

source: 'at' must have length equal to the number %d of groups
es: 'at' debe tener una longitud igual al número %d de grupos

source: formula missing or incorrect
es: Fórmula faltante o incorrecta

source: 'number' must have same length as 'x' and 'y'
es: 'number' debe tener la misma longitud que 'x' e 'y'

source: exactly one symbol type must be specified
es: Se debe especificar exactamente un tipo de símbolo

source: x log scale: xinch() is nonsense
es: x escala logarítmica: xinch() es una tontería

source: y log scale: yinch() is nonsense
es: escala logarítmica "y": yinch() no tiene sentido

source: log scale: xyinch() is nonsense
es: escala logarítmica "x": xinch() no tiene sentido

source: Duplicated argument %s is disregarded
es: No se tiene en cuenta el argumento duplicado %s

source: Outlier (%s) in boxplot %d is not drawn
es: El valor atípico (outlier) %s en el diagrama de caja %d no se dibuja

source: argument %s is not made use of
es: el argumento %s no se utiliza
