Repository: daroczig/R-weblate-fork
Catalog: src/library/grid/po/*.po
Languages: pt_br

source: updateGContext must only be called after initGContext
pt_br: updateGContext só deve ser chamado após initGContext

source: Turning clipping on or off within a (clipping) path is no honoured
pt_br: Ativar ou desativar o recorte em um caminho (recorte) não está sendo respeitado

source: cannot clip to rotated viewport
pt_br: Não é possível cortar sobre uma viewport rotacionada

source: Clipping paths within a (clipping) path are not honoured
pt_br: O recorte dos caminhos dentro de um caminho (de recorte) não está sendo respeitado

source: Masks within a (clipping) path are not honoured
pt_br: Máscaras dentro de um caminho (recorte) não estão sendo respeitadas

source: Viewport '%s' was not found
pt_br: A janela de visualização gráfica '%s' não foi encontrada

source: cannot pop the top-level viewport ('grid' and 'graphics' output mixed?)
pt_br: Não é possível mostrar a viewport de nível máximo (saídas gráficas e grid misturadas?)

source: attempt to plot on null device
pt_br: tentativa de fazer um gráfico no dispositivo nulo

source: there is no layout defined
pt_br: Não há layout definido

source: polygon edge not found (zero-width or zero-height?)
pt_br: Limite do polígono não encontrado (largura ou altura zero?)

source: polygon edge not found
pt_br: Limite do polígono não encontrado

source: require at least two points to draw arrow
pt_br: Pelo menos dois pontos são necessários para desenhar uma seta

source: non-finite control point in Xspline
pt_br: Ponto de controle não-finito em Xspline

source: non-finite x or y in graphics path
pt_br: valores não-finitos de x ou y no caminho do gráfico

source: Empty raster
pt_br: Raster vazio

source: Coordinates for text pch not yet supported
pt_br: Coordenadas para 'pch' de texto ainda não suportadas

source: pch value '%d' is invalid in this locale
pt_br: O valor pch '%d' é inválido nesta configuração de localidade

source: unimplemented pch value '%d'
pt_br: O valor '%d' de pch não está implementado

source: invalid plotting symbol
pt_br: simbolo para gráfico inválido

source: unable to clip to rotated rectangle
pt_br: Não é possível cortar sobre um retângulo rotacionado

source: invalid 'layout.pos.row'
pt_br: 'layout.pos.row' inválido

source: invalid 'layout.pos.col'
pt_br: 'layout.pos.col' inválido

source: singular transformation matrix
pt_br: matriz de transformação singular

source: unable to store 'grid' state. Too many devices open?
pt_br: Não foi possível guardar o estado do 'grid'. Muitos dispositivos abertos?

source: Cannot create unit scalar from 0-length unit vector
pt_br: Não é possível criar escalares de unidades a partir do vetor de unidades de comprimento 0

source: invalid unit or unit not yet implemented
pt_br: Unidade inválida ou unidade ainda não implementada

source: Viewport has zero dimension(s)
pt_br: A janela de visualização gráfica tem dimensão zero

source: Unsupported unit conversion
pt_br: Conversão de unidade não suportada

source: Invalid unit
pt_br: Unidade inválida

source: 'units' must be character
pt_br: 'units' deve ser do tipo caractere

source: 'units' must be of length > 0
pt_br: 'units' devem ter comprimento > 0

source: data must be either NULL, have length 1, or match the length of the final unit vector
pt_br: os dados devem ser NULL, ter comprimento 1 ou corresponder ao comprimento do vetor de unidade final

source: no string supplied for 'strwidth/height' unit
pt_br: Nenhuma string de caracteres fornecida para a unidade 'strwidth/height'

source: no 'grob' supplied for 'grobwidth/height' unit
pt_br: Nenhum 'grob' fornecido para a unidade 'grobwidth/height'

source: 'gPath' must have depth 1 in 'grobwidth/height' units
pt_br: 'gPath' deve ter profundidade 1 em unidades 'grobwidth/height'

source: non-NULL value supplied for plain unit
pt_br: valor não NULL fornecido para unidade simples

source: old version of unit class is no longer allowed
pt_br: A versão antiga da classe unit não é mais permitida

source: object is not coercible to a unit
pt_br: objeto não é coercível a uma unidade

source: object is not a unit
pt_br: objeto não é uma unidade

source: units can only be multiplied with numerics and integers
pt_br: as unidades só podem ser multiplicadas por números numéricos ou inteiros

source: Unable to calculate text width/height (using zero)
pt_br: Não foi possível calcular a largura/altura do texto (usando zero)

source: Mask is not logical value ('none' or 'inherit')
pt_br: Mask não é um valor lógico ('none' ou 'inherit')

source: non-finite location and/or size for viewport
pt_br: Localização e/ou tamanhos não finitos para viewport
