Repository: daroczig/R-weblate-fork
Catalog: src/library/utils/po/*.po
Languages: es

source: invalid '%s' argument
es: argumento '%s' no válido

source: invalid quote symbol set
es: conjunto inválido de símbolos de entrecomillado (quote)

source: cannot open the connection
es: no se puede abrir la conexión

source: cannot read from this connection
es: no se puede leer desde esta conexión

source: quoted string on line %d terminated by EOF
es: cadena entrecomillada en línea %d terminada por EOF

source: the first argument must be of mode character
es: el primer argumento debe ser de modo carácter

source: invalid 'numerals' string: "%s"
es: cadena 'numerals' no válida: "%s"

source: Selection:
es: Selección:

source: cannot allocate buffer in 'readTableHead'
es: no se puede asignar búfer en 'readTableHead'

source: \ followed by EOF
es: \ seguido de EOF

source: incomplete final line found by readTableHeader on '%s'
es: línea final incompleta encontrada por readTableHeader en '%s'

source: index out of range
es: Índice fuera de rango

source: Problem closing connection: %s
es: Problema cerrando la conexión: %s

source: Problem closing connection
es: Problema al cerrar la conexión

source: 'file' is not a connection
es: 'file' no es una conexión

source: cannot write to this connection
es: no es posible escribir en esa conexión

source: 'dec' must be a single character
es: 'dec' debe ser un solo carácter

source: corrupt data frame -- length of column %d does not match nrows
es: data frame corrupto -- la longitud de la columna %d no coincide con el número de filas

source: column %d claims to be a factor but does not have numeric codes
es: la columna %d afirma ser un factor, pero no tiene códigos numéricos

source: corrupt matrix -- dims do not match length
es: Matriz corrupta -- los dims no coinciden con la longitud

source: 'savehistory' can only be used in Rgui and Rterm
es: 'savehistory' solo se puede usar en Rgui y Rterm

source: 'loadhistory' can only be used in Rgui and Rterm
es: 'loadhistory' solo se puede usar en Rgui y Rterm

source: invalid timestamp
es: marca de tiempo inválida

source: X11 dataentry cannot be loaded
es: no se puede cargar la entrada de datos X11

source: X11 is not available
es: X11 no está disponible

source: invalid '%s' specification
es: especificación '%s' no válida

source: '%s' contains missing values
es: '%s' contiene valores faltantes

source: argument 'class' must be a character string
es: El argumento 'class' debe ser una cadena de caracteres

source: argument 'x' must be a length-1 character vector
es: el argumento 'x' debe ser un vector de caracteres de longitud 1

source: argument 'x' must be UTF-8 encoded (including ASCII)
es: el argumento 'x' debe estar codificado en UTF-8 (incluido ASCII)

source: 'hostname' must be a character vector of length 1
es: 'hostname' debe ser un vector de caracteres de longitud 1

source: nsl() was unable to resolve host '%s'
es: nsl() no pudo resolver el host '%s'

source: unknown format returned by 'gethostbyname'
es: formato desconocido devuelto por 'gethostbyname'

source: nsl() is not supported on this platform
es: nsl() no es soportado en esta plataforma

source: unknown type
es: tipo desconocido

source: menu functions can only be used in the GUI
es: las funciones de menú solo se pueden utilizar en la interfaz gráfica de usuario

source: unable to retrieve items for %s (%s)
es: no se pueden recuperar elementos para %s (%s)

source: unable to add menu (%s)
es: no se puede agregar el menú (%s)

source: unable to add menu item (%s)
es: no se puede agregar un elemento de menú (%s)

source: menu does not exist
es: el menú no existe

source: unable to delete menu item (%s)
es: no se puede eliminar el elemento de menú (%s)

source: invalid '%s' value
es: valor '%s' no válido

source: Registry key '%ls' not found
es: no se encontró la clave de registro '%ls'

source: unsupported version of Windows
es: versión no soportada de Windows

source: argument must be a character vector or a raw vector
es: el argumento debe ser un vector de caracteres o un vector de tipo 'raw'

source: unable to open the clipboard
es: no se puede abrir el portapapeles

source: unable to write to the clipboard
es: no se puede escribir en el portapapeles

source: 'title' must be a character string
es: 'title' debe ser una cadena de caracteres

source: 'text' must be a character string
es: 'text' debe ser una cadena de caracteres

source: '%s' must be length 1
es: '%s' debe tener longitud 1

source: '%s' must be a list
es: '%s' debe ser una lista

source: '%s' element %d is not a window handle
es: el elemento '%s' %d no es un identificador de ventana

source: Select one or more
es: Seleccione uno o varios

source: Select one
es: Seleccione uno

source: 'default' must be a character string
es: 'default' debe ser una cadena de caracteres

source: 'default' is overlong
es: 'default' es demasiado largo

source: 'caption' must be a character string
es: 'caption' debe ser una cadena de caracteres

source: 'multi' must be a logical value
es: 'multi' debe ser un valor lógico

source: 'filterindex' must be an integer value
es: 'filterindex' debe ser un valor entero
