Repository: daroczig/R-weblate-fork
Catalog: src/library/utils/po/R-*.po
Languages: es

source: timeouts for parallel installs require the 'timeout' command
es: los tiempos de espera para instalaciones paralelas requieren el comando 'timeout'

source: installation of package %s failed
es: falló la instalación del paquete %s

source: installation of %d packages failed: %s
es: falló la instalación de %d paquetes: %s

source: installation of %d packages failed: %s
es: falló la instalación de %d paquetes: %s

source: The downloaded source packages are in %s
es: Los paquetes fuente descargados están en %s

source: The namespace for package "%s" is locked; no changes in the global variables list may be made.
es: El espacio de nombres del paquete "%s" está bloqueado; No se pueden realizar cambios en la lista de variables globales.

source: 'env' must be an environment
es: 'env' debe ser un entorno

source: no object named '%s' to show
es: no hay ningún objeto llamado '%s' para mostrar

source: 'file' must be "" or an open connection object
es: 'file' debe ser "" o un objeto de conexión abierta

source: 'char' must have a non-zero width
es: 'char' debe tener un ancho distinto de cero

source: must have 'max' > 'min'
es: debe tener 'max' > 'min'

source: 'pb' is not from class %s
es: 'pb' no es de la clase %s

source: cannot determine a usable name
es: no se puede determinar un nombre utilizable

source: Created file named %s.
es: Archivo creado llamado %s.

source: Edit the file and move it to the appropriate directory.
es: Edite el archivo y muévalo al directorio apropiado.

source: cannot determine import name
es: no se puede determinar el nombre de la importación

source: no documentation of type %s and topic %s (or error in processing help)
es: no hay documentación de tipo %s y tema %s (o error al procesar la ayuda)

source: the object of class %s in the function call %s could not be used as a documentation topic
es: el objeto de la clase %s en la llamada a la función %s no pudo ser usado como tema de documentación

source: no methods for %s and no documentation for it as a function
es: sin métodos para %s y sin documentación para ello como función

source: no method defined for function %s and signature %s
es: no hay ningún método definido para la función %s y la firma %s

source: no documentation for function %s and signature %s
es: no hay documentación para la función %s y la firma %s

source: No DIF data on clipboard
es: No hay datos DIF en el portapapeles

source: file had no lines
es: el archivo no tenía líneas

source: row and column counts not found
es: recuentos de filas y columnas no encontrados

source: More rows than specified in header; maybe use 'transpose=TRUE'
es: Más filas de las especificadas en el encabezado; tal vez use 'transpose=TRUE'

source: Unrecognized special data value
es: Valor de datos especiales no reconocido

source: More columns than specified in header; maybe use 'transpose=TRUE'
es: Más columnas de las especificadas en el encabezado; tal vez use 'transpose=TRUE'

source: Unrecognized value indicator
es: Indicador de valor no reconocido

source: no lines available in input
es: no hay líneas disponibles en la entrada

source: header and 'col.names' are of different lengths
es: el encabezado y 'col.names' tienen diferentes longitudes

source: more columns than column names
es: más columnas que nombres de columnas

source: more column names than columns
es: más nombres de columnas que columnas

source: rows are empty: giving up
es: las filas están vacías: no se continúa

source: not all columns named in 'colClasses' exist
es: no existen todas las columnas nombradas en 'colClasses'

source: invalid numeric 'as.is' expression
es: expresión numérica 'as.is' no válida

source: not all columns named in 'as.is' exist
es: no existen todas las columnas nombradas en 'as.is'

source: 'as.is' has the wrong length %d != cols = %d
es: 'as.is' tiene la longitud incorrecta %d != cols = %d

source: invalid 'row.names' specification
es: especificación 'row.names' no válida

source: invalid 'row.names' length
es: longitud de 'row.names' inválida

source: duplicate 'row.names' are not allowed
es: no se permiten 'row.names' duplicados

source: missing values in 'row.names' are not allowed
es: no se permiten valores faltantes en 'row.names'

source: missing lengths for some fields
es: faltan longitudes para algunos campos

source: invalid format
es: formato no válido

source: transfer failure
es: fallo de transferencia

source: %s option must be a length one character vector or NULL
es: La opción %s debe ser un vector de un carácter de longitud 1 o NULL

source: 'file' must be a character string or connection
es: 'file' debe ser una cadena de caracteres o una conexión

source: 'as.is' should be specified by the caller; using TRUE
es: 'as.is' debe ser especificado por el código que lo llama; usando TRUE

source: empty beginning of file
es: principio del archivo vacío

source: first five rows are empty: giving up
es: las primeras cinco filas están vacías: no continuar

source: relist() requires recursively unlisted objects.
es: relist() requiere objetos no listados de forma recursiva.

source: The 'flesh' argument does not contain a skeleton attribute.
es: El argumento 'flesh' no contiene un atributo skeleton.

source: Either ensure you unlist a relistable object, or specify the skeleton separately.
es: Asegúrese de que hace 'unlist' sobre un objeto relistable, o especifique skeleton por separado.

source: cannot coerce 'x' to roman
es: no se puede convertir 'x' a número romano

source: Could not create file %s, aborting
es: No se pudo crear el archivo %s, abortando

source: no valid packages were specified
es: no se especificaron paquetes válidos

source: invalid 'socket' argument
es: argumento 'socket' no válido

source: 'port' must be integer of length 1
es: 'port' debe ser un número entero de longitud 1

source: 'host' must be character of length 1
es: 'host' debe ser un carácter de longitud 1

source: can only receive calls on local machine
es: sólo puede recibir llamadas en la máquina local

source: socket not established
es: socket no establecido

source: argument is not a function or language object:
es: el argumento no es una función ni un objeto de lenguaje:

source: str.data.frame() called with non-data.frame -- coercing to one.
es: str.data.frame() llamado con otro objeto -- convirtiendo a data.frame.

source: invalid options("str") -- using defaults instead
es: opciones no válidas("str") -- usando valores por defecto en su lugar

source: invalid components in options("str"): %s
es: componentes no válidos en opciones("str"): %s

source: 'str.default': 'le' is NA, so taken as 0
es: 'str.default': 'le' es NA, por lo que se toma como 0

source: 'nchar.max = %d' is too small
es: 'nchar.max = %d' es demasiado pequeño

source: Not a validObject():
es: objeto no válido (al aplicar validObject()):

source: 'object' does not have valid levels()
es: 'object' no tiene niveles válidos (levels())

source: 'digits' and 'digits.d' are both specified and the latter is not used
es: 'digits' y 'digits.d' ambos especificados, el último no se utiliza

source: The number of captures in 'pattern' != 'length(proto)'
es: El número de capturas en 'pattern' != 'length(proto)

source: The number of tokens != 'length(proto)'
es: El número de tokens != 'length(proto)'

source: The number of tokens is not consistent across 'x'
es: El número de tokens no es consistente a lo largo de 'x'

source: cannot coerce %s to TRUE or FALSE
es: no se convertir %s en TRUE o FALSE

source: no lines found in %s
es: no se encontraron líneas en %s

source: profile does not contain memory information
es: el perfil no contiene información de la memoria

source: profile does not contain line information
es: el perfil no contiene información de línea

source: no events were recorded
es: no se registraron eventos

source: argument 'compressed' is ignored for the internal method
es: el argumento 'compressed' se ignora para el método interno

source: invalid 'tarfile' argument
es: argumento 'tarfile' no válido

source: 'compressed' must be logical or character
es: 'compressed' debe ser lógico o de carácter

source: No %s command found
es: No se encontró ningún comando %s

source: failed to create directory %s
es: no se pudo crear el directorio %s

source: invalid octal digit
es: dígito octal no válido

source: removing drive '%s'
es: eliminando la unidad '%s'

source: removing leading '/'
es: eliminando el '/' inicial

source: path starts with '~'
es: la ruta comienza con '~'

source: path contains '..'
es: la ruta contiene '..'

source: path is empty
es: la ruta está vacía

source: 'tarfile' must be a character string or a connection
es: 'tarfile' debe ser una cadena de caracteres o una conexión

source: incomplete block on file
es: bloque incompleto en el archivo

source: incomplete block: rather use gzfile(.) created connection?
es: bloque incompleto: ¿será mejor usar la conexión creada con gzfile(.)?

source: invalid name field in tarball
es: campo de nombre no válido en tarball

source: checksum error for entry '%s'
es: error de suma de comprobación para la entrada '%s'

source: failed to copy %s to %s
es: no se pudo copiar %s a %s

source: unsupported entry type
es: tipo de entrada no admitido

source: file '%s' not found
es: archivo '%s' no encontrado

source: file '%s' did not have execute permissions: corrected
es: el archivo '%s' no tenía permisos de ejecución: corregido

source: file size is limited to 8GB
es: el tamaño del archivo está limitado a 8GB

source: invalid uid value replaced by that for user 'nobody'
es: valor de uid no válido reemplazado por el del usuario 'nobody'

source: invalid gid value replaced by that for user 'nobody'
es: valor gid no válido reemplazado por el del usuario 'nobody'

source: vignette %s found more than once, using the one found in %s
es: viñeta %s encontrada más de una vez, usando la que se encuentra en %s

source: vignette %s not found
es: viñeta %s no encontrada

source: vignette %s has no PDF/HTML
es: viñeta %s no tiene PDF/HTML

source: vignette %s has no R code
es: viñeta %s no tiene código R

source: select.list() cannot be used non-interactively
es: select.list() no se puede utilizar de forma no interactiva

source: 'title' must be NULL or a length-1 character vector
es: 'title' debe ser NULL o un vector de caracteres de longitud 1

source: Enter one or more numbers separated by spaces and then ENTER, or 0 to cancel
es: Ingrese uno o más números separados por espacios y luego ENTER, o 0 para cancelar

source: Invalid input, please try again
es: Entrada no válida, por favor inténtalo de nuevo

source: 'quote' must be 'TRUE', 'FALSE' or numeric
es: 'cita' debe ser 'TRUE', 'FALSE' o numérico

source: invalid numbers in 'quote'
es: números no válidos en 'comilla'

source: invalid 'quote' specification
es: especificación de 'cotización' no válida

source: 'col.names = NA' makes no sense when 'row.names = FALSE'
es: 'col.names = NA' no tiene sentido cuando 'row.names = FALSE'

source: invalid 'col.names' specification
es: especificación 'col.names' no válida

source: appending column names to file
es: añadiendo nombres de columnas al archivo

source: attempt to set '%s' ignored
es: intento de establecer '%s' ignorado

source: 'files' must be a character vector specifying one or more filepaths
es: 'files' debe ser un vector de caracteres que especifique una o más rutas de archivo

source: cannot find program to open 'mailto:' URIs: reverting to 'method="none"'
es: no se puede encontrar el programa para abrir los URI 'mailto:': se vuelve a 'method="none"'

source: Using the browser to open a mailto: URI
es: Usar el navegador para abrir un mailto: URI

source: must specify 'address'
es: debe especificar 'address'

source: 'subject' is missing
es: falta 'subject'

source: 'ccaddress' must be of length 1
es: 'ccaddress' debe tener una longitud de 1

source: 'url' must be a length-one character vector
es: 'url' debe ser un vector de un carácter de longitud

source: 'headers' must have names and must not be NA
es: 'headers' debe tener nombres y no deben ser NA

source: 'destfile' must be a length-one character vector
es: 'destfile' debe ser un vector de un carácter de longitud

source: 'wget' call had nonzero exit status
es: La llamada 'wget' tenía un estado de salida distinto de cero

source: 'curl' call had nonzero exit status
es: La llamada 'curl' tenía un estado de salida distinto de cero

source: invalid method:
es: método no válido:

source: download had nonzero exit status
es: download devolvió un estado de salida distinto de cero

source: 'tar' returned non-zero exit code %d
es: 'tar' devolvió un código de salida distinto de cero %d

source: file %s is not a macOS binary package
es: el archivo %s no es un paquete binario de macOS

source: package %s successfully unpacked and MD5 sums checked
es: paquete %s descomprimido exitosamente y sumas MD5 verificadas

source: ERROR: failed to lock directory %s for modifying Try removing %s
es: ERROR: no se pudo bloquear el directorio %s para modificarlo Intente eliminar %s

source: ERROR: failed to create lock directory %s
es: ERROR: no se pudo crear el directorio de bloqueo %s

source: restored %s
es: %s restaurados

source: unable to move temporary installation %s to %s
es: no se puede mover la instalación temporal %s a %s

source: cannot remove prior installation of package %s
es: no se puede eliminar la instalación anterior del paquete %s

source: The downloaded binary packages are in %s
es: Los paquetes binarios descargados están en %s

source: 'memory.size()' is Windows-specific
es: 'memory.size()' es específico de Windows

source: 'memory.limit()' is Windows-specific
es: 'memory.limit()' es específico de Windows

source: method 'mailx' is Unix-only
es: el método 'mailx' es sólo para Unix

source: zip file %s not found
es: archivo zip %s no encontrado

source: failed to create %s
es: no se pudo crear %s

source: there is no 'libs' directory in package %s
es: no hay ningún directorio 'libs' en el paquete %s

source: unable to move temporary installation %s to %s, copying instead
es: no se puede mover la instalación temporal %s a %s, copiándola en su lugar

source: unable to copy temporary installation %s to %s
es: no se puede copiar la instalación temporal %s a %s

source: Only '*.zip' and '*.tar.gz' files can be installed.
es: Solo se pueden instalar los archivos '*.zip' y '*.tar.gz'.

source: 'memory.size()' is no longer supported
es: 'memory.size()' ya no está soportado

source: 'memory.limit()' is no longer supported
es: 'memory.limit()' ya está soportado

source: winDialog() cannot be used non-interactively
es: winDialog() no se puede utilizar de forma no interactiva

source: winDialogString() cannot be used non-interactively
es: winDialogString() no se puede utilizar de forma no interactiva

source: %d Sweave file for basename %s found
es: %d archivo Sweave para (basename) %s encontrado

source: Output/used file:
es: Archivo de salida:

source: %d occurrence in %s
es: %d ocurrencia en %s

source: Invalid role specification: %s.
es: Especificación de rol no válida: %s.

source: A bibentry of bibtype %s has to specify the field: %s
es: Un bibentry de tipo bibtype %s tiene que especificar el campo: %s

source: class discarded from column %s
es: clase descartada de la columna %s

source: matched %d object.
es: %d objeto coincidente.

source: %d error caught in %s: %s
es: %d error detectado en %s: %s

source: object '%s' not found
es: objeto '%s' no encontrado

source: package %s is a base package, and cannot be removed
es: el paquete %s es un paquete base y no se puede eliminar

source: Removing package from %s (as %s is unspecified)
es: Eliminando paquete de %s (ya que %s no está especificado)

source: package %s is a base package, and should not be updated
es: el paquete %s es un paquete base y no debe actualizarse

source: A version of this package for your version of R might be available elsewhere, see the ideas at
es: Una versión de este paquete para su versión de R puede estar disponibles en otros lugares, consulte las ideas en

source: package %s is not available %s
es: el paquete %s no está disponible %s

source: dependency %s is not available
es: la dependencia %s no está disponible

source: also installing the dependency %s
es: también instalando la dependencia %s

source: package %s is in use and will not be installed
es: el paquete %s está en uso y no se instalará

source: Installing package into %s (as %s is unspecified)
es: Instalando el paquete en %s (ya que %s no está especificado)

source: 'lib' element %s is not a writable directory
es: El elemento 'lib' %s no es un directorio grabable

source: There is a binary version available but the source version is later
es: Hay una versión binaria disponible pero la versión fuente es posterior

source: Do you want to install from sources the package which needs compilation?
es: ¿Quiere instalar desde las fuentes el paquete que necesita compilación?

source: Package which is only available in source form, and may need compilation of C/C++/Fortran
es: Paquete que sólo está disponible en formato fuente y puede necesitar compilación de C/C++/Fortran

source: installing the source package %s
es: instalando el paquete fuente %s

source: package %s is available as a source package but not as a binary
es: el paquete %s está disponible como paquete fuente pero no como binario

source: There is a binary version available (and will be installed) but the source version is later
es: Hay una versión binaria disponible (y se instalará) pero la versión fuente es posterior

source: last record incomplete, %d line discarded
es: último registro incompleto, %d línea descartada

source: invalid roman numeral: %s
es: número romano no válido: %s
