Repository: daroczig/R-weblate-fork
Catalog: src/library/utils/po/R-*.po
Languages: es

source: RShowDoc() should be used with a character string argument specifying a documentation file
es: RShowDoc() debería ser usado con un argumento de tipo cadena de caracteres (string) especificando …un archivo de documentación

source: no documentation for %s found in package %s
es: no se ha encontrado documentación para %s en el paquete %s

source: document not found
es: El documento no se ha encontrado

source: some options in argument 'restrict' were not recognized and hence ignored
es: algunas opciones en el argumento 'restrict' no fueron reconocidas y por lo tanto ignoradas

source: argument 'format' is deprecated and has no affect on search results
es: el argumento 'format' está en desuso y no afecta los resultados de búsqueda

source: A search query has been submitted to %s
es: Una búsqueda fue enviada a %s

source: The results page should open in your browser shortly
es: La página de resultados se deberá de abrir en su navegador en breve

source: reference to unknown chunk %s
es: Referencia a un trozo desconocido %s

source: no Sweave file with name %s found
es: Ningún archivo Sweave con nombre %s encontrado

source: more than one syntax specification found, using the first one
es: más de una especificación de sintaxis encontrada, se usará la primera

source: object %s does not have class "SweaveSyntax"
es: el objeto %s no tiene clase "SweaveSyntax"

source: recursive Sweave input %s in stack
es: entrada Sweave recursiva %s en la pila

source: target syntax not of class %s
es: la sintaxis de destino no es de la clase %s

source: target syntax contains no translation table
es: la sintaxis de destino no contiene tabla de traducción

source: parse error or empty option in %s
es: error de interpretación u opción vacía en %s

source: Warning: unknown option '--clean='%s
es: Alerta: opción desconocida '--clean='%s

source: Warning: unknown option %s
es: Alerta: opción desconocida %s

source: Output file:
es: Archivo de salida:

source: Compacting PDF document
es: Compactando documento PDF

source: path to %s contains spaces,
es: la ruta a %s contiene espacios,

source: this may cause problems when running LaTeX
es: esto puede causar problemas al ejecutar LaTeX

source: the output file '%s' has disappeared
es: el archivo de salida '%s' ha desaparecido

source: invalid value for %s : %s
es: valor no válido para %s: %s

source: value of 'results' option should be lowercase
es: el valor de la opción 'results' debe estar en minúsculas

source: value of 'strip.white' option should be lowercase
es: el valor de la opción 'strip.white' debe estar en minúsculas

source: elements of 'what' after the first will be ignored
es: los elementos de 'what' después del primero serán ignorados

source: Yes
es: Sí

source: Cancel
es: Cancelar

source: Unrecognized response
es: Respuesta desconocida

source: No suitable spell-checker program found
es: No se encontró ningún programa corrector ortográfico adecuado

source: Filter '%s' is not available.
es: El filtro '%s' no está disponible.

source: Invalid 'filter' argument.
es: Argumento 'filter' no válido.

source: The following dictionaries were not found: %s
es: No se encontraron los siguientes diccionarios: %s

source: Processing file %s
es: Procesando archivo %s

source: Running aspell failed with diagnostics: %s
es: Falló al ejecutar aspell con diagnóstico: %s

source: No suitable spell check program found.
es: No se encontró ningún programa de corrección ortográfica adecuado.

source: Performing query %s
es: Realizando consulta %s

source: Use <code> %s </code> to list the vignettes in all <strong>available</strong> packages.
es: Utilice <code> %s </code> para enumerar las viñetas en todos los paquetes <strong>disponibles</strong>.

source: No vignettes found by %s
es: No se encontraron viñetas mediante %s

source: Package %s: DESCRIPTION file not found
es: Paquete %s: archivo DESCRIPTION no encontrado

source: 'file' must be NULL, a character string or a connection
es: 'file' debe ser NULL, una cadena de caracteres o una conexión

source: 'full.names' must be TRUE for multiple paths.
es: 'full.names' debe ser TRUE para múltiples rutas.

source: Timestamp file no longer exists.
es: El archivo de marca de tiempo (Timestamp) ya no existe.

source: Not all arguments are of the same length, the following need to be recycled: %s
es: No todos los argumentos tienen la misma longitud, se debe reciclar lo siguiente: %s

source: Use either %s or %s/%s but not both.
es: Utilice %s o %s/%s, pero no ambos.

source: It is recommended to use %s instead of %s.
es: Se recomienda utilizar %s en lugar de %s.

source: Use either %s or %s but not both.
es: Utilice %s o %s, pero no ambos.

source: subscript out of bounds
es: subíndice fuera de límites

source: method is only applicable to %s objects
es: el método sólo es aplicable a %s objetos

source: all arguments must be of class %s
es: todos los argumentos deben ser de clase %s

source: all fields have to be named
es: todos los campos deben tener nombre

source: %s has to be one of %s
es: %s tiene que ser uno de %s

source: %s should be one of %s
es: %s debería ser uno de %s

source: To cite package %s in publications use:
es: Para citar el paquete %s en publicaciones utilice:

source: A BibTeX entry for LaTeX users is
es: Una entrada BibTeX para usuarios de LaTeX es

source: Dropping invalid entry %d: %s
es: Eliminar entrada no válida %d: %s

source: could not determine year for %s from package DESCRIPTION file
es: no se pudo determinar el año para %s del archivo DESCRIPTION del paquete

source: ATTENTION: This citation information has been auto-generated from the package DESCRIPTION file and may need manual editing, see %s.
es: ATENCIÓN: Esta información de cita se ha generado automáticamente a partir del archivo DESCRIPTION del paquete y es posible que necesite edición manual, consulte %s.

source: 'FUN' must be a function or NULL
es: 'FUN' debe ser una función o NULL

source: cannot handle S4 methods yet
es: aún no se pueden manejar métodos S4

source: 'package' must be a character vector or NULL
es: 'package' debe ser un vector de caracteres o NULL

source: data index for package %s is invalid and will be ignored
es: el índice de datos del paquete %s no es válido y será ignorado

source: data set %s not found
es: dataset %s no encontrado

source: an object named %s already exists and will not be overwritten
es: un objeto llamado %s ya existe y no será sobrescrito

source: only 'html = TRUE' is supported on this platform
es: sólo se admite 'html = TRUE' en esta plataforma

source: kind '%s' not yet implemented
es: tipo (kind) '%s' aún no implementado

source: wrong number of table row entries
es: número incorrecto de entradas de filas de la tabla

source: wrong argument to 'dataentry'
es: argumento incorrecto para 'dataentry'

source: could not restore type information
es: no se pudo restaurar la información de tipo

source: 'modes' argument ignored
es: argumento 'modes' ignorado

source: 'names' argument ignored
es: argumento 'names' ignorado

source: could not restore variables properly
es: no se pudieron restaurar las variables correctamente

source: did not assign() anything
es: assign() no asignó nada

source: Cannot debug primitive functions unless they are implicit generics (requires loading the methods package)
es: No se pueden depurar funciones primitivas a menos que sean genéricas implícitas (requiere cargar el paquete methods)

source: error in trying to evaluate the expression for argument %s (%s)
es: error al intentar evaluar la expresión del argumento %s (%s)

source: Browsing in the environment with call:
es: Buscando en el entorno con llamada:

source: 'dump' is not an object of class %s
es: 'dump' no es un objeto de clase %s

source: Message:
es: Mensaje:

source: 'dump' is empty
es: 'dump' está vacío

source: Available environments had calls:
es: Entornos disponibles tenían las llamadas:

source: Enter an environment number, or 0 to exit
es: Ingrese un número de entorno, o 0 para salir

source: recover called non-interactively; frames dumped, use debugger() to view
es: recover llamado de forma no interactiva; marcos de pila volcados, utilice debugger() para ver

source: No suitable frames for recover()
es: No hay marcos de pila adecuados para hacer recover()

source: No demo found for topic %s
es: No se encontró ninguna demo para %s

source: Demo for topic %s' found more than once, using the one found in %s
es: Demo para el tema %s' encontrado más de una vez, usando el que se encuentra en %s

source: invalid 'data' argument
es: argumento 'data' no válido

source: invalid 'modes' argument
es: argumento 'modes' no válido

source: invalid 'x' argument
es: argumento 'x' no válido

source: can only handle vector and factor elements
es: sólo puede manejar elementos vectoriales y factor

source: invalid factor levels in '%s'
es: niveles de factor no válidos en '%s'

source: added factor levels in '%s'
es: se agregaron niveles de factor en '%s'

source: edited row names contain duplicates and will be ignored
es: los nombres de las filas editadas contienen duplicados y serán ignorados

source: invalid input matrix
es: matriz de entrada no válida

source: class of 'name' will be discarded
es: la clase de 'name' será descartada

source: cannot edit NULL row names
es: no se pueden editar nombres de filas NULL

source: no help found for %s
es: no se encontró ayuda para %s

source: %s has a help file but no examples
es: %s tiene un archivo de ayuda pero no tiene ejemplos

source: Line number missing
es: Falta el número de línea

source: 'fix' requires a name
es: 'fix' requiere un nombre

source: too many list items (at most up to %d)
es: demasiados elementos de la lista (como máximo hasta %d)

source: no vector columns were selected
es: no se seleccionaron columnas vectoriales

source: non-vector columns will be ignored
es: las columnas que no sean vectoriales serán ignoradas

source: at least one vector element is required
es: se requiere al menos un elemento vectorial

source: non-vector elements will be ignored
es: los elementos que no sean vectoriales serán ignorados

source: 'form' must be a two-sided formula
es: 'form' debe ser una fórmula de dos caras

source: 'form' must be a two-sided formula with one term on each side
es: 'form' debe ser una fórmula de dos lados con un término en cada lado

source: invalid object for 'as.environment'
es: objeto no válido para 'as.environment'

source: invalid 'n' - must contain at least one non-missing element, got none.
es: 'n' no válido: debe contener al menos un elemento no faltante, no se obtuvo ninguno.

source: invalid 'n' - must be numeric, possibly NA.
es: 'n' no válido - debe ser numérico, posiblemente NA.

source: invalid 'n' - must have length one when dim(x) is NULL, got %d
es: 'n' no válido: debe tener longitud uno cuando dim(x) es NULL, se obtuvo %d

source: invalid 'n' - length(n) must be <= length(dim(x)), got %d > %d
es: 'n' no válido - length(n) debe ser <= length(dim(x)), se obtuvo %d > %d

source: no method found for %s(., n=%s) and class %s
es: no se encontró ningún método para %s(., n=%s) y clase %s

source: tail(., addrownums = V) is deprecated. Use
es: tail(., addrownums = V) es obsoleto. Usar

source: tail(., keepnums = V) instead.
es: tail(., keepnums = V) en su lugar.

source: tail(., addrownums=.) is
es: tail(., addrownums=.) es

source: deprecated. Use
es: en desuso. Usar

source: tail(., keepnums=.) instead.
es: tail(., keepnums=.) en su lugar.

source: 'topic' should be a name, length-one character vector or reserved word
es: 'topic' debe ser un nombre, un vector de un carácter de longitud o una palabra reservada

source: No documentation for %s in specified packages and libraries:
es: No hay documentación para %s en paquetes y bibliotecas especificados:

source: you could try %s
es: podría intentar %s

source: Help for topic %s is not in any loaded package but can be found in the following packages:
es: La ayuda para el tema %s no se encuentra en ningún paquete cargado, pero se puede encontrar en los siguientes paquetes:

source: Package
es: Paquete

source: Library
es: Biblioteca

source: Help on topic %s was found in the following packages:
es: Se encontró ayuda sobre el tema %s en los siguientes paquetes:

source: Choose one
es: Elija uno

source: Using the first match ...
es: Usando primer coincidencia...

source: HTML help is unavailable
es: La ayuda HTML no está disponible

source: R Help on %s
es: Ayuda de R en %s

source: invalid %s argument
es: argumento %s no válido

source: package %s exists but was not installed under R >= 2.10.0 so help cannot be accessed
es: el paquete %s existe pero no se instaló bajo R >= 2.10.0, por lo que no se puede acceder a la ayuda

source: creation of %s failed
es: creación de %s fallida

source: Saving help page to %s
es: Guardando la página de ayuda en %s

source: Cancelled by user
es: Cancelado por el usuario

source: Unable to connect to CRAN to check R version.
es: No se puede conectar a CRAN para verificar la versión R.

source: '%s' must be a character string
es: ' %s' debe ser una cadena de caracteres

source: incorrect field specification
es: especificación de campo incorrecta

source: do not know what to search
es: no se sabe qué buscar

source: argument 'help.db' is deprecated
es: el argumento 'help.db' es obsoleto

source: incorrect type specification
es: especificación de tipo incorrecta

source: no information in the database for package %s: need 'rebuild = TRUE'?
es: no hay información en la base de datos para el paquete %s: ¿se necesita 'rebuild = TRUE'?

source: incorrect 'agrep' specification
es: especificación 'agrep' incorrecta

source: package %s has empty hsearch data - strangely
es: el paquete %s tiene datos de hsearch vacíos - extrañamente

source: removing all entries with invalid multi-byte character data
es: eliminando todas las entradas con datos de caracteres multibyte no válidos

source: invalid browser name, check options("browser").
es: nombre de navegador no válido, verifique options("browser").

source: help.start() requires the HTTP server to be running
es: help.start() requiere que el servidor HTTP esté ejecutándose

source: If nothing happens, you should open %s yourself
es: Si no pasa nada, debería abrir %s usted mismo

source: If the browser launched by '%s' is already running, it is *not* restarted, and you must switch to its window.
es: Si el navegador iniciado por '%s' ya se está ejecutando, *no* se reinicia y usted debe ir a la ventana.

source: Otherwise, be patient ...
es: De lo contrario, tenga paciencia...

source: '%s' must be a non-empty character string
es: '%s' debe ser una cadena de caracteres no vacía

source: no package '%s' was found
es: no se encontró ningún paquete '%s'

source: metadata of package '%s' is corrupt
es: metadatos del paquete '%s' están corruptos

source: DESCRIPTION file of package '%s' is corrupt
es: El archivo DESCRIPTION del paquete '%s' está corrupto

source: 'DESCRIPTION' file has an 'Encoding' field and re-encoding is not possible
es: El archivo 'DESCRIPTION' tiene un campo 'Encoding' y no es posible volver a codificarlo

source: DESCRIPTION file of package '%s' is missing or broken
es: El archivo DESCRIPTION del paquete '%s' falta o está roto

source: Invalid "Built":
es: "Build" no válido:

source: cannot update HTML package index
es: no se puede actualizar el índice del paquete HTML

source: done
es: hecho

source: Source must be a seekable connection
es: La fuente debe ser una conexión que admita seek()

source: menu() cannot be used non-interactively
es: menu() no se puede utilizar de forma no interactiva

source: Enter an item from the menu, or 0 to exit
es: Ingrese un elemento del menú, o 0 para salir

source: %d errors caught in %s. The error messages and their frequencies are
es: %d errores detectados en %s. Los mensajes de error y sus frecuencias son

source: invalid query
es: consulta no válida

source: For SI units, specify 'standard = "SI"'
es: Para unidades SI, especifique 'standard = "SI"'

source: Unit "%s" is not part of standard "%s"
es: La unidad "%s" no forma parte del estándar "%s"

source: '%s' is a formal generic function; S3 methods will not likely be found
es: '%s' es una función genérica formal; es probable que no se encuentren los métodos S3

source: no function '%s' is visible
es: ninguna función '%s' es visible

source: generic function '%s' dispatches methods for generic '%s'
es: función genérica '%s' resuelve lo métodos para el genérico '%s'

source: function '%s' appears not to be S3 generic; found functions that look like S3 methods
es: la función '%s' parece no ser genérica de S3; se encontraron funciones que parecen métodos de S3

source: 'class' is of length > 1; only the first element will be used
es: 'clase' tiene una longitud > 1; sólo se utilizará el primer elemento

source: must supply 'generic.function' or 'class'
es: debe proporcionar 'generic.function' o 'class'

source: no function '%s' could be found
es: no se pudo encontrar ninguna función '%s'

source: S3 method '%s' not found
es: Método S3 '%s' no encontrado

source: environment specified is not a package
es: el entorno especificado no es un paquete

source: changing locked binding for %s in %s whilst loading %s
es: cambiando vinculación bloqueada para %s en %s mientras se carga %s

source: changing locked binding for %s in %s
es: cambiando vinculación bloqueda para %s en %s

source: 'fixInNamespace' requires a name
es: 'fixInNamespace' requiere un nombre

source: only numeric indices can be used
es: sólo se pueden utilizar índices numéricos

source: Malformed package name.
es: Nombre del paquete con formato incorrecto.

source: cannot create directory '%s'
es: no se puede crear el directorio '%s'

source: 'code_files' must be a character vector
es: 'code_files' debe ser un vector de caracteres

source: 'list' must be a character vector naming R objects
es: 'list' debe ser un vector de caracteres que nombre objetos R

source: no R objects specified or available
es: no hay objetos R especificados o disponibles

source: directory '%s' already exists
es: el directorio '%s' ya existe

source: generic functions and other S4 objects (e.g., '%s') cannot be dumped; use the 'code_files' argument
es: las funciones genéricas y otros objetos S4 (por ejemplo, '%s') no se pueden volcar; utilizar el argumento 'code_files'

source: unable to access index for repository %s
es: no se puede acceder al índice del repositorio %s

source: invalid 'filters' argument.
es: argumento 'filters' no válido.

source: specifying 'contriburl' or 'available' requires a single type, not type = "both"
es: especificar 'contriburl' o 'available' requiere un solo tipo, no type = "both"

source: package '%s' in library '%s' will not be updated
es: el paquete '%s' en la biblioteca '%s' no se actualizará

source: invalid 'oldPkgs'; must be a character vector or a result from old.packages()
es: 'oldPkgs' no válido; debe ser un vector de caracteres o un resultado de old.packages()

source: ill-formed 'instPkgs' matrix
es: matriz 'instPkgs' mal formada

source: no installed packages for (invalid?) 'lib.loc=%s'
es: no hay paquetes instalados para 'lib.loc=%s' (¿es válido?)

source: no new packages are available
es: no hay nuevos paquetes disponibles

source: metadata of %s is corrupt
es: metadatos de %s están corruptos

source: 'priority' must be character or NULL
es: 'priority' debe ser carácter o NULL

source: Updating HTML index of packages in '.Library'
es: Actualizando el índice HTML de paquetes en '.Library'

source: 'destdir' is not a directory
es: 'destdir' no es un directorio

source: no package %s at the repositories
es: no hay paquete %s en los repositorios

source: invalid 'type'
es: 'type' no válido

source: package %s does not exist on the local repository
es: el paquete %s no existe en el repositorio local

source: download of package %s failed
es: falló la descarga del paquete %s

source: --- Please select a CRAN mirror for use in this session ---
es: --- Seleccione un sitio espejo CRAN para usar en esta sesión ---

source: trying to use CRAN without setting a mirror
es: Intentando usar CRAN sin configurar un sitio espejo

source: 'download.file()' error code '%d'
es: 'download.file()' código de error '%d'

source: failed to download mirrors file (%s); using local file '%s'
es: no se pudo descargar el archivo de sitios espejo (%s); usando el archivo local '%s'

source: cannot choose a
es: no puedo elegir un

source: mirror non-interactively
es: sitio espejo de forma no interactiva

source: cannot set repositories non-interactively
es: no se pueden configurar repositorios de forma no interactiva

source: invalid options("pkgType"); must be a character string
es: options("pkgType") no válido; debe ser una cadena de caracteres

source: No matching repositories found for
es: No se encontraron repositorios coincidentes para

source: --- Please select repositories for use in this session ---
es: --- Seleccione los repositorios para usar en esta sesión ---

source: %s must be supplied
es: Se debe proporcionar %s

source: every package depends on at least one other
es: cada paquete depende al menos de otro

source: packages %s are mutually dependent
es: los paquetes %s son mutuamente dependientes

source: Do not know which element of 'lib' to install dependencies into skipping dependencies
es: No se sabe en qué elemento de 'lib' instalar las dependencias omitiendo dependencias

source: type 'binary' is not supported on this platform
es: el tipo 'binary' no es compatible con esta plataforma

source: no packages were specified
es: no se especificaron paquetes

source: 'lib = "%s"' is not writable
es: 'lib = "%s"' no se puede escribir

source: Would you like to use a personal library instead?
es: ¿Le gustaría utilizar una biblioteca personal en su lugar?

source: unable to install packages
es: no se pueden instalar paquetes

source: Would you like to create a personal library %s to install packages into?
es: ¿Le gustaría crear una biblioteca personal %s en la que instalar paquetes?

source: unable to create %s
es: no se puede crear %s

source: inferring 'repos = NULL' from 'pkgs'
es: infiriendo 'repos = NULL' de 'pkgs'

source: unable to create temporary directory %s
es: no se puede crear el directorio temporal %s

source: type == "both" can only be used on Windows or a CRAN build for macOS
es: type == "both" solo se puede usar en Windows o en una compilación CRAN para macOS

source: type == "both" cannot be used with 'repos = NULL'
es: tipo == "ambos" no se puede utilizar con 'repos = NULL'

source: source repository is unavailable to check versions
es: el repositorio de origen no está disponible para comprobar las versiones

source: cannot install macOS binary packages on Windows
es: no se pueden instalar paquetes binarios de macOS en Windows

source: cannot install macOS binary packages on this platform
es: no se pueden instalar paquetes binarios de macOS en esta plataforma

source: cannot install Windows binary packages on this platform
es: no se pueden instalar paquetes binarios de Windows en esta plataforma

source: This version of R is not set up to install source packages If it was installed from an RPM, you may need the R-devel RPM
es: Esta versión de R no está configurada para instalar paquetes fuente Si se instaló desde un RPM, es posible que necesite el RPM de R-devel

source: installation of package %s had non-zero exit status
es: la instalación del paquete %s tenía un estado de salida distinto de cero

source: foundpkgs: %s
es: paquetes encontrados: %s

source: files: %s
es: archivos: %s

source: Windows default 'timeout' command is not usable for parallel installs
es: El comando 'timeout' predeterminado de Windows no se puede utilizar para instalaciones paralelas
