Repository: daroczig/R-weblate-fork
Catalog: src/library/grDevices/po/*.po
Languages: es

source: '%s' must be numeric of length %d
es: '%s' debe ser numérico de longitud %d

source: Clipping path ignored (device is appending path)
es: Ruta de recorte ignorado (el dispositivo está anexando la ruta)

source: color intensity %s, not in [0,1]
es: intensidad de color %s no está en [0,1]

source: color intensity %g, not in [0,1]
es: intensidad de color %g no está en [0,1]

source: color intensity %s, not in 0:255
es: intensidad de color %s no está en 0:255

source: color intensity %d, not in 0:255
es: intensidad de color %d no está en 0:255

source: alpha level %s, not in [0,1]
es: nivel alfa %s no está en [0,1]

source: alpha level %g, not in [0,1]
es: nivel alfa %g no está en [0,1]

source: alpha level %s, not in 0:255
es: nivel alfa %s no está en 0:255

source: alpha level %d, not in 0:255
es: nivel alfa %d no está en 0:255

source: inputs must be finite
es: Las entradas deben ser finitas

source: bad hsv to rgb color conversion
es: conversión de color errónea de HSV a RGB

source: invalid hsv color
es: Color HSV no válido

source: invalid hcl color
es: color HCL no válido

source: invalid value of 'maxColorValue'
es: valor de maxColorValue no válido

source: invalid 'names' vector
es: vector 'names' inválido

source: invalid gray level, must be in [0,1].
es: nivel de gris no válido, debe estar en [0, 1].

source: invalid '%s' value
es: valor '%s' no válido

source: invalid hex digit in 'color' or 'lty'
es: dígito hexadecimal no válido en 'color' o 'lty'

source: invalid RGB specification
es: especificación RGB no válida

source: invalid color name '%s'
es: nombre de color no válido '%s'

source: invalid color specification "%s"
es: especificación de color no válida "%s"

source: supplied color is neither numeric nor character
es: color suministrado no es numérico ni de caracteres

source: numerical color values must be >= 0, found %d
es: los valores de color numéricos deben ser >= 0, se encontró %d

source: invalid argument type
es: tipo de argumento no válido

source: unknown palette (need >= 2 colors)
es: paleta desconocida (necesita >= 2 colores)

source: maximum number of colors is %d
es: el número máximo de colores es %d

source: afm file '%s' could not be opened
es: no se pudo abrir el archivo afm '%s'

source: unknown AFM entity encountered
es: se encontró una entidad AFM desconocida

source: invalid string in '%s'
es: cadena no válida en '%s'

source: font width unknown for character 0x%02x in encoding %s
es: ancho de fuente desconocido para el carácter 0x%02x en codificación %s

source: font metrics unknown for Unicode character U+%04X
es: métricas de fuente desconocidas para el carácter Unicode U+%04X

source: unknown encoding '%s' in 'PostScriptMetricInfo'
es: codificación desconocida '%s' en 'PostScriptMetricInfo'

source: Unicode character %lc (U+%04X) cannot be converted
es: El carácter Unicode %lc (U+%04X) no se puede convertir

source: font metrics unknown for character 0x%02x in encoding %s
es: métricas de fuente desconocidas para el carácter 0x%02x en la codificación %s

source: invalid character (%04X) sent to 'PostScriptCIDMetricInfo' in a single-byte locale
es: carácter no válido (%04X) enviado a 'PostScriptCIDMetricInfo' en una configuración regional de un solo byte

source: invalid character sent to 'PostScriptCIDMetricInfo' in a single-byte locale
es: carácter no válido enviado a 'PostScriptCIDMetricInfo' en una configuración regional de un solo byte

source: failed to allocate CID font info
es: no se pudo asignar memoria para la información de la fuente CID

source: failed to allocate Type 1 font info
es: no se pudo asignar memoria para la información de fuente Tipo 1

source: failed to allocate encoding info
es: no se pudo asignar memoria para información de codificación

source: failed to allocate CID font family
es: no se pudo asignar memoria para la familia de fuentes CID

source: failed to allocate Type 1 font family
es: no se pudo asignar memoria para la familia de fuentes Tipo 1

source: failed to allocate font list
es: no se pudo asignar memoria para la lista de fuentes

source: failed to allocated encoding list
es: no se pudo asignar memoria para la lista de codificación

source: truncated string which was too long for copy
es: cadena truncada que era demasiado larga para copiar

source: failed to load encoding file '%s'
es: no se pudo cargar el archivo de codificación '%s'

source: invalid font name or more than one font name
es: nombre de fuente no válido o más de un nombre de fuente

source: font family '%s' not found in PostScript font database
es: la familia de fuentes '%s' no se encuentra en la base de datos de fuentes PostScript

source: font encoding for family '%s' not found in font database
es: codificación de fuente para la familia '%s' no encontrada en la base de datos de fuentes

source: font CMap for family '%s' not found in font database
es: fuente CMap para la familia '%s' no encontrada en la base de datos de fuentes

source: cannot load afm file '%s'
es: no se puede cargar el archivo afm '%s'

source: corrupt loaded encodings; encoding not recorded
es: codificaciones cargadas corruptas; la codificación no fue registrada

source: failed to record device encoding
es: no se pudo grabar la codificación del dispositivo

source: object '.ps.prolog' is not a character vector
es: el objeto '.ps.prolog' no es un vector de caracteres

source: invalid line end
es: final de línea no válido

source: invalid line join
es: unión de línea no válida

source: invalid line mitre
es: inglete de línea no válida

source: attempt to use invalid font %d replaced by font 1
es: intento de utilizar una fuente no válida %d reemplazada por la fuente 1

source: filename too long in %s()
es: nombre de archivo demasiado largo en %s()

source: memory allocation problem in %s()
es: problema de asignación de memoria en %s()

source: encoding path is too long in %s()
es: la ruta de codificación es demasiado larga en %s()

source: failed to load encoding file in %s()
es: no se pudo cargar el archivo de codificación en %s()

source: invalid font type
es: tipo de fuente no válido

source: failed to initialise default PostScript font
es: no se pudo inicializar la fuente PostScript predeterminada

source: failed to initialise additional PostScript fonts
es: no se pudieron inicializar fuentes PostScript adicionales

source: invalid foreground/background color (postscript)
es: color de primer plano/fondo no válido (posdata)

source: 'command' is too long
es: command' es demasiado largo

source: 'postscript(print.it=TRUE)' used with an empty 'print' command
es: postscript(print.it=TRUE)' usado con un comando 'print' vacío

source: invalid page type '%s' (postscript)
es: tipo de página '%s' no válido (postscript)

source: semi-transparency is not supported on this device: reported only once per page
es: la semitransparencia no es soportada en este dispositivo: se informa solo una vez por página

source: cannot open 'postscript' pipe to '%s'
es: no se puede abrir la tubería 'postscript' a '%s'

source: cannot open file '%s'
es: no se puede abrir el archivo '%s'

source: error from postscript() in running: %s
es: error de postscript() al ejecutar: %s

source: CID family '%s' not included in postscript() device
es: la familia CID '%s' no está incluida en el dispositivo postscript()

source: family '%s' not included in postscript() device
es: familia '%s' no incluida en el dispositivo postscript()

source: unknown encoding '%s' in 'mbcsToSbcs'
es: codificación desconocida '%s' en 'mbcsToSbcs'

source: conversion failure on '%s' in 'mbcsToSbcs': for <%02x>
es: error de conversión en '%s' en 'mbcsToSbcs': para <%02x>

source: conversion failure on '%s' in 'mbcsToSbcs': dot substituted for <%02x>
es: error de conversión en '%s' en 'mbcsToSbcs': punto sustituido por <%02x>

source: failed open converter to encoding '%s'
es: error al abrir el convertidor para codificar '%s'

source: failed in text conversion to encoding '%s'
es: error en la conversión de texto a la codificación '%s'

source: ran out of colors in xfig()
es: no quedan más colores en xfig()

source: unimplemented line texture %08x: using Dash-double-dotted
es: textura de línea no implementada %08x: usando guión de doble punto

source: unknown postscript font family '%s', using Helvetica
es: familia de fuentes postscript desconocida '%s', se usa Helvetica

source: invalid foreground/background color (xfig)
es: color de primer plano/fondo no válido (xfig)

source: only Type 1 fonts supported for XFig
es: solo se admiten fuentes Tipo 1 para XFig

source: failed to initialise default XFig font
es: no se pudo inicializar la fuente XFig predeterminada

source: invalid page type '%s' (xfig)
es: tipo de página no válida '%s' (xfig)

source: xfig(%s, onefile=FALSE) will only return the last plot
es: xfig(%s, onefile=FALSE) solo devolverá el último gráfico

source: empty file name
es: nombre de archivo vacío

source: write failed
es: no se pudo escribir

source: unable to use encoding '%s'
es: no se puede utilizar la codificación '%s'

source: Failed to allocate PDF definition string
es: No se pudo asignar memoria para la cadena de definición de PDF

source: failed to increase definition string (shut down PDF device)
es: no se pudo aumentar la cadena de definición (se apaga el dispositivo PDF)

source: failed to increase 'maxDefns'
es: no se pudo aumentar 'maxDefns'

source: Drawing not appended to path (contains text)
es: Dibujo no añadido a la ruta (contiene texto)

source: Compositing operator has no corresponding blend mode; defaulting to Normal
es: El operador de composición no tiene un modo de combinación correspondiente; se usa Normal por defecto

source: Failed to write PDF clipping path
es: No se pudo escribir la ruta de recorte del PDF

source: Failed to write PDF stroke
es: No se pudo escribir el trazo del PDF

source: Failed to write PDF fill
es: No se pudo escribir el relleno del PDF

source: Failed to write PDF fillStroke
es: No se pudo escribir PDF fillStroke

source: Glyph ID larger than 0xFFFF; output will be incorrect
es: ID de glifo mayor que 0xFFFF; la salida será incorrecta

source: invalid 'alpha' value in PDF
es: valor 'alpha' no válido en PDF

source: failed to increase 'maxRaster'
es: no se pudo aumentar 'maxRaster'

source: unable to allocate raster image
es: no se puede asignar memoria para una imagen rasterizada

source: corrupt loaded encodings; font not added
es: codificaciones cargadas corruptas; fuente no agregada

source: failed to record device encoding; font not added
es: no se pudo registrar la codificación del dispositivo; fuente no agregada

source: increasing the PDF version to 1.2
es: aumentando la versión PDF a 1.2

source: failed to load default encoding
es: no se pudo cargar la codificación predeterminada

source: failed to initialise default PDF font
es: no se pudo inicializar la fuente PDF predeterminada

source: failed to initialise additional PDF fonts
es: no se pudieron inicializar fuentes PDF adicionales

source: failed to allocate rasters
es: no se pudo asignar memoria para rásteres

source: failed to allocate masks
es: no se pudo asignar memoria para máscaras

source: failed to allocate definitions
es: no se pudo asignar memoria para definiciones

source: invalid paper type '%s' (pdf)
es: tipo de papel no válido '%s' (pdf)

source: invalid foreground/background color (pdf)
es: color de primer plano/fondo no válido (pdf)

source: increasing the PDF version to 1.4
es: aumentando la versión PDF a 1.4

source: unknown 'colormodel', using 'srgb'
es: 'colormodel' desconocido, usando 'srgb'

source: failed to load sRGB colorspace file
es: no se pudo cargar el archivo de espacio de color sRGB

source: corrupt encodings in PDF device
es: codificaciones corruptas en el dispositivo PDF

source: increasing the PDF version to 1.3
es: aumentando la versión PDF a 1.3

source: cannot open 'pdf' pipe to '%s'
es: no se puede abrir la tubería 'pdf' a '%s'

source: file = "|cmd" implies 'onefile = TRUE'
es: file = "|cmd" implica 'onefile = TRUE'

source: cannot open 'pdf' file argument '%s' please shut down the PDF device
es: no se puede abrir el argumento del archivo 'pdf' '%s' por favor apague el dispositivo PDF

source: Cannot open temporary file '%s' for compression (reason: %s); compression has been turned off for this device
es: No se puede abrir el archivo temporal '%s' para compresión (motivo: %s); la compresión se ha desactivado para este dispositivo

source: failed to find or load PDF font
es: no se pudo encontrar o cargar la fuente PDF

source: Text not added to path containing other drawing
es: Texto no agregado a la ruta que contiene otro dibujo

source: failed to find or load PDF CID font
es: no se pudo encontrar o cargar la fuente PDF CID

source: invalid 'file' parameter in %s
es: parámetro 'file' no válido en %s

source: invalid 'family' parameter in %s
es: parámetro 'familiy' no válido en %s

source: invalid 'fonts' parameter in %s
es: parámetro 'fonts' no válido en %s

source: invalid value of '%s'
es: valor no válido de '%s'

source: unable to start %s() device
es: no se puede iniciar el dispositivo %s()

source: Quartz gradients exhausted (failed to increase maxPatterns)
es: Gradientes Quartz agotados (no se pudo aumentar maxPatterns)

source: Quartz patterns exhausted (failed to increase maxPatterns)
es: Patrones Quartz agotados (no se pudo aumentar maxPatterns)

source: Attempt to release non-existent pattern
es: Intento de liberar un patrón inexistente

source: Quartz patterns exhausted
es: Patrones Quartz agotados

source: Failed to create gradient
es: No se pudo crear el degradado

source: Unsupported gradient fill extend type; using 'pad'
es: Tipo de extensión de relleno degradado no admitido; se usa 'pad'

source: Failed to create pattern
es: No se pudo crear el patrón

source: Unsupported pattern extend mode; using "repeat"
es: Modo de extensión de patrón no soportado; usando "repeat"

source: Quartz clipping paths exhausted (failed to increase maxClipPaths)
es: Rutas de recorte Quartz agotadas (no se pudo aumentar maxClipPaths)

source: Quartz clipping paths exhausted
es: Rutas de recorte Quartz agotadas

source: Failed to create clipping path
es: No se pudo crear ruta de recorte

source: Quartz masks exhausted (failed to increase maxMasks)
es: Máscaras Quartz agotadas (no se pudo aumentar maxMasks)

source: Quartz masks exhausted
es: Máscaras Quartz agotadas

source: Failed to create Quartz mask
es: No se pudo crear la máscara Quartz

source: Quartz groups exhausted (failed to increase maxGroups)
es: Grupos Quartz agotados (no se pudo aumentar maxGroups)

source: Attempt to release non-existent group
es: Intento de liberar grupo inexistente

source: Quartz groups exhausted
es: Grupos Quartz agotados

source: Add compositing operator not supported; falling back to over
es: No se admite agregar operador de composición; volviendo atrás a "over"

source: Groups exhausted
es: Grupos agotados

source: font "%s" could not be found for family "%s"
es: no se pudo encontrar la fuente "%s" para la familia "%s"

source: font family name is too long
es: el nombre de la familia de fuentes es demasiado largo

source: no font could be found for family "%s"
es: no se pudo encontrar ninguna fuente para la familia "%s"

source: Attempt to reuse non-existent clipping path
es: Intentar reutilizar un trazado de recorte inexistente

source: Attempt to release non-existent clipping path
es: Intento de liberar el trazado de recorte inexistente

source: Ignored alpha mask (not supported on this device)
es: Máscara alfa ignorada (no se admite en este dispositivo)

source: Attempt to release non-existent mask
es: Intento de liberar una máscara inexistente

source: Failed to load font
es: No se pudo cargar la fuente

source: invalid 'file' argument
es: argumento 'file' no válido

source: invalid quartz() device size
es: tamaño del dispositivo Quartz() no válido

source: unable to create device description
es: no se puede crear la descripción del dispositivo

source: unable to create quartz() device target, given type may not be supported
es: no se puede crear el destino del dispositivo quartz(); es posible que el tipo determinado no esté soportado

source: Quartz device is not available on this platform
es: El dispositivo Quartz no está disponible en esta plataforma

source: Not enough memory to copy graphics window
es: No hay suficiente memoria para copiar la ventana de gráficos

source: No device available to copy graphics window
es: No hay ningún dispositivo disponible para copiar la ventana de gráficos

source: '%%' is not allowed in file name
es: '%%' no está permitido en el nombre del archivo

source: invalid font specification
es: especificación de fuente no válida

source: font family not found in Windows font database
es: familia de fuentes no encontrada en la base de datos de fuentes de Windows

source: plot history seems corrupted
es: historial de gráficos parece corrupta

source: no plot history!
es: ¡sin historial de gráficos!

source: filename too long in %s() call
es: nombre de archivo demasiado largo en la llamada %s()

source: 'width=%d, height=%d' are unlikely values in pixels
es: width=%d, height=%d' son valores improbables en píxeles

source: unable to allocate bitmap
es: no se puede asignar memoria para mapa de bits

source: unable to open file '%s' for writing
es: no se puede abrir el archivo '%s' para escritura

source: filename too long in jpeg() call
es: nombre de archivo demasiado largo en la llamada jpeg()

source: filename too long in tiff() call
es: nombre de archivo demasiado largo en la llamada tiff()

source: filename too long in win.metafile() call
es: nombre de archivo demasiado largo en la llamada win.metafile()

source: unable to open metafile '%s' for writing
es: no se puede abrir el metarchivo '%s' para escritura

source: unable to open clipboard to write metafile
es: no se puede abrir el portapapeles para escribir el metarchivo

source: Insufficient memory for resize. Killing device
es: Memoria insuficiente para cambiar el tamaño. Matando dispositivo

source: Insufficient memory for resize. Disabling alpha blending
es: Memoria insuficiente para cambiar el tamaño. Se deshabilita la composición alfa

source: a clipboard metafile can store only one figure.
es: un metarchivo del portapapeles puede almacenar sólo una figura.

source: metafile '%s' could not be created
es: no se pudo crear el metarchivo '%s'

source: R Graphics
es: Gráficos R

source: attempt to use the locator after dev.hold()
es: intente utilizar el localizador después de dev.hold()

source: graphics device closed during call to locator or identify
es: dispositivo gráfico cerrado durante la llamada para localizar o identificar

source: option 'windowsTimeouts' should be integer
es: la opción 'windowsTimeouts' debe ser un número entero

source: invalid device number in 'savePlot'
es: número de dispositivo no válido en 'savePlot'

source: invalid device in 'savePlot'
es: dispositivo no válido en 'savePlot'

source: invalid filename argument in 'savePlot'
es: argumento de nombre de archivo no válido en 'savePlot'

source: invalid type argument in 'savePlot'
es: argumento de tipo no válido en 'savePlot'

source: unknown type in savePlot
es: tipo desconocido en savePlot

source: processing of the plot ran out of memory
es: sin memoria mientras se procesaba el gráfico

source: Impossible to open
es: Imposible abrir

source: invalid 'width' or 'height'
es: width' o 'height' no válidos

source: argument must have positive length
es: el argumento debe tener una longitud positiva

source: invalid argument
es: argumento no válido

source: NA argument is invalid
es: argumento NA no es válido

source: Group definition ignored (device is appending path)
es: Se ignora la definición de grupo (el dispositivo está agregando la ruta)

source: Group use ignored (device is appending path)
es: Se ignora el uso del grupo (el dispositivo está agregando la ruta)

source: Mask ignored (device is appending path)
es: Máscara ignorada (el dispositivo está agregando la ruta)

source: QuartzBitmap_Output - unable to open file '%s'
es: QuartzBitmap_Output: no se puede abrir el archivo '%s'

source: not a supported scheme, no image data written
es: no es un esquema soportado, no se escribieron datos de imagen

source: invalid '%s' argument
es: argumento '%s' no válido

source: unimplemented cairo-based device
es: dispositivo basado en Cairo no implementado

source: could not open file '%s'
es: no se pudo abrir el archivo '%s'

source: unable to start device '%s'
es: no se puede iniciar el dispositivo '%s'

source: Cairo patterns exhausted (failed to increase maxPatterns)
es: Patrones Cairo agotados (no se pudo aumentar maxPatterns)

source: Cairo patterns exhausted
es: Patrones Cairo agotados

source: Cairo clipping paths exhausted (failed to increase maxClipPaths)
es: Las rutas de recorte de Cairo están agotados (no se pudo aumentar maxClipPaths)

source: Cairo clipping paths exhausted
es: Las rutas de recorte de Cairo están agotados

source: Cairo masks exhausted (failed to increase maxMasks)
es: Máscaras Cairo agotadas (no se pudo aumentar maxMasks)

source: Cairo masks exhausted
es: Máscaras Cairo agotadas

source: Ignored luminance mask (not supported on this device)
es: Máscara de luminancia ignorada (sin soporte en este dispositivo)

source: Cairo groups exhausted (failed to increase maxGroups)
es: Grupos Cairo agotados (no se pudo aumentar maxGroups)

source: Cairo groups exhausted
es: grupos Cairo agotados

source: Font file not found; matching font family and face
es: Archivo de fuente no encontrado; haciendo coincidir familia y tipo de letra
