Repository: daroczig/R-weblate-fork
Catalog: src/library/grDevices/po/R-*.po
Languages: es

source: invalid 'filename'
es: nombre de archivo invalido

source: svg: Cairo-based devices are not available for this platform
es: svg: los dispositivos basados en Cairo no están disponibles para esta plataforma

source: cairo_pdf: Cairo-based devices are not available for this platform
es: cairo_pdf: dispositivos basados en Cairo no están disponibles para esta plataforma

source: cairo_ps: Cairo-based devices are not available for this platform
es: cairo_pdf: dispositivos basados en Cairo no están disponibles para esta plataforma

source: 'coef' must not be negative
es: «coef» no debe ser negativo

source: no 'z' matrix specified
es: No se ha especificado ninguna matriz 'z'

source: increasing 'x' and 'y' values expected
es: Aumento de los valores 'x' e 'y' esperados

source: no proper 'z' matrix specified
es: No se ha especificado una matriz 'z' adecuada

source: dimensions of 'x', 'y' and 'z' do not match
es: Las dimensiones de 'x', 'y' y 'z' no coinciden

source: finite coordinates are needed
es: Se necesitan coordenadas finitas

source: 'bias' must be positive
es: El "sesgo" debe ser positivo

source: 'alpha' must be false if 'space' is specified
es: 'alpha' debe ser FALSE si se especifica 'space'

source: at least 3 columns needed
es: se requieren al menos 3 columnas

source: rgb matrix must be numeric
es: la matriz rgb debe ser numérica

source: rgb matrix must have 3 rows
es: la matriz rgb debe tener 3 filas

source: rgb values must be in [0, maxColorValue]
es: los valores rgb deben estar en [0, maxColorValue]

source: 'start' and 'end' must be distinct and in [0, 1].
es: 'start' y 'end' deben ser distintos y estar en [0, 1].

source: 'palette' does not match any given palette
es: 'palette' no coincide con ninguna paleta dada

source: 'palette' is ambiguous
es: 'palette' es ambiguo

source: 'n' set to %s, the maximum available for %s palette
es: se establece 'n' en %s, el máximo disponible para la paleta %s

source: 'gamma' must be a scalar or 'sRGB'
es: 'gamma' debe ser un escalar o 'sRGB'

source: Color space converter: %s
es: Convertidor de espacio de color: %s

source: Reference white: %s
es: Blanco de referencia: %s

source: display gamma = %s
es: gamma de visualización = %s

source: 'from' must be a "colorConverter" object or a string
es: 'from' debe ser un objeto "colorConverter" o una cadena

source: 'to' must be a "colorConverter" object or a string
es: 'to' debe ser un objeto "colorConverter" o una cadena

source: 'from.ref.white' disagrees with definition of %s
es: 'from.ref.white' no concuerda con la definición de %s

source: 'to.ref.white' disagrees with definition of %s
es: 'to.ref.white' no concuerda con la definición de %s

source: color spaces use different reference whites
es: los espacios de color utilizan diferentes blancos de referencia

source: 'name' must be a character vector
es: 'name' debe ser un vector de caracteres

source: cannot shut down device 1 (the null device)
es: no se puede cerrar el dispositivo 1 (el dispositivo nulo)

source: cannot supply 'which' and 'device' at the same time
es: no puede proporcionar 'which' y 'device' al mismo tiempo

source: cannot copy from the null device
es: no se puede copiar desde el dispositivo nulo

source: cannot copy to the null device
es: no se puede copiar en el dispositivo nulo

source: cannot copy device to itself
es: no se puede copiar el dispositivo a sí mismo

source: 'device' should be a function
es: 'device' debe ser una función

source: no device to print from
es: no hay dispositivo desde el que imprimir

source: can only print from a screen device
es: solo se puede imprimir desde un dispositivo de pantalla

source: need to specify one of 'width' and 'height'
es: se requiere especificar o bien 'ancho' o bien 'alto'

source: dev.control() called without an open graphics device
es: dev.control() sin un dispositivo de gráficos abierto

source: argument is missing with no default
es: el argumento está ausente, sin valor por omisión

source: dev.displaylist() called without an open graphics device
es: se llamó a dev.displaylist() sin un dispositivo gráfico abierto

source: invalid setting for 'getOption("device")'
es: configuración no válida para 'getOption("device")'

source: device '%s' not found
es: dispositivo '%s' no encontrado

source: no suitable unused file name for pdf()
es: no hay un nombre de archivo adecuado no utilizado para pdf()

source: dev.new(): using pdf(file="%s")
es: dev.new(): usando pdf(file="%s")

source: no suitable unused file name for postscript()
es: no hay un nombre de archivo adecuado no utilizado para postscript()

source: dev.new(): using postscript(file="%s")
es: dev.new(): usando postscript(file="%s")

source: Invalid capabilities - alert the device maintainer
es: Capacidades no válidas: avisar al mantenedor del dispositivo

source: Invalid span weight
es: Grosor de tipografía no válido

source: length of arguments must match (and be greater than 0)
es: la longitud de los argumentos debe coincidir (y ser mayor que 0)

source: Invalid glyph width(s)
es: Ancho(s) de glifo(s) no válido(s)

source: Invalid glyph width
es: Ancho de glifo no válido

source: Unknown width; using left anchor
es: Ancho desconocido; Uso del anclaje izquierdo

source: Invalid glyph height(s)
es: Altura(s) de glifo(s) no válida(s)

source: Invalid glyph height
es: Altura de glifo no válida

source: Unknown height; using bottom anchor
es: Alto desconocido; Se utiliza anclaje inferior

source: Invalid glyph anchor
es: Anclaje de glifo no válido

source: Font file longer than 500 will be truncated
es: El archivo de fuentes mayor a 500 se truncará

source: Font family longer than 200 will be truncated
es: La familia de fuentes mayor a 200 se truncará

source: PostScript font name longer than 200 will be truncated
es: El nombre de fuente PostScript de más de 200 se truncará

source: Font information is inconsistent
es: La información de fuente es inconsistente

source: List must include at least one font
es: La lista debe incluir al menos una fuente

source: Invalid glyph font
es: Fuente de glifo no válida

source: Invalid font list
es: Lista de fuentes no válidas

source: Unknown font
es: Fuente desconocida

source: There must be anchors named "left" and "bottom"
es: Debe haber anclajes llamados "left" (izquierda) y "bottom" (inferior)

source: Invalid glyph info
es: Información de glifo no válida

source: Invalid compositing operator
es: Operador de composición no válido

source: wrong 'type'; should never happen, please report!
es: 'type' incorrecto; nunca debería suceder, ¡por favor repórtelo!

source: Invalid mask type
es: Tipo de máscara no válido

source: Invalid fill rule
es: Regla de relleno no válida

source: Invalid pattern type
es: Tipo de patrón no válido

source: Invalid 'extend' value
es: Valor 'extend' no válido

source: '%s' is deprecated.
es: '%s' es obsoleto.

source: invalid arguments in '%s' (need named args)
es: Argumentos no válidos en '%s' (se requieren argumentos con nombre)

source: 'name.opt' must be character, name of an existing list
es: 'name.opt' debe ser de tipo carácter (el nombre de una lista existente)

source: cannot reset non-existent '%s'
es: no se pueden restablecer los '%s' inexistentes

source: invalid options in '%s'
es: opciones no válidas en '%s'

source: NOT changing %s
es: no se cambia/n %s

source: argument 'append' is for back-compatibility and will be ignored
es: El argumento 'append' es para compatibilidad con versiones anteriores y se ignorará

source: unknown family '%s'
es: familia desconocida '%s'

source: invalid 'family' argument
es: argumento 'family' no válido

source: 'title' argument "%s" contains invalid characters
es: el argumento 'title' "%s" contiene caracteres no válidos

source: invalid 'file' argument '%s'
es: argumento 'archivo' no válido '%s'

source: invalid PDF version
es: versión de PDF no válida

source: Invalid font type
es: Tipo de fuente no válido

source: invalid family name in font specification
es: nombre de familia no válido en la especificación de fuente

source: invalid metric information in font specification
es: información de métrica no válida en la especificación de fuente

source: invalid encoding in font specification
es: codificación no válida en la especificación de fuente

source: Not a CID font
es: No es una fuente CID

source: invalid CMap name in font specification
es: nombre CMap no válido en la especificación de fuente

source: invalid 'cmapEncoding' in font specification
es: 'cmapEncoding' no válido en la especificación de fuente

source: invalid PDF resource in font specification
es: recurso PDF no válido en la especificación de fuente

source: Invalid font database name
es: Nombre de base de datos de fuentes no válido

source: font %s already in use
es: la fuente %s ya está en uso

source: invalid arguments in '%s' (must be font names)
es: argumentos no válidos en '%s' (deben ser nombres de fuente)

source: unknown font
es: fuente desconocida

source: font encoding mismatch '%s'/'%s'
es: codificación de fuentes no coincide: '%s'/'%s'

source: '%s' must be a non-empty character string
es: '%s' debe ser una cadena de caracteres no vacía

source: GhostScript was not found
es: no se encontró GhostScript

source: invalid output format
es: formato de salida no válido

source: status %d in running command '%s'
es: estado %d al ejecutar el comando '%s'

source: 'file' must be a non-empty character string
es: 'file' debe ser una cadena de caracteres no vacía

source: Invalid 'glyphInfo'
es: 'glyphInfo' no válido

source: failed to add more ticks; 'min.n' too large?
es: no se pueden agregar más marcas de graduación; ¿'min.n' demasiado grande?

source: a raster matrix must be character, or numeric, or logical
es: una matriz ráster debe ser de caracteres, numérica o lógica

source: a raster array must be numeric
es: una matriz ráster debe ser numérica

source: a raster array must have exactly 3 dimensions
es: una matriz ráster debe tener exactamente 3 dimensiones

source: a raster array must have exactly 3 or 4 planes
es: una matriz ráster debe tener exactamente 3 o 4 planos

source: 'drop' is always implicitly FALSE in '[.raster'
es: 'drop' siempre es implícitamente FALSE en '[.raster'

source: invalid raster subsetting
es: especificación de subconjunto de ráster no válida

source: invalid raster subassignment
es: asignación de subconjunto de ráster no válida

source: operator not meaningful for raster objects
es: el operador no tiene sentido para objetos ráster

source: no current device to record from
es: no hay ningún dispositivo actual desde el que grabar

source: argument is not of class %s
es: el argumento no es de clase %s

source: invalid "recordedplot":
es: "recordedplot" no válido:

source: snapshot recorded in different R version (pre 3.3.0)
es: instantánea grabada en otra versión de R (anterior a 3.3.0)

source: snapshot recorded in different R version (%s)
es: instantánea grabada en otra versión de R (%s)

source: snapshot contains invalid graphics call
es: la instantánea contiene una llamada de gráficos no válida

source: 'nbin' must be numeric of length 1 or 2
es: 'nbin' debe ser numérico de longitud 1 o 2

source: 'bandwidth' must be numeric
es: 'bandwidth' debe ser numérico

source: 'bandwidth' must be positive
es: 'bandwidth' debe ser positivo

source: Must have the ('Recommended') package "KernSmooth" installed
es: Debe tener instalado el ('recomendado') paquete "KernSmooth"

source: 'r' must be a "range", hence of length 2
es: 'r' debe ser un rango, por lo tanto, de longitud 2

source: points cut off after point[%d]
es: puntos recortados después del punto[%d]

source: invalid first argument
es: primer argumento no válido

source: 'x' is a list, but does not have components 'x' and 'y'
es: 'x' es una lista, pero no tiene componentes 'x' e 'y'

source: 'x' and 'y' lengths differ
es: las longitudes 'x' e 'y' difieren

source: invalid first argument [bad language object]
es: primer argumento no válido [objeto de lenguaje incorrecto]

source: at least 2 columns needed
es: se requieren al menos 2 columnas

source: 'x' is a list, but does not have components 'x', 'y' and 'z'
es: 'x' es una lista, pero no tiene los componentes 'x', 'y' y 'z'

source: 'x', 'y' and 'z' lengths differ
es: las longitudes de 'x', 'y' y 'z' difieren

source: 'file' is missing with no default
es: 'file' está ausente, sin valor por omisión

source: unrecognized format of gs -help
es: formato de "gs -help" no reconocido

source: device '%s' is not available
es: el dispositivo '%s' no está disponible

source: Available devices are: %s
es: Los dispositivos disponibles son: %s

source: invalid width
es: ancho no válido

source: invalid height
es: alto no válido

source: 'res' must be specified unless 'units = "px"'
es: 'res' debe especificarse a menos que 'units = "px"'

source: 'filename' must be a non-empty character string
es: 'filename' debe ser una cadena de caracteres no vacía

source: type = "quartz" is unavailable. trying "Xlib"
es: type = "quartz" no está disponible. Probando "Xlib"

source: type = "cairo" is unavailable. trying "Xlib"
es: type = "Cairo" no está disponible. Probando "Xlib"

source: type = "cairo-png" is unavailable. trying "Xlib"
es: type = "cairo-png" no está disponible. Probando "Xlib"

source: compression is not supported for type = "quartz"
es: la compresión no es compatible con type = "Quartz"

source: invalid 'title'
es: 'Título' no válido

source: invalid 'file'
es: archivo ('file') no válido

source: invalid Quartz font: must be 4 strings
es: fuente Quartz no válida: deben ser 4 cadenas

source: invalid arguments in 'quartzFonts' (must be font names)
es: argumentos no válidos en 'quartzFonts' (deben ser nombres de fuentes)

source: invalid arguments in 'quartzFonts' (need named args)
es: argumentos no válidos en 'quartzFonts' (se requieren argumentos con nombre)

source: cairo-based types are not supported on this build - using "Xlib"
es: los tipos basados en Cairo no son soportados en esta compilación - usando "Xlib"

source: unknown family for X11(type = "XLib")
es: familia desconocida para X11(type = "XLib")

source: invalid X11 font specification:
es: especificación de fuente X11 no válida:

source: invalid arguments in 'X11Fonts' (must be font names)
es: argumentos no válidos en 'X11Fonts' (deben ser nombres de fuente)

source: invalid arguments in 'X11Fonts' (need named args)
es: argumentos no válidos en 'X11Fonts' (se requieren argumentos con nombre)

source: no such device
es: no existe el dispositivo

source: can only copy from 'X11(type="*cairo")' devices
es: solo se puede copiar desde dispositivos 'X11(type="*cairo")'

source: invalid value for 'rescale'
es: valor no válido para 'rescale'

source: Calls like '%s' are unsafe and should be replaced by '%s'
es: Las llamadas como '%s' no son seguras y deben reemplazarse por '%s'

source: can only bring windows devices to the front
es: solo pueden traer al frente los dispositivos de tipo ventana

source: 'type' not applicable to the R console
es: 'type' no es aplicable a la consola de R

source: can only manipulate windows devices
es: solo se pueden manipular dispositivos de tipo ventana

source: can only copy from 'windows' devices
es: solo se puede copiar desde dispositivos tipo ventana

source: subscript out of range
es: subíndice fuera de rango

source: invalid Windows font: must be a single font family name
es: fuente de Windows no válida: debe ser un solo nombre de familia de fuentes

source: invalid arguments in 'windowsFonts' (must be font names)
es: argumentos no válidos en 'windowsFonts' (deben ser nombres de fuente)

source: invalid arguments in 'windowsFonts' (need named args)
es: argumentos no válidos en 'windowsFonts' (se requieren argumentos con nombre)

source: invalid argument name %s in '%s'
es: nombre de argumento no válido %s en '%s'

source: differs between new and previous
es: difiere entre el nuevo y el anterior

source: %d %s value <= 0 omitted from logarithmic plot
es: %d valor %s <= 0 omitido en el gráfico logarítmico
