Repository: daroczig/R-weblate-fork
Catalog: src/library/parallel/po/*.po
Languages: pt_br

source: unable to terminate child process: %s
pt_br: não foi possível encerrar o processo filho: %s

source: unable to terminate child: %s
pt_br: incapaz de encerrar o filho: %s

source: memory allocation error
pt_br: Erro de alocação de memória

source: invalid '%s' argument
pt_br: argumento '%s' inválido

source: Error while shutting down parallel: unable to terminate some child processes
pt_br: Erro ao desligar o paralelo: não foi possível encerrar algum(s) processo(s) filho(s)

source: unable to create a pipe
pt_br: Não foi possível criar um pipe

source: unable to fork, possible reason: %s
pt_br: incapaz de bifurcar, possível motivo: %s

source: only children can send data to the master process
pt_br: Somente filhos podem enviar dados para o processo mestre

source: there is no pipe to the master process
pt_br: não há pipe para o processo mestre

source: content to send must be RAW, use serialize() if needed
pt_br: o conteúdo a ser enviado deve ser RAW, use serialize() se necessário

source: only the master process can send data to a child process
pt_br: Somente o processo mestre pode enviar dados para um processo filho

source: child %d does not exist
pt_br: filho %d não existe

source: cannot wait for child %d as it does not exist
pt_br: não pode esperar pelo filho %d, pois ele não existe

source: error '%s' in select
pt_br: erro '%s' em select

source: 'mckill' failed
pt_br: 'mckill' falhou

source: 'mcexit' can only be used in a child process
pt_br: 'mcexit' só pode ser usado em um processo filho

source: 'mcexit' failed
pt_br: 'mcexit' falhou

source: invalid CPU affinity specification
pt_br: Especificação de afinidade de CPU inválida

source: requested CPU set is too large for this system
pt_br: O conjunto de CPU solicitado é muito grande para este sistema

source: retrieving CPU affinity set failed
pt_br: Falha na recuperação do conjunto de afinidades de CPU
