Repository: daroczig/R-weblate-fork
Catalog: src/library/parallel/po/R-*.po
Languages: es, hu

source: invalid value of %s
es: valor no válido de %s
hu: A %s érvénytelen értéke

source: need at least one argument
es: necesita al menos un argumento
hu: Legalább egy argumentumra van szükség

source: zero-length inputs cannot be mixed with those of non-zero length
es: la entradas de longitud cero no se pueden mezclar con las de longitud distinta de cero
hu: A nulla hosszúságú bemenetek nem keverhetők össze a nullától eltérő hosszúságúakkal

source: dim(X) must have a positive length
es: dim(X) debe tener una longitud positiva
hu: a dim(X) pozitív hosszal kell, hogy rendelkezzen

source: 'X' must have named dimnames
es: 'X' debe tener 'dimnames' con nombre
hu: 'X' dimenziónévvel (dimnames) kell, hogy rendelkezzen

source: not all elements of 'MARGIN' are names of dimensions
es: no todos los elementos de 'MARGIN' son nombres de dimensiones

source: no cluster 'cl' supplied and none is registered
es: No se ha proporcionado ningún clúster 'cl' y ninguno está registrado
hu: Nincs megadva "CL" fürt, és nincs regisztrálva

source: not a valid cluster
es: no es un clúster válido
hu: nem érvényes fürt

source: unknown cluster type
es: tipo de clúster desconocido

source: numeric 'names' must be >= 1
es: valores numéricos en 'names' deben ser >= 1
hu: A numerikus "neveknek" >= 1-nek kell lenniük

source: node of a socket cluster on host %s with pid %d
es: nodo de un clúster de sockets en el host %s con pid %d
hu: Szoftvercsatornafürt csomópontja a %s gazdagépen PID %d

source: Connection setup failed or timed out.
es: Error en la configuración de la conexión o se agotó el tiempo de espera.
hu: A kapcsolat beállítása sikertelen vagy időtúllépést okozott.

source: PORT must be specified
es: se debe especificar PORT

source: 'nnodes' must be >= 1
es: 'nnodes' debe ser >= 1
hu: Az "nnodes" értékének >= 1-nek kell lennie

source: Cluster setup failed.
es: Error en la configuración del clúster.
hu: A fürt beállítása nem sikerült.

source: invalid 'child' argument
es: Argumento 'child' no válido
hu: Érvénytelen "gyermek" argumentum

source: 'children' must be a list of processes or a single process
es: 'children' debe ser una lista de procesos o un solo proceso
hu: A "gyermekek" a folyamatok listájának vagy egyetlen folyamatnak kell lenniük

source: 'process' must be of class %s
es: 'process' debe ser de clase %s

source: 'child' must be a valid child process
es: 'child' debe ser un proceso secundario válido
hu: A "gyermek" kifejezésnek érvényes gyermekfolyamatnak kell lennie

source: 'what' must be a character or raw vector
es: 'what' debe ser un carácter o un vector de tipo 'raw'
hu: A "mit" karakternek vagy nyers vektornak kell lennie

source: 'mc.cores' must be >= 1
es: 'mc.cores' debe ser >= 1
hu: Az "mc.cores" értékének >= 1-nek kell lennie

source: affinity.list and X must have the same length
es: affinity.list y X deben tener la misma longitud
hu: affinity.list és X azonos hosszúságúnak kell lennie

source: %d function calls resulted in an error
es: %d llamados a función han resultado en un error
hu: A(z) %d függvényhívások hibát eredményeztek

source: 'mc.preschedule' must be false if 'affinity.list' is used
es: 'mc.preschedule' debe ser FALSE si se usa 'affinity.list'
hu: Az "mc.preschedule" paraméternek hamisnak kell lennie, ha az "affinity.list" függvényt használja

source: all scheduled cores encountered errors in user code
es: todos los núcleos programados encontraron errores en el código de usuario
hu: Minden ütemezett mag hibát észlelt a felhasználói kódban

source: Zero-length inputs cannot be mixed with those of non-zero length
es: Las entradas de longitud cero no se pueden mezclar con las de longitud distinta de cero
hu: A nulla hosszúságú bemenetek nem keverhetők össze a nullától eltérő hosszúságúakkal

source: invalid 'jobs' argument
es: Argumento 'jobs' no válido
hu: Érvénytelen "állások" argumentum

source: 'v' must be a vector
es: 'v' debe ser un vector
hu: "v"-nek vektornak kell lennie

source: some results may be missing, folded or caused an error
es: es posible que falten algunos resultados, que estén duplicados, o que se hayan producido errores
hu: Előfordulhat, hogy egyes eredmények hiányoznak, összecsukódnak vagy hibát okoznak

source: fork clusters are not supported on Windows
es: Los clústeres de bifurcación (fork) no son soportados en Windows
hu: Az elágazási fürtöket a Windows nem támogatja

source: 'mc.cores' > 1 is not supported on Windows
es: 'mc.cores' > 1 no es soportado en Windows
hu: Az "mc.cores" > 1 nem támogatott Windows rendszeren

source: Cluster setup failed. %d worker of %d failed to connect.
es: Error en la configuración del clúster. %d de %d procesos de trabajo no pudo conectarse.

source: socket cluster with %d nodes on host %s
es: Clúster de sockets con %d nodos en el host %s

source: %d parallel function call did not deliver a result
es: La llamada en paralelo a la función %d no entregó un resultado

source: scheduled core %s did not deliver a result, all values of the job will be affected
es: El núcleo programado %s no entregó un resultado, todos los valores del trabajo se verán afectados

source: scheduled core %s encountered error in user code, all values of the job will be affected
es: El núcleo programado %s encontró un error en el código de usuario, todos los valores del trabajo se verán afectados

source: %d parallel job did not deliver a result
es: %d trabajo en paralelo no entregó resultado
