Repository: daroczig/R-weblate-fork
Catalog: src/library/stats/po/R-*.po
Languages: es

source: series is not periodic or has less than two periods
es: La serie no es periódica o tiene menos de dos periodos

source: unknown string value for s.window
es: valor de cadena desconocido para s.window

source: 'cutpoints' must be unique in 0 < cuts < 1, but are =
es: 'cutpoints' debe ser único en 0 < cortes < 1, pero son =

source: 'cutpoints' must be unique, but are =
es: 'cutpoints' debe ser único, pero son =

source: 'x' must be between -1 and 1
es: 'x' debe estar entre -1 y 1

source: 'x' must be between %s and %s
es: 'x' debe estar entre %s y %s

source: number of 'cutpoints' must be one less than number of symbols
es: El número de 'cutpoints' debe ser uno menos que el número de símbolos

source: number of 'cutpoints' must be one more than number of symbols
es: El número de 'cutpoints' debe ser uno más que el número de símbolos

source: must have 2 'symbols' for logical 'x' argument
es: debe tener 2 'symbols' para el argumento lógico 'x'

source: invalid 'abbr.colnames'
es: 'abbr.colnames' no válido

source: 'mu' must be a single number
es: 'mu' debe ser un solo número

source: 'y' is missing for paired test
es: falta 'y' para la prueba emparejada

source: data are essentially constant
es: los datos son esencialmente constantes

source: cannot use 'paired' in formula method
es: no se puede utilizar 'paired' en el método de fórmula

source: 'main' must be TRUE, FALSE, NULL or character (vector).
es: 'main' debe ser TRUE, FALSE, NULL o carácter (vector).

source: x is not a vector or univariate time series
es: x no es un vector o una serie de tiempo univariada

source: singularities in regression
es: singularidades en regresión

source: 'ts' object must have one or more observations
es: El objeto 'ts' debe tener una o más observaciones

source: 'start' cannot be after 'end'
es: 'start' no puede estar después de 'end'

source: 'end' must be a whole number of cycles after 'start'
es: 'end' debe ser un número entero de ciclos después de 'start'

source: no time series supplied
es: no se proporciona ninguna serie temporal

source: not all series have the same frequency
es: no todas las series tienen la misma frecuencia

source: not all series have the same phase
es: no todas las series tienen la misma fase

source: non-intersecting series
es: series que no se cruzan

source: non-time series not of the correct length
es: series no temporales que no tienen la longitud correcta

source: time series contains internal NAs
es: la serie temporal contiene NA internos

source: series is corrupt, with no 'tsp' attribute
es: la serie está corrupta y no tiene el atributo 'tsp'

source: series is corrupt: length %d with 'tsp' implying %d
es: la serie está corrupta: longitud %d cuando 'tsp' implica %d

source: cannot plot more than 10 series as "multiple"
es: no se pueden graficar más de 10 series como "multiple"

source: scatter plots only for univariate time series
es: gráficos de dispersión (scatter) solo para series temporales univariadas

source: 'xy.labels' must be logical or character
es: 'xy.labels' debe ser lógico o de carácter

source: 'frequency' and 'deltat' are both not NULL and are inconsistent
es: 'frequency' y 'deltat' son ambos NULL y son inconsistentes

source: 'frequency' not changed
es: 'frequency' no ha cambiado

source: bad value for 'start'
es: valor incorrecto para 'start'

source: 'start' value not changed
es: el valor 'start' no ha cambiado

source: bad value for 'end'
es: valor incorrecto para 'end'

source: 'end' value not changed
es: el valor 'end' no ha cambiado

source: extending time series when replacing values
es: extendiendo serie de tiempo al reemplazar valores

source: times to be replaced do not match
es: los tiempos de reemplazo no coinciden

source: no replacement values supplied
es: no se suministraron valores de reemplazo

source: too many replacement values supplied
es: demasiados valores de reemplazo suministrados

source: number of values supplied is not a sub-multiple of the number of values to be replaced
es: el número de valores proporcionados no es un submúltiplo del número de valores que se reemplazarán

source: only replacement of elements is allowed
es: solo el remplazo de elementos está permitido

source: 'model' must be list
es: 'model' debe ser una lista

source: 'n' must be strictly positive
es: 'n' debe ser estrictamente positivo

source: 'ar' part of model is not stationary
es: la parte 'ar' del modelo no es estacionaria

source: burn-in 'n.start' must be as long as 'ar + ma'
es: datos de arranque (burn-in) 'n.start' debe ser tan largo como 'ar + ma'

source: 'model$order' must be of length 3
es: 'model$order' debe tener una longitud de 3

source: inconsistent specification of 'ar' order
es: especificación inconsistente del orden 'ar'

source: inconsistent specification of 'ma' order
es: especificación inconsistente del orden 'ma'

source: number of differences must be a positive integer
es: el número de diferencias debe ser un número entero positivo

source: need an object with call component
es: necesita un objeto con componente de llamada

source: 'ratio' must be a single positive number
es: 'ratio' debe ser un único número positivo

source: 'x' and 'w' must have the same length
es: 'x' y 'w' deben tener la misma longitud

source: not enough (non-missing) 'x' observations
es: no hay suficientes observaciones (no faltantes) en 'x'

source: requested conf.level not achievable
es: nivel de confianza conf.level solicitado no alcanzable

source: cannot compute confidence interval when all observations are zero or tied
es: No se puede calcular el intervalo de confianza cuando todas las observaciones son cero o están empatadas

source: cannot compute exact confidence interval with ties
es: no se puede calcular el intervalo de confianza exacto con observaciones empatadas

source: cannot compute exact p-value with zeroes
es: no se puede calcular el valor p exacto con ceros

source: cannot compute exact confidence interval with zeroes
es: no se puede calcular el intervalo de confianza exacto con ceros

source: Requested conf.level not achievable
es: Nivel de confianza conf.level solicitado no alcanzable

source: cannot compute confidence interval when all observations are tied
es: no se puede calcular el intervalo de confianza cuando todas las observaciones están empatadas

source: must supply either 'formula' or 'data'
es: debe proporcionar o bien 'formula' o bien 'data'

source: %s applies only to two-way tables
es: %s se aplica sólo a tablas de dos entradas

source: too few distinct input values to fit an asymptotic regression model
es: muy pocos valores de entrada distintos para ajustarse a un modelo de regresión asintótica

source: cannot fit an asymptotic regression model to these data
es: no se puede ajustar un modelo de regresión asintótica a estos datos

source: too few observations to fit an asymptotic regression model
es: muy pocas observaciones para ajustarse a un modelo de regresión asintótica

source: too few distinct input values to fit the 'asympOff' model
es: muy pocos valores de entrada distintos para ajustarse al modelo 'asympOff'

source: too few distinct input values to fit the 'asympOrig' model
es: muy pocos valores de entrada distintos para ajustarse al modelo 'asympOrig'

source: too few distinct input values to fit a biexponential
es: muy pocos valores de entrada distintos para ajustarse a un biexponencial

source: must have length of response = length of second argument to 'SSfol'
es: debe tener la longitud de la respuesta = longitud del segundo argumento de 'SSfol'

source: must have at least 4 observations to fit an 'SSfol' model
es: debe tener al menos 4 observaciones para ajustar un modelo 'SSfol'

source: too few distinct input values to fit a four-parameter logistic
es: muy pocos valores de entrada distintos para ajustar una logística de cuatro parámetros

source: too few distinct input values to fit a logistic model
es: muy pocos valores de entrada distintos para ajustar un modelo logístico

source: too few distinct input values to fit a Michaelis-Menten model
es: muy pocos valores de entrada distintos para ajustar un modelo de Michaelis-Menten

source: too few distinct input values to fit the Gompertz model
es: muy pocos valores de entrada distintos para ajustar un modelo de Gompertz

source: too few distinct input values to fit the Weibull growth model
es: muy pocos valores de entrada distintos para ajustar un modelo de crecimiento de Weibull

source: all 'x' values must be non-negative to fit the Weibull growth model
es: todos los valores 'x' deben ser no negativos para ajustar un modelo d ecrecimiento de Weibull

source: using the %d/%d row from a combined fit
es: usando %d/%d fila de un ajuste combinado

source: lower scope has term %s not included in model
es: el alcance inferior tiene el término %s no incluido en el modelo

source: upper scope has term %s not included in model
es: el alcance superior tiene el término %s no incluido en el modelo

source: there are %d Error terms: only 1 is allowed
es: hay %d término de error: solo se permite 1

source: extra argument %s is not of class "%s"
es: el argumento adicional %s no es de la clase "%s"

source: %d factor is too many for %d variables
es: %d factor es demasiado para %d variables

source: unable to optimize from this starting value
es: no se puede optimizar a partir de este valor inicial

source: X matrix has rank %d, but only %d observation
es: la matriz X tiene rango %d, pero solo %d observación

source: did not converge in %d iteration
es: no convergió en %d iteración

source: %d missing value deleted
es: %d valor faltante eliminado

source: only %d case
es: solo %d caso

source: but %d variable
es: pero %d variable

source: medpolish() did not converge in %d iteration
es: medpolish() no convergió en %d iteración

source: but variable found had %d row
es: pero las variables encontradas tienen %d fila

source: factor %s has new level %s
es: el factor %s tiene un nuevo nivel %s

source: %d observation deleted due to missingness
es: %d observación eliminada debido a que era faltante

source: _NOT_ converged in %d iteration
es: NO convergió en %d iteración

source: unrecognized control element named %s ignored
es: elemento de control no reconocido con nombre %s ignorado

source: fitting parameter %s without any variables
es: se ajusta el parámetro %s sin ninguna variable

source: parameter %s does not occur in the model formula
es: el parámetro %s no aparece en la fórmula del modelo

source: %d observation with NA, NaN or Inf deleted
es: %d observación con NA, NaN y/o Inf eliminada
