Repository: daroczig/R-weblate-fork
Catalog: src/library/stats/po/R-*.po
Languages: es

source: models are not all fitted to the same number of observations
es: no todos los modelos se han ajustado usando el mismo número de observaciones

source: empty model supplied
es: Se ha suministrado un Modelo vacío

source: 'acf' must be of length two or more
es: «ACF» debe tener longitud de dos o más

source: object not interpretable as a factor
es: El objeto no es interpretable como factor

source: cannot fit models without level ('alpha' must not be 0 or FALSE)
es: No se puede ajustar modelos sin un nivel ('alpha' no debe ser 0 o FALSO)

source: 'alpha', 'beta' and 'gamma' must be within the unit interval
es: 'alpha', 'beta' y 'gamma' deben estar dentro del intervalo unitario

source: data must be non-zero for multiplicative Holt-Winters
es: Los datos deben ser distintos de cero para Holt-Winters Multiplicativo

source: need at least 2 periods to compute seasonal start values
es: Necesita al menos 2 períodos para calcular los valores iniciales de estacionalidad

source: invalid length(x)
es: Longitud no válida para x: length(x)

source: optimization difficulties: %s
es: dificultades de optimización: %s

source: optimization failure
es: fallo de optimización

source: time series has no or less than 2 periods
es: la serie temporal no tiene periodos o tiene menos de 2 periodos

source: the series is entirely NA
es: la serie está compuesta totalmente por NA

source: frequency must be a positive integer >= 2 for BSM
es: la frecuencia debe ser un entero positivo >= 2 para BSM

source: only implemented for univariate time series
es: solo implementado para series temporales univariadas

source: 'x' must be numeric
es: 'x' debe ser numérico

source: the first value of the time series must not be missing
es: el primer valor de la serie temporal no puede estar ausente

source: all parameters were fixed
es: todos los parámetros se fijaron

source: possible convergence problem: 'optim' gave code = %d and message %s
es: posible problema de convergencia: 'optim' ha dado código = %d y mensaje %s

source: no factors in the fitted model
es: no hay factores en el modelo ajustado

source: 'which' specified no factors
es: 'which' no especificaba ningún factor

source: 'which' specified some non-factors which will be dropped
es: 'which' especificó algunos no-factores que se eliminarán

source: 'sampleT' and 'nser' must be integer
es: Las variables 'sampleT y 'nser' deben ser enteros

source: 'lag.max' must be at least 0
es: 'lag.max' debe ser al menos 0

source: 'lag.max' must be at least 1
es: 'lag.max' debe ser al menos 1

source: NAs in 'x'
es: NAs en 'x'

source: x$lag must have at least 1 column
es: x$lag debe tener al menos 1 columna

source: can use ci.type="ma" only if first lag is 0
es: solo puede usar ci.type="ma" si el primer rezago es 0

source: Page [%d,%d]: i =%s; j =%s
es: Página [%d,%d]: i=%s; j=%s

source: univariate time series only
es: solo series temporales univariantes

source: no terms in scope
es: Sin términos en el ámbito de trabajo

source: no terms in scope for adding to object
es: sin términos en 'scope' para agregar al objeto

source: number of rows in use has changed: remove missing values?
es: el número de filas en uso ha cambiado: ¿Eliminar los valores que faltan?

source: attempting model selection on an essentially perfect fit is nonsense
es: no tiene sentido intentar seleccionar un modelo en un ajuste esencialmente perfecto

source: F test assumes quasi%s family
es: la prueba F asume que la familia es quasi%s

source: no 'add1' method implemented for "mlm" models
es: no se implementó el método 'add1' para los modelos "mlm”

source: scope is not a subset of term labels
es: 'scope' no es un subconjunto de etiquetas de 'terms' (en object)

source: no 'drop1' method for "mlm" models
es: no hay método 'drop1' para los modelos "mlm"

source: F test assumes 'quasi%s' family
es: la prueba F asume que la familia es ‘quasi%s’

source: AIC is not defined for this model, so 'step' cannot proceed
es: La AIC no está definida para este modelo, entonces 'step' no puede proceder

source: AIC is -infinity for this model, so 'step' cannot proceed
es: el AIC es -infinito para este modelo, por lo que 'step' no puede proceder

source: 'A' must be an array or table
es: 'A' debe ser un array o tabla

source: length of FUN, %d, does not match the length of the margins, %d
es: longitud de FUN, %d, no coincide con la longitud de los márgenes, %d

source: no rows to aggregate
es: no hay filas para combinar

source: 'by' must be a list
es: 'by' debe ser una lista

source: arguments must have same length
es: los argumentos deben tener la misma longitud

source: argument 'x' is missing -- it has been renamed from 'formula'
es: el argumento 'x' está ausente -- fue renombrado (antes era 'formula')

source: argument 'x' must be a formula
es: argumento 'x' debe ser una fórmula

source: formula 'x' must have both left and right hand sides
es: la fórmula 'x' debe tener tanto lado izquierdo como derecho

source: cannot change frequency from %g to %g
es: no se puede cambiar la frecuencia de %g a %g

source: 'x' must be coefficient matrix/data frame
es: 'x' debe ser una matriz o data frame de coeficientes

source: option "show.coef.Pvalues" is invalid: assuming TRUE
es: la opción "show.coef.Pvalues" no es válida: se asume TRUE

source: 'P.values' is TRUE, but 'has.Pvalue' is not
es: 'P.values' es TRUE, pero 'has.Pvalue' no lo es

source: wrong k / cs.ind
es: k / cs.ind no válido

source: option "show.signif.stars" is invalid: assuming TRUE
es: opción "show.signif.stars" no válida: se asume TRUE

source: 'anova' object must have colnames
es: objeto 'anova' debe tener colnames()

source: 'conf.level' must be a single number between 0 and 1
es: 'conf.level' debe ser un solo número entre 0 y 1

source: not enough 'x' observations
es: sin observaciones suficientes en 'x'

source: not enough 'y' observations
es: sin observaciones suficientes en 'y'

source: samples differ in location: cannot compute confidence set, returning NA
es: las muestras difieren en la ubicación: no se puede calcular el conjunto de confianza, devolviendo NA

source: cannot compute confidence set, returning NA
es: no se puede calcular el conjunto de confianza, devolviendo NA

source: cannot compute asymptotic confidence set or estimator
es: no se puede calcular el conjunto de confianza asintótico o el estimador

source: cannot compute estimate, returning NA
es: no se puede calcular la estimación, devolviendo NA

source: cannot compute exact p-value with ties
es: no se puede calcular el valor p exacto con empates

source: cannot compute exact confidence intervals with ties
es: no se pueden calcular intervalos de confianza exactos con empates

source: 'formula' missing or incorrect
es: 'formula' faltante o incorrecta

source: grouping factor must have exactly 2 levels
es: el factor de agrupación debe tener exactamente 2 niveles

source: weights are not supported in a multistratum aov() fit
es: los pesos no se admiten en un ajuste multiestrato aov()

source: Error() model is singular
es: Error () el modelo es singular

source: the 'split' argument must be a list
es: el argumento 'split' debe ser una lista

source: 'coef' must define a contrast, i.e., sum to 0
es: 'coef' debe definir un contraste, es decir, sumar 0

source: 'coef' must have same length as 'contrast.obj'
es: 'coef' debe tener la misma longitud que 'contrast.obj'

source: each element of '%s' must be logical
es: cada elemento de '%s' debe ser lógico

source: the contrast defined is empty (has no TRUE elements)
es: el contraste definido está vacío (no tiene elementos verdaderos)

source: columns of 'contrast.obj' must define a contrast (sum to zero)
es: las columnas de 'contrast.obj' deben definir un contraste (suma cero)

source: no degrees of freedom for residuals
es: sin grados de libertad para los residuos

source: 'object' does not include an error 'qr' component
es: 'object' no incluye un componente de error 'qr'

source: Refitting model to allow projection
es: Reacondicionando del modelo para permitir la proyección

source: columns of 'contrast.obj' must define a contrast(sum to zero)
es: las columnas de 'contrast.obj' deben definir un contraste (suma cero)

source: 'ties' is not "ordered", a function, or list(<string>, <function>)
es: 'ties' no es "ordered", una función o list(<string>, <function>)

source: collapsing to unique 'x' values
es: colapsando a valores únicos 'x'

source: invalid interpolation method
es: método de interpolación no válido

source: need at least two non-NA values to interpolate
es: necesita al menos dos valores que no sean NA para interpolar

source: zero non-NA points
es: cero puntos no NA

source: 'approx' requires n >= 1
es: 'approx' requiere n >= 1

source: NAs in 'x' must be the same row-wise
es: los NA en 'x' deben ser los mismos por fila

source: 'order.max' must be >= 1
es: 'order.max' debe ser >= 1

source: 'order.max' must be < 'n.obs'
es: 'order.max' debe ser < 'n.obs'

source: zero-variance series
es: serie de varianza cero

source: 'n.ahead' must be at least 1
es: 'n.ahead' debe ser al menos 1

source: number of series in 'object' and 'newdata' do not match
es: el número de series en 'object' y 'newdata' no coinciden

source: 'se.fit' not yet implemented for multivariate models
es: 'se.fit' aún no implementado para modelos multivariados

source: MLE only implemented for univariate series
es: MLE solo implementado para series univariadas

source: 'order.max' must be >= 0
es: 'order.max' debe ser >= 0

source: 'order.max' must be < 'n.used'
es: 'order.max' debe ser < 'n.used'

source: 'order' must be a non-negative numeric vector of length 3
es: 'order' debe ser un vector numérico no negativo de longitud 3

source: 'seasonal' must be a list with component 'order'
es: 'seasonal' debe ser una lista con el componente 'order'

source: 'seasonal$order' must be a non-negative numeric vector of length 3
es: 'seasonal$order' debe ser un vector numérico no negativo de longitud 3

source: lengths of 'x' and 'xreg' do not match
es: las longitudes de 'x' y 'xreg' no coinciden

source: wrong length for 'fixed'
es: longitud incorrecta para 'fixed'

source: some AR parameters were fixed: setting transform.pars = FALSE
es: Se corrigieron algunos parámetros de AR: configuración de transform.pars = FALSE

source: too few non-missing observations
es: muy pocas observaciones no faltantes

source: 'init' is of the wrong length
es: 'init' tiene una longitud incorrecta

source: non-stationary AR part
es: parte AR no estacionaria

source: non-stationary seasonal AR part
es: parte AR estacional no estacionaria

source: possible convergence problem: optim gave code = %d
es: posible problema de convergencia: optim dio código = %d

source: non-stationary AR part from CSS
es: parte AR no estacionaria de CSS

source: non-stationary seasonal AR part from CSS
es: parte AR estacional no estacionaria de CSS

source: 'xreg' and 'newxreg' have different numbers of columns
es: 'xreg' y 'newxreg' tienen diferentes números de columnas

source: MA part of model is not invertible
es: la parte MA del modelo no es invertible

source: seasonal MA part of model is not invertible
es: la parte MA estacional del modelo no es invertible

source: NAs in '%s'
es: NA en '%s'

source: invalid 'SSinit'
es: 'SSinit' no válido

source: converting non-invertible initial MA values
es: convertir valores MA iniciales no reversibles

source: some ARMA parameters were fixed: setting transform.pars = FALSE
es: se corrigieron algunos parámetros ARMA: configuración de transform.pars = FALSE

source: 'xreg' is collinear
es: 'xreg' es colineal

source: NAs present: setting 'delta' to -1
es: NA presentes: establecer 'delta' en -1

source: transformed ARMA parameters were fixed
es: parámetros ARMA transformados fueron fijados

source: need at least 2 data points
es: se necesitan al menos 2 puntos de datos

source: invalid 'x'
es: 'x' no válido

source: invalid 'nb'
es: 'nb' no válido

source: no solution in the specified range of bandwidths
es: no hay solución en el rango especificado de anchos de banda

source: increasing bw.SJ() search interval (%d) to [%.4g,%.4g]
es: aumentando el intervalo de búsqueda de bw.SJ() (%d) a [%.4g,%.4g]

source: minimum occurred at one end of the range
es: el mínimo ocurrió en un extremo del rango

source: 'x' must be a list with at least 2 elements
es: 'x' debe ser una lista con al menos 2 elementos

source: 'x' and 'g' must have the same length
es: 'x' y 'g' deben tener la misma longitud

source: all observations are in the same group
es: todas las observaciones están en el mismo grupo

source: there must be at least 2 observations in each group
es: debe haber al menos 2 observaciones en cada grupo

source: 'formula' should be of the form response ~ group
es: 'formula' debe tener el formato respuesta ~ grupo

source: 'x' must be nonnegative and integer
es: 'x' debe ser no negativo y entero

source: 'n' must be a positive integer >= 'x'
es: 'n' debe ser un número entero positivo >= 'x'

source: incorrect length of 'x'
es: longitud incorrecta de 'x'

source: 'p' must be a single number between 0 and 1
es: 'p' debe ser un único número entre 0 y 1

source: length of choices must be 2
es: la longitud de las opciones debe ser 2

source: object '%s' has no scores
es: el objeto '%s' no tiene puntuaciones (scores)

source: 'scale' is outside [0, 1]
es: 'scale' está fuera de [0, 1]

source: biplots are not defined for complex PCA
es: biplots no está definidos para PCA complejo

source: unequal number of rows in 'cancor'
es: número desigual de filas en 'cancor'

source: dimension 0 in 'x' or 'y'
es: dimensión 0 en 'x' o 'y'

source: 'x' has rank 0
es: 'x' tiene rango 0

source: 'y' has rank 0
es: 'y' tiene rango 0

source: 'x' and 'y' must have the same length
es: 'x' y 'y' deben tener la misma longitud

source: 'x' and 'y' must have at least 2 levels
es: 'x' y 'y' deben tener al menos 2 niveles

source: all entries of 'x' must be nonnegative and finite
es: todas las entradas de 'x' deben ser no negativas y finitas

source: at least one entry of 'x' must be positive
es: al menos una entrada de 'x' debe ser positiva

source: cannot compute simulated p-value with zero marginals
es: no se puede calcular el valor p simulado con marginales cero

source: 'x' must at least have 2 elements
es: 'x' debe tener al menos 2 elementos

source: 'x' and 'p' must have the same number of elements
es: 'x' y 'p' deben tener el mismo número de elementos

source: probabilities must be non-negative.
es: las probabilidades deben ser no negativas.

source: probabilities must sum to 1.
es: las probabilidades deben sumar 1.

source: Chi-squared approximation may be incorrect
es: La aproximación de chi-cuadrado puede ser incorrecta

source: NA values not allowed in 'd'
es: Valores NA no permitidos en 'd'

source: eig=TRUE is disregarded when list.=FALSE
es: eig=TRUE no se tiene en cuenta cuando list.=FALSE

source: x.ret=TRUE is disregarded when list.=FALSE
es: x.ret=TRUE no se tiene en cuenta cuando list.=FALSE

source: distances must be result of 'dist' or a square matrix
es: las distancias deben ser el resultado de 'dist' o una matriz cuadrada

source: invalid value of %s
es: valor no válido de %s

source: 'k' must be in {1, 2, .. n - 1}
es: 'k' debe estar en {1, 2, .. n - 1}

source: only %d of the first %d eigenvalues are > 0
es: solo %d de los primeros %d valores propios son > 0

source: Waiting for profiling to be done...
es: Esperando a que se haga el perfil...

source: Reprofiling for
es: Reperfilando para el estadístico

source: statistic. Waiting...
es: . Esperando…

source: initial value is not in the interior of the feasible region
es: el valor inicial no está en el interior de la región factible

source: Barrier algorithm ran out of iterations and did not converge
es: el algoritmo de barrera se quedó sin iteraciones y no convergió

source: Objective function increased at outer iteration %d
es: La función objetivo aumentó en la iteración externa %d

source: Objective function decreased at outer iteration %d
es: La función objetivo disminuyó en la iteración externa %d

source: contrasts not defined for %d degrees of freedom
es: contrastes no definidos para %d grados de libertad

source: orthogonal polynomials cannot be represented accurately enough for %d degrees of freedom
es: Los polinomios ortogonales no se pueden representar con suficiente precisión para %d grados de libertad

source: 'scores' argument is of the wrong length
es: El argumento 'scores' tiene una longitud incorrecta

source: 'scores' must all be different numbers
es: 'scores' deben ser números diferentes entre sí

source: 'degree' must be at least 1
es: 'degree' debe ser al menos 1

source: missing values are not allowed in 'poly'
es: los valores faltantes no están permitidos en 'poly'

source: 'degree' must be less than number of unique points
es: 'degree' debe ser menor que el número de puntos únicos

source: must supply one or more vectors
es: debe proporcionar uno o más vectores

source: arguments must have the same length
es: los argumentos deben tener la misma longitud

source: wrong number of columns in new data:
es: número incorrecto de columnas en datos nuevos:

source: contrasts apply only to factors
es: los contrastes se aplican solo a factores

source: contrasts can be applied only to factors with 2 or more levels
es: los contrastes se pueden aplicar solo a factores con 2 o más niveles

source: wrong number of contrast matrix rows
es: número incorrecto de filas de la matriz de contraste

source: singular contrast matrix
es: matriz de contraste singular

source: numeric contrasts or contrast name expected
es: contrastes numéricos o nombre de contraste esperado

source: %s needs package 'Matrix' correctly installed
es: %s necesita el paquete 'Matrix' correctamente instalado

source: not enough degrees of freedom to define contrasts
es: mo hay suficientes grados de libertad para definir contrastes

source: baseline group number out of range
es: número de grupo de referencia fuera de rango

source: invalid 'use' argument
es: argumento 'use' no válido

source: supply both 'x' and 'y' or a matrix-like 'x'
es: proporcione tanto 'x' como 'y' o una matriz 'x'

source: 'y' must be numeric
es: 'y' debe ser numérico

source: 'x' is empty
es: 'x' está vacío

source: both 'x' and 'y' must be non-empty
es: tanto 'x' como 'y' no deben estar vacíos

source: cannot handle 'pairwise.complete.obs'
es: no se puede manejar 'pairwise.complete.obs'

source: 'V' is not a square numeric matrix
es: 'V' no es una matriz numérica cuadrada

source: diag(V) had non-positive or NA entries; the non-finite result may be dubious
es: diag(V) tenía entradas no positivas o NA; el resultado no finito puede ser dudoso

source: 'x' must be a numeric vector
es: 'x' debe ser un vector numérico

source: 'y' must be a numeric vector
es: 'y' debe ser un vector numérico

source: not enough finite observations
es: no hay suficientes observaciones finitas

source: Cannot compute exact p-value with ties
es: No se puede calcular el valor p exacto con empates

source: 'formula' missing or invalid
es: falta 'fórmula' o no es válida

source: invalid formula
es: fórmula no válida

source: 'x' must be a matrix or a data frame
es: 'x' debe ser una matriz o un marco de datos

source: 'x' must contain finite values only
es: 'x' debe contener solo valores finitos

source: length of 'wt' must equal the number of rows in 'x'
es: la longitud de 'wt' debe ser igual al número de filas en 'x'

source: weights must be non-negative and not all zero
es: los pesos deben ser no negativos y no todos cero

source: length of 'center' must equal the number of columns in 'x'
es: la longitud de 'center' debe ser igual al número de columnas en 'x'

source: invalid 'tree' ('merge' component)
es: 'tree' no válido (componente 'merge')

source: either 'k' or 'h' must be specified
es: se debe especificar 'k' o 'h'

source: the 'height' component of 'tree' is not sorted (increasingly)
es: el componente 'height' de 'tree' no está ordenado (en forma ascendente)

source: elements of 'k' must be between 1 and %d
es: los elementos de 'k' deben estar entre 1 y %d

source: dendrogram entries must be 1,2,..,%d (in any order), to be coercible to "hclust"
es: las entradas del dendrograma deben ser 1,2,..,%d (en cualquier orden), para que sean coercibles a "hclust"

source: dendrogram node with non-positive #{branches}
es: nodo de dendrograma con #{branches} no positivo

source: midcache() of non-binary dendrograms only partly implemented
es: midcache() de dendrogramas no binarios implementado solo parcialmente

source: non-leaf subtree of length 0
es: subárbol sin hoja de longitud 0

source: 'order.dendrogram' requires a dendrogram
es: 'order.dendrogram' requiere un dendrograma

source: 'reorder.dendrogram' requires a dendrogram
es: 'reorder.dendrogram' requiere un dendrograma

source: invalid (length 0) node in dendrogram
es: nodo no válido (longitud 0) en dendrograma

source: dendrogram non-leaf node with non-positive #{branches}
es: nodo no hoja de dendrograma con #{branches} no positivo

source: 'height' must be at least %g, the maximal height of its components
es: 'height' debe ser al menos %g, la altura máxima de sus componentes

source: 'X' is not a dendrogram
es: 'X' no es un dendrograma

source: 'x' must be a numeric matrix
es: 'x' debe ser una matriz numérica

source: 'x' must have at least 2 rows and 2 columns
es: 'x' debe tener al menos 2 filas y 2 columnas

source: 'margins' must be a numeric vector of length 2
es: 'margins' debe ser un vector numérico de longitud 2

source: row dendrogram ordering gave index of wrong length
es: el orden del dendrograma de filas dio un índice de longitud incorrecta

source: Colv = "Rowv" but nrow(x) != ncol(x)
es: Colv = "Filav" pero nrow(x) != ncol(x)

source: column dendrogram ordering gave index of wrong length
es: el orden del dendrograma de columnas dio un índice de longitud incorrecta

source: 'ColSideColors' must be a character vector of length ncol(x)
es: 'ColSideColors' debe ser un vector de caracteres de longitud ncol(x)

source: 'RowSideColors' must be a character vector of length nrow(x)
es: 'RowSideColors' debe ser un vector de caracteres de longitud nrow(x)

source: argument 'x' must be numeric
es: el argumento 'x' debe ser numérico

source: 'x' and 'weights' have unequal length
es: 'x' y 'weights' tienen longitudes diferentes

source: 'x' contains missing values
es: 'x' contiene valores faltantes

source: 'weights' must all be finite
es: 'weights' deben ser todos valores finitos

source: 'weights' must not be negative
es: 'weights' no debe ser negativo

source: sum(weights) != 1 -- will not get true density
es: sum(weights) != 1 -- no se obtendrá la densidad verdadera

source: need at least 2 points to select a bandwidth automatically
es: se necesitan al menos 2 puntos para seleccionar un ancho de banda automáticamente

source: Selecting bandwidth *not* using 'weights'
es: Seleccionar ancho de banda *no* usando 'weights'

source: unknown bandwidth rule
es: regla de ancho de banda desconocida

source: non-finite 'bw'
es: 'bw' no finito

source: 'bw' is not positive.
es: 'bw' no es positivo.

source: non-finite 'from'
es: 'from' no finito

source: non-finite 'to'
es: 'to' no finito

source: invalid formula in deriv
es: fórmula no válida en 'deriv'

source: 'x' is not a vector
es: 'x' no es un vector

source: bad value for 'lag' or 'differences'
es: valor incorrecto para 'lag' o 'differences'

source: 'xi' does not have the right length
es: 'xi' no tiene la longitud correcta

source: incorrect dimensions for 'xi'
es: dimensiones incorrectas para 'xi'

source: 'x' is not a vector or matrix
es: 'x' no es un vector o una matriz
