Repository: daroczig/R-weblate-fork
Catalog: src/library/stats/po/R-*.po
Languages: es

source: x[1] != r[1]; using x[1] for diagonal
es: x[1] != r[1]; usando x[1] para diagonal

source: invalid distance method
es: método de distancia no válido

source: ambiguous distance method
es: método de distancia ambigua

source: non-square matrix
es: matriz no cuadrada

source: specify 'rate' or 'scale' but not both
es: especifique 'rate' o 'scale' pero no ambos

source: x[] and prob[] must be equal length vectors.
es: x[] y prob[] deben ser vectores de igual longitud.

source: probabilities must be finite, non-negative and not all 0
es: las probabilidades deben ser finitas, no negativas y no todas 0

source: 'x' must be non-negative
es: 'x' debe ser no negativo

source: size != sum(x), i.e. one is wrong
es: size! = sum(x), es decir, uno está equivocado

source: 'prob' and 'mu' both specified
es: 'prob' y 'mu' ambos especificados

source: some terms will have NAs due to the limits of the method
es: algunos términos tendrán NA debido a los límites del método

source: multivariate case with missing coefficients is not yet implemented
es: el caso multivariado con coeficientes faltantes aún no está implementado

source: 'x' must have 1 or more non-missing values
es: 'x' debe tener 1 o más valores no faltantes

source: wrong embedding dimension
es: dimensión de encaje incorrecta

source: 'covmat' is not a valid covariance list
es: 'covmat' no es una lista de covarianza válida

source: neither 'x' nor 'covmat' supplied
es: ni 'x' ni 'covmat' suministrados

source: response not allowed in formula
es: respuesta no permitida en la fórmula

source: factor analysis applies only to numerical variables
es: el análisis factorial se aplica solo a variables numéricas

source: 'covmat' is of unknown type
es: 'covmat' es de tipo desconocido

source: requested scores without an 'x' matrix
es: puntuaciones solicitadas sin una matriz 'x'

source: factor analysis requires at least three variables
es: el análisis factorial requiere al menos tres variables

source: no starting values supplied
es: no se proporcionan valores iniciales

source: invalid argument 'lambda'
es: argumento no válido 'lambda'

source: %s link not recognised
es: enlace no reconocido %s

source: link "%s" not available for %s family; available links are %s
es: enlace "%s" no disponible para la familia %s; los enlaces disponibles son %s

source: negative values not allowed for the 'Poisson' family
es: valores negativos no permitidos para la familia 'Poisson'

source: ignoring prior weights
es: ignorando pesos a priori prior.weights

source: negative values not allowed for the 'quasiPoisson' family
es: valores negativos no permitidos para la familia 'quasiPoisson'

source: cannot find valid starting values: please specify some
es: no se pueden encontrar valores iniciales válidos: especifique algunos

source: y values must be 0 <= y <= 1
es: los valores de y deben ser 0 <= y <= 1

source: non-integer #successes in a %s glm!
es: ¡#successes no enteros en glm %s!

source: non-integer counts in a %s glm!
es: ¡recuentos no enteros en glm %s!

source: for the '%s' family, y must be a vector of 0 and 1's or a 2 column matrix where col 1 is no. successes and col 2 is no. failures
es: para la familia '%s', "y" debe ser un vector de 0 y 1 o una matriz de 2 columnas donde la col 1 es no. éxitos y la columna 2 es el número de fracasos

source: cannot simulate from non-integer prior.weights
es: no se puede simular a partir de prior.weights no enteros

source: non-positive values not allowed for the 'Gamma' family
es: valores no positivos no permitidos para la familia 'Gamma'

source: using weights as shape parameters
es: usando pesos (weights) como parámetros de forma

source: positive values only are allowed for the 'inverse.gaussian' family
es: solo se permiten valores positivos para la familia 'inverse.gaussian'

source: need CRAN package 'SuppDists' for simulation from the 'inverse.gaussian' family
es: necesita el paquete CRAN 'SuppDists' para la simulación de la familia 'inverse.gaussian'

source: using weights as inverse variances
es: usando pesos (weigths) como varianzas inversas

source: 'variance' "%s" is invalid: possible values are "mu(1-mu)", "mu", "mu^2", "mu^3" and "constant"
es: 'variance' "%s" no es válido: los valores posibles son "mu(1-mu)", "mu", "mu^2", "mu^3" y " constant"

source: length mismatch in convolution
es: discrepancia de longitud en convolución

source: missing values in 'filter'
es: valores faltantes en 'filter'

source: 'filter' is longer than time series
es: 'filter' es más largo que la serie temporal

source: argument 'sides' must be 1 or 2
es: el argumento 'sides' debe ser 1 o 2

source: 'circular' must be logical and not NA
es: 'circular' debe ser lógico y no NA

source: length of 'init' must equal length of 'filter'
es: la longitud de 'init' debe ser igual a la longitud de 'filter'

source: 'x' must have at least 2 rows and columns
es: 'x' debe tener al menos 2 filas y columnas

source: 'x' has entries too large to be integer
es: 'x' tiene entradas demasiado grandes para ser un número entero

source: 'x' has been rounded to integer: %s
es: 'x' se ha redondeado a un número entero: %s

source: if 'x' is not a matrix, 'y' must be given
es: si 'x' no es una matriz, se debe dar 'y'

source: 'mult' must be integer >= 2, typically = 30
es: 'mult' debe ser un número entero >= 2, normalmente = 30

source: alternative must be "two.sided", "less" or "greater"
es: la alternativa debe ser "dos.lados", "menos" o "mayor"

source: 'or' must be a single number between 0 and Inf
es: 'o' debe ser un único número entre 0 e Inf

source: need 2 or more non-zero row marginals
es: se necesitan 2 o más filas marginales distintas de cero

source: need 2 or more non-zero column marginals
es: se necesitan 2 o más columnas marginales distintas de cero

source: names(hybridPars) should be NULL or be identical to the default's
es: names(hybridPars) deben ser NULL o ser idénticos a los valores por defecto

source: 'hybrid' is ignored for a 2 x 2 table
es: 'hybrid' se ignora para una tabla de 2 x 2

source: all groups must contain data
es: todos los grupos deben contener datos

source: not enough observations
es: no hay suficientes observaciones

source: NA's are not allowed in 'groups' or 'blocks'
es: NA's no permitidos en 'groups' o 'blocks'

source: 'y', 'groups' and 'blocks' must have the same length
es: 'y', 'groups' y 'blocks' deben tener la misma longitud

source: not an unreplicated complete block design
es: no es un diseño de bloque completo no replicado

source: formula missing
es: falta la fórmula

source: incorrect specification for 'formula'
es: especificación incorrecta para 'formula'

source: nothing to tabulate
es: nada que tabular

source: incorrect specification for 'row.vars'
es: especificación incorrecta para 'row.vars'

source: incorrect specification for 'col.vars'
es: especificación incorrecta para 'col.vars'

source: 'formula' must have both left and right hand sides
es: 'formula' debe tener ambos lados, izquierdo y derecho

source: interactions are not allowed
es: no se permiten interacciones

source: 'formula' has '.' in both left and right hand sides
es: 'formula' tiene '.' tanto en el lado izquierdo como en el derecho

source: incorrect variable names in rhs of formula
es: nombres de variables incorrectos en rhs (lado derecho) de la fórmula

source: incorrect variable names in lhs of formula
es: nombres de variables incorrectos en el lado izquierdo de la fórmula

source: cannot use dots in formula with given data
es: no se pueden usar puntos en una fórmula con datos dados

source: 'x' must be an "ftable" object
es: 'x' debe ser un objeto "ftable"

source: wrong method
es: método equivocado

source: 'file' must be a character string or connection
es: 'file' debe ser una cadena de caracteres o una conexión

source: 'row.var.names' missing
es: falta 'row.var.names'

source: 'col.vars' missing or incorrect
es: 'col.vars' falta o es incorrecto

source: Parameter:
es: Parámetro:

source: down
es: abajo

source: up
es: arriba

source: profiling has found a better solution, so original fit had not converged
es: el perfilamiento encontró una mejor solución, por lo que el ajuste original no había convergido

source: 'family' not recognized
es: 'family' no reconocida

source: invalid 'method' argument
es: argumento 'method' no válido

source: 'weights' must be a numeric vector
es: 'weights' debe ser un vector numérico

source: negative weights not allowed
es: pesos negativos no permitidos

source: number of offsets is %d should equal %d (number of observations)
es: el número de offsets es %d debe ser igual a %d (número de observaciones)

source: fitting to calculate the null deviance did not converge -- increase 'maxit'?
es: el ajuste para calcular la desviación nula no convergió: ¿quizá aumentando 'maxit'?

source: value of 'epsilon' must be > 0
es: el valor de 'epsilon' debe ser > 0

source: maximum number of iterations must be > 0
es: el número máximo de iteraciones debe ser > 0

source: 'family' argument seems not to be a valid family object
es: El argumento 'family' parece no ser un objeto family válido

source: invalid linear predictor values in empty model
es: valores de predictor lineal no válidos en un modelo vacío

source: invalid fitted means in empty model
es: medios ajustados no válidos en modelo vacío

source: length of 'start' should equal %d and correspond to initial coefs for %s
es: longitud de 'start' debe ser igual a %d y corresponder a los coeficientes iniciales de %s

source: NAs in V(mu)
es: NA en V(mu)

source: 0s in V(mu)
es: ceros en V(mu)

source: NAs in d(mu)/d(eta)
es: NA en d(mu)/d(eta)

source: no observations informative at iteration %d
es: no hay observaciones informativas en la iteración %d

source: non-finite coefficients at iteration %d
es: coeficientes no finitos en la iteración %d

source: singular fit encountered
es: ajuste singular encontrado

source: no valid set of coefficients has been found: please supply starting values
es: no se ha encontrado ningún conjunto válido de coeficientes: proporcione valores iniciales

source: step size truncated due to divergence
es: tamaño de paso truncado debido a divergencia

source: inner loop 1; cannot correct step size
es: bucle interior 1; no se puede corregir el tamaño del paso

source: step size truncated: out of bounds
es: tamaño de paso truncado: fuera de límites

source: inner loop 2; cannot correct step size
es: bucle interior 2; no se puede corregir el tamaño del paso

source: glm.fit: algorithm did not converge
es: glm.fit: el algoritmo no convergió

source: glm.fit: algorithm stopped at boundary value
es: glm.fit: algoritmo detenido en el valor límite

source: glm.fit: fitted probabilities numerically 0 or 1 occurred
es: glm.fit: probabilidades ajustadas numéricamente 0 o 1 ocurrieron

source: glm.fit: fitted rates numerically 0 occurred
es: glm.fit: se produjeron tasas ajustadas numéricamente 0

source: the following arguments to 'anova.glm' are invalid and dropped:
es: los siguientes argumentos para 'anova.glm' no son válidos y se eliminan:

source: using F test with a '%s' family is inappropriate
es: usar la prueba F con una familia '%s' es inapropiado

source: using F test with a fixed dispersion is inappropriate
es: usar la prueba F con una dispersión fija es inapropiado

source: models with response %s removed because response differs from model 1
es: modelos con respuesta %s eliminada porque la respuesta difiere del modelo 1

source: models were not all fitted to the same size of dataset
es: no todos los modelos se ajustaron al mismo tamaño de conjunto de datos

source: observations with zero weight not used for calculating dispersion
es: observaciones con peso cero no utilizadas para calcular la dispersión

source: The "ward" method has been renamed to "ward.D"; note new "ward.D2"
es: El método "ward" ha sido renombrado a "ward.D"; note el nuevo "ward.D2"

source: invalid clustering method
es: método de clusterización no válido

source: ambiguous clustering method
es: método de clusterización ambiguo

source: invalid dissimilarities
es: diferencias inválidas

source: size cannot be NA nor exceed 65536
es: el tamaño no puede ser NA ni exceder 65536

source: must have n >= 2 objects to cluster
es: debe tener n >= 2 objetos para agrupar

source: invalid length of members
es: longitud no válida de miembros

source: argument 'x' cannot be coerced to class %s
es: El argumento 'x' no puede convertirse a la clase %s

source: Consider providing an as.hclust.%s() method
es: Considere proporcionar un método as.hclust.%s()

source: need dendrograms where all leaves have labels
es: se requieren dendrogramas donde todas las hojas tengan etiquetas

source: 'k' and 'h' must be a scalar
es: 'k' y 'h' deben ser un escalar

source: specify exactly one of 'k' and 'h'
es: especifique exactamente uno de 'k' y 'h'

source: k must be between 2 and %d
es: k debe estar entre 2 y %d

source: specify exactly one of 'which' and 'x'
es: especifique exactamente uno de 'what' y 'x'

source: all elements of 'which' must be between 1 and %d
es: todos los elementos de 'what' deben estar entre 1 y %d

source: invalid parameter values
es: valores de parámetros no válidos

source: a limit is NA or NaN
es: uno de los límite es NA o NaN

source: missing values not allowed
es: valores faltantes no permitidos

source: 'r' is less than 1
es: 'r' es menor que 1

source: 'm' is less than 1
es: 'm' es menor que 1

source: 'r' is less than 0
es: 'r' es menor que 0

source: 'm' must be numeric with non-negative integers
es: 'm' debe ser numérico con números enteros no negativos

source: unknown named kernel
es: kernel con nombre desconocido

source: 'coef' must be a vector
es: 'coef' debe ser un vector

source: 'coef' does not have the correct length
es: 'coef' no tiene la longitud correcta

source: coefficients do not add to 1
es: los coeficientes no suman 1

source: 'k' is not a kernel
es: 'k' no es un núcleo

source: 'x' is shorter than kernel 'k'
es: 'x' es más corto que el kernel 'k'

source: 'kernapply' is not available for object 'x'
es: 'kernapply' no está disponible para el objeto 'x'

source: 'x' is not a kernel
es: 'x' no es un núcleo

source: empty cluster: try a better set of initial centers
es: clúster vacío: pruebe con un mejor conjunto de centros iniciales

source: number of cluster centres must lie between 1 and nrow(x)
es: el número de centros de clúster debe estar entre 1 y nrow(x)

source: Quick-TRANSfer stage steps exceeded maximum (= %d)
es: Los pasos de la etapa Quick-TRANSfer excedieron el máximo (= %d)

source: invalid nrow(x)
es: nrow(x) no válido

source: invalid ncol(x)
es: ncol(x) no válido

source: 'centers' must be a number or a matrix
es: 'centers' debe ser un número o una matriz

source: more cluster centers than distinct data points.
es: más centros de conglomerados que puntos de datos distintos.

source: initial centers are not distinct
es: los centros iniciales no son distintos

source: more cluster centers than data points
es: más centros de clúster que puntos de datos

source: 'iter.max' must be positive
es: 'iter.max' debe ser positivo

source: must have same number of columns in 'x' and 'centers'
es: debe tener el mismo número de columnas en 'x' y 'centers'

source: 'x' is a list, so ignoring argument 'g'
es: 'x' es una lista, por lo que se ignora el argumento 'g'

source: some elements of 'x' are not numeric and will be coerced to numeric
es: algunos elementos de 'x' no son numéricos y serán convertidos a numéro

source: not enough 'x' data
es: no hay suficientes datos 'x'

source: Parameter(s)
es: Parámetro(s)

source: ignored
es: ignorado

source: not enough 'y' data
es: no hay suficientes datos 'y'

source: p-value will be approximate in the presence of ties
es: el p-valor será aproximado en presencia de empates

source: 'y' must be numeric or a function or a string naming a valid function
es: 'y' debe ser numérico o una función o una cadena que nombre una función válida

source: ties should not be present for the one-sample Kolmogorov-Smirnov test
es: no debería haber empates para la prueba de Kolmogorov-Smirnov de una muestra

source: invalid arguments
es: argumentos no válidos

source: argument 'sizes' must be a vector of length 2
es: el argumento 'sizes' debe ser un vector de longitud 2

source: argument 'q' must be numeric
es: el argumento 'q' debe ser numérico

source: computation of exact probability failed, returning Monte Carlo approximation
es: el cálculo de la probabilidad exacta falló, se devuelve una aproximación de Monte Carlo

source: argument 'p' must be numeric
es: el argumento 'p' debe ser numérico

source: numeric y must be supplied. For density estimation use density()
es: se debe proporcionar valor "y" numérico. Para la estimación de densidad, utilice density()

source: 'k' is not an integer
es: 'k' no es un número entero

source: method = '%s' is not supported. Using 'qr'
es: método = '%s' no es compatible. Usando 'qr'

source: number of offsets is %d, should equal %d (number of observations)
es: el número de offsets es %d, debe ser igual a %d (número de observaciones)

source: 'x' must be a matrix
es: 'x' debe ser una matriz

source: 0 (non-NA) cases
es: cero casos (que no son NA)

source: incompatible dimensions
es: dimensiones incompatibles

source: missing or negative weights not allowed
es: no se permiten pesos faltantes o negativos

source: invalid 'lm' object: no 'terms' component
es: objeto 'lm' no válido: ningún componente 'terms'

source: calling summary.lm(<fake-lm-object>) ...
es: llamando a summary.lm() con un objeto lm falso ...

source: residual degrees of freedom in object suggest this is not an "lm" fit
es: los grados de libertad de los residuos en el objeto sugieren que este no es un ajuste de "lm"

source: essentially perfect fit: summary may be unreliable
es: ajuste (fit) esencialmente perfecto: el resumen puede no ser confiable

source: lm object does not have a proper 'qr' component. Rank zero or should not have used lm(.., qr=FALSE).
es: el objeto lm no tiene un componente 'qr' adecuado. Rango cero o no debería haber usado lm(.., qr=FALSE).

source: simulate() is not yet implemented for multivariate lm()
es: simulate() aún no está implementado para lm() multivariado

source: family '%s' not implemented
es: familia '%s' no implementada

source: calling anova.lm(<fake-lm-object>) ...
es: llamando a anova.lm() con un objeto lm falso ...

source: ANOVA F-tests on an essentially perfect fit are unreliable
es: Las pruebas ANOVA F sobre un ajuste (fit) esencialmente perfecto no son confiables

source: calling predict.lm(<fake-lm-object>) ...
es: llamando a predict.lm() con un objeto lm falso ...

source: prediction from rank-deficient fit
es: predicción a partir de un ajuste deficiente en rangos

source: %s; consider predict(., rankdeficient="NA")
es: %s; considere predict(., rankdeficient ="NA")

source: lower-rank qr: determining non-estimable cases
es: qr de rango inferior: determinación de casos no estimables

source: %s; attr(*, "non-estim") has doubtful cases
es: %s; attr(*, "non-estim") tiene casos dudosos

source: %s: NAs produced for non-estimable cases
es: %s: NA producidos para casos no estimables

source: predictions on current data refer to _future_ responses
es: las predicciones sobre datos actuales se refieren a respuestas _futuras_

source: assuming prediction variance inversely proportional to weights used for fitting
es: asumiendo una varianza de predicción inversamente proporcional a los pesos utilizados para el ajuste

source: Assuming constant prediction variance even though model fit is weighted
es: Suponiendo una varianza de predicción constante aunque el ajuste del modelo esté ponderado

source: 'weights' as formula should be one-sided
es: 'weights' dado como fórmula debe ser una formula de un solo lado

source: 'object' has no 'effects' component
es: 'object' no tiene ningún componente 'effects'

source: the 'se.fit' argument is not yet implemented for "mlm" objects
es: el argumento 'se.fit' aún no está implementado para los objetos "mlm"

source: invalid model QR matrix
es: matriz QR del modelo no válida

source: non-NA residual length does not match cases used in fitting
es: la longitud de los residuos que no son NA no coincide con los casos utilizados en el ajuste (fit)

source: too few cases i with h_ii > 0), n < k
es: muy pocos casos i con h_ii > 0), n < k

source: predictors must all be numeric
es: todos los predictores deben ser numéricos

source: 'degree' must be 0, 1 or 2
es: 'degree' debe ser 0, 1 o 2

source: both 'span' and 'enp.target' specified: 'span' will be used
es: tanto 'span' como 'enp.target' especificados: se utilizará 'span'

source: invalid 'control' argument
es: argumento 'control' no válido

source: invalid NCOL(X)
es: NCOL no válido(X)

source: only 1-4 predictors are allowed
es: solo se permiten de 1 a 4 predictores

source: invalid NROW(X)
es: NROW(X) no válido

source: invalid 'y'
es: 'y' no válido

source: specified the square of a factor predictor to be dropped when degree = 1
es: se especificó que el cuadrado de un predictor de factor se elimine cuando degree = 1

source: specified the square of a predictor to be dropped with only one numeric predictor
es: se especificó que el cuadrado de un predicto se elimine cuando haya solo un predictor numérico

source: specified parametric for all predictors
es: se especificó 'parametic' para todos los predictores

source: invalid argument 'span'
es: argumento no válido 'span'

source: invalid argument 'cell'
es: argumento no válido 'cell'

source: invalid argument 'degree'
es: argumento no válido 'degree'

source: iterTrace = %d is not obeyed since iterations = %d
es: iterTrace = %d no se respeta ya que 'iterations' = %d

source: first argument must be a "loess" object
es: El primer argumento debe ser un objeto "loess"

source: no models to compare
es: no hay modelos para comparar

source: extra arguments discarded
es: los argumentos adicionales se descartan

source: 'logLik.lm' does not support multiple responses
es: 'logLik.lm' no admite múltiples variables respuesta (mlm)

source: no "nobs" attribute is available
es: no hay ningún atributo "nobs" disponible

source: no 'nobs' method is available
es: no hay ningún método 'nobs' disponible

source: 'margin' must contain names or numbers corresponding to 'table'
es: 'margin' debe contener nombres o números correspondientes a 'table'

source: 'start' and 'table' must be same length
es: 'start' y 'table' deben tener la misma longitud

source: number of weights = %d should equal %d (number of responses)
es: número de pesos = %d debe ser igual a %d (número de respuestas)

source: 'X' matrix was collinear
es: la matriz 'X' era colineal

source: missing observations deleted
es: observaciones faltantes eliminadas

source: observations with 0 weight not used in calculating standard deviation
es: observaciones con peso 0 no utilizadas para calcular la desviación estándar

source: observations with 0 weights not used
es: observaciones con peso 0no utilizados

source: 'low' and 'high' cannot be both TRUE
es: 'low' y 'high' no pueden ser ambos TRUE

source: need multiple responses
es: necesito múltiples respuestas

source: object must be of class %s or %s
es: el objeto debe ser de clase %s o %s

source: residuals have rank %d < %d
es: los residuos tienen rango %d < %d

source: NAs are not allowed
es: NAs no están permitidos

source: each dimension in table must be >= 2
es: cada dimensión en la tabla debe ser >= 2

source: 'x' must be a 3-dimensional array
es: 'x' debe ser una matriz tridimensional

source: if 'x' is not an array, 'y' must be given
es: si 'x' no es una matriz, se debe proporcionar 'y'

source: if 'x' is not an array, 'z' must be given
es: si 'x' no es una matriz, se debe proporcionar 'z'
