Repository: daroczig/R-weblate-fork
Catalog: src/library/stats/po/R-*.po
Languages: es

source: 'x', 'y', and 'z' must have the same length
es: 'x', 'y' y 'z' deben tener la misma longitud

source: sample size in each stratum must be > 1
es: el tamaño de la muestra en cada estrato debe ser > 1

source: 'x' must be square with at least two rows and columns
es: 'x' debe ser un cuadrado con al menos dos filas y columnas

source: 'x' and 'y' must have the same number of levels (minimum 2)
es: 'x' y 'y' deben tener el mismo número de niveles (mínimo 2)

source: need numeric data
es: se requieren datos numéricos

source: 'mlm' objects with weights are not supported
es: los objetos 'mlm' con pesos no están soportados

source: X does not define a subspace of M
es: X no define un subespacio de M

source: residuals have rank %s < %s
es: los residuos tienen rango %s < %s

source: 'model.tables' is not implemented for multiple responses
es: 'model.tables' no está implementado para respuestas múltiples

source: type '%s' is not implemented yet
es: el tipo '%s' aún no está implementado

source: this fit does not inherit from "lm"
es: este ajuste (fit) no hereda de "lm"

source: 'cterms' argument must match terms in model object
es: El argumento 'cterms' debe coincidir con los términos del objeto modelo

source: Design is unbalanced - use se.contrast() for se's
es: El diseño está desequilibrado: use se.contrast() para errores estándar

source: design is unbalanced so cannot proceed
es: el diseño está desequilibrado por lo que no puede continuar

source: Standard error information not returned as design is unbalanced. Standard errors can be obtained through 'se.contrast'.
es: La información de error estándar no se devuelve porque el diseño está desequilibrado. Los errores estándar se pueden obtener a través de 'se.contrast'.

source: SEs for type '%s' are not yet implemented
es: Los errores estándar para el tipo '%s' aún no están implementados

source: na.action must be a function
es: na.action debe ser una función

source: non-factors ignored: %s
es: valores que no son factor ignorados: %s

source: eff.aovlist: non-orthogonal contrasts would give an incorrect answer
es: eff.aovlist: los contrastes no ortogonales darían una respuesta incorrecta

source: cannot create a formula from a zero-column data frame
es: no se puede crear una fórmula a partir de un data frame de cer columnas

source: invalid formula: %s
es: fórmula no válida: %s

source: invalid formula %s: not a call
es: fórmula no válida %s: no es una llamada

source: invalid formula %s: assignment is deprecated
es: fórmula no válida %s: la asignación es obsoleta

source: invalid formula %s: extraneous call to `%s` is deprecated
es: fórmula no válida %s: la llamada extraña a `%s` está obsoleta

source: invalid formula %s
es: fórmula no válida %s

source: no terms component nor attribute
es: sin componente ni atributo 'terms'

source: 'termlabels' must be a character vector of length at least one
es: 'termlabels' debe ser un vector de caracteres de longitud al menos uno

source: '%s' must be a character string
es: '%s' debe ser una cadena de caracteres

source: Unparseable 'response' "%s"; use is deprecated. Use as.name(.) or `..`!
es: ¡'response' "%s" no es parseable!; su uso es obsoleto. Utilice as.name(.) o `..`

source: 'termobj' must be a object of class %s
es: 'termobj' debe ser un objeto de clase %s

source: setting '%s' in terms.formula() is deprecated
es: establecer '%s' en terms.formula() es obsoleto

source: variable '%s' was fitted with type "%s" but type "%s" was supplied
es: la variable '%s' fue ajustada con el tipo "%s" pero se proporcionó el tipo "%s"

source: variables %s were specified with different types from the fit
es: las variables %s se especificaron con tipos diferentes respecto del ajuste

source: 'data' must be a data.frame, not a matrix or an array
es: 'data' debe ser un data.frame, no una matriz o un array

source: 'data' must be a data.frame, environment, or list
es: 'data' debe ser un data.frame, un entorno, o una lista

source: variable '%s' is not a factor
es: la variable '%s' no es un factor

source: contrasts dropped from factor %s
es: se suprimieron contrastes en factor %s

source: contrasts dropped from factor %s due to missing levels
es: se suprimieron contrastes del factor %s debido a niveles faltantes

source: 'offset' must be numeric
es: 'offset' debe ser numérico

source: model frame and formula mismatch in model.matrix()
es: el marco del modelo y la fórmula no coinciden en model.matrix()

source: non-list contrasts argument ignored
es: argumento contrast que no es de lista es ignorado

source: 'contrasts.arg' argument must be named
es: el argumento 'contrasts.arg' debe tener nombres

source: variable '%s' is absent, its contrast will be ignored
es: la variable '%s' está ausente, su contraste será ignorado

source: using type = "numeric" with a factor response will be ignored
es: se ignorará el uso de type = "numeric" con una respuesta de factor

source: invalid response type
es: tipo de respuesta "response" no válido

source: invalid 'data' argument
es: argumento 'data' no válido

source: all times contain an NA
es: todas las series de tiemp contienen al menos un NA

source: missing values in object
es: valores faltantes en el objeto

source: invalid argument 'omit'
es: argumento no válido 'omit'

source: 'print.level' must be in {0,1,2}
es: 'print.level' debe estar en {0,1,2}

source: 'interval' must be a vector of length 2
es: 'interval' debe ser un vector de longitud 2

source: lower < upper is not fulfilled
es: no se cumple 'lower' < 'upper'

source: f.lower = f(lower) is NA
es: f.lower = f(lower) es NA

source: f.upper = f(upper) is NA
es: f.upper = f(upper) es NA

source: invalid 'extendInt'; please report
es: 'extendInt' no válido; por favor reportar

source: no sign change found in %d iterations
es: no se encontró ningún cambio de signo en %d iteraciones

source: did not succeed extending the interval endpoints for f(lower) * f(upper) <= 0
es: no se logró extender los extremos del intervalo para f(lower) * f(upper) <= 0

source: f() values at end points not of opposite sign
es: valores de f() en los extremos son de signo opuesto

source: convergence problem in zero finding:
es: problema de convergencia en la búsqueda de ceros:

source: 'control' argument must be a named list
es: el argumento 'control' debe ser una lista con nombres

source: logical 'hessian' argument not allowed. See documentation.
es: argumento 'hessian' lógico no está permitido. Ver documentación.

source: 'params' has wrong length
es: 'params' tiene una longitud incorrecta

source: 'varying' must be in seq_along(pars)
es: 'varying' debe estar en seq_along(pars)

source: 'varying' has wrong length
es: 'varying' tiene una longitud incorrecta

source: 'varying' must be logical, integer or character
es: 'varying' debe ser lógico, entero o de carácter

source: invalid argument to 'getProfile'
es: argumento no válido para 'getProfile'

source: cannot recognize parameter name
es: no se reconoce el nombre del parámetro

source: levels truncated to positive values only
es: niveles truncados solo a valores positivos

source: invalid 'attr(rhs, "gradient")'
es: 'attr(rhs, "gradient")' no válido

source: setVarying : 'vary' length must match length of parameters
es: setVarying: la longitud de 'vary' debe coincidir con la longitud de los parámetros

source: singular gradient matrix at initial parameter estimates
es: matriz de gradiente singular en estimaciones de parámetros iniciales

source: 'data' must be a list or an environment
es: 'data' debe ser una lista o un entorno

source: no starting values specified
es: no se han especificado valores iniciales

source: parameters without starting value in 'data': %s
es: parámetros sin valor inicial en 'data': %s

source: no parameters to fit
es: no hay parámetros para ajustar

source: argument 'subset' will be ignored
es: el argumento 'subset' será ignorado

source: argument 'na.action' will be ignored
es: el argumento 'na.action' será ignorado

source: upper and lower bounds ignored unless algorithm = "port"
es: se ignoran los límites superior e inferior a menos que el algorithm = "port"

source: cannot calculate REML log-likelihood for "nls" objects
es: no se puede calcular la log-verosimilitud REML para objetos "nls"

source: anova is only defined for sequences of "nls" objects
es: anova solo está definido para secuencias de objetos "nls"

source: 'anova' is only defined for sequences of "nls" objects
es: 'anova' solo está definido para secuencias de objetos "nls"

source: formula '%s' must be of the form '~expr'
es: la fórmula '%s' debe tener el formato '~expr'

source: '%s' cannot be of mode '%s'
es: '%s' no puede ser de modo '%s'

source: a two-sided formula is required
es: se requiere una fórmula de dos miembros

source: not enough groups
es: no hay suficientes grupos

source: bounds can only be used with method L-BFGS-B (or Brent)
es: los límites (bounds) solo se pueden usar con el método L-BFGS-B (o Brent)

source: unknown names in control:
es: nombres desconocidos en control:

source: read the documentation for 'trace' more carefully
es: lea la documentación de 'trace' más detenidamente

source: 'trace != 0' needs 'REPORT >= 1'
es: 'trace != 0' necesita 'REPORT >= 1'

source: method L-BFGS-B uses 'factr' (and 'pgtol') instead of 'reltol' and 'abstol'
es: El método L-BFGS-B usa 'factr' (y 'pgtol') en lugar de 'reltol' y 'abstol'

source: one-dimensional optimization by Nelder-Mead is unreliable: use "Brent" or optimize() directly
es: la optimización unidimensional de Nelder-Mead no es confiable: use "Brent" u optimice() directamente

source: method = "Brent" is only available for one-dimensional optimization
es: el método = "Brent" solo está disponible para optimización unidimensional

source: 'lower' and 'upper' must be finite values
es: 'lower' y 'upper' deben ser valores finitos

source: pooling of SD is incompatible with paired tests
es: desviación estándar agrupada es incompatible con las pruebas apareadas

source: 'x' must have 2 columns
es: 'x' debe tener 2 columnas

source: 'x' and 'n' must have the same length
es: 'x' y 'n' deben tener la misma longitud

source: too few groups
es: muy pocos grupos

source: not plotting observations with leverage one: %s
es: no se grafican observaciones con apalancamiento uno: %s

source: use only with "lm" objects
es: utilizar solamente con objetos "lm"

source: 'which' must be in 1:6
es: 'which' debe estar en 1:6

source: 'id.n' must be in {1,..,%d}
es: 'id.n' debe estar en {1,..,%d}

source: y is empty or has only NAs
es: y está vacío o solo tiene NA

source: hat values (leverages) are all = %s and there are no factor predictors; no plot no. 5
es: los valores "^" (leverages) son todos = %s y no hay predictores de factor; sin gráfico nro 5

source: 'x' and 'T' have incompatible length
es: 'x' y 'T' tienen una longitud incompatible

source: 'x' must be finite, nonnegative, and integer
es: 'x' debe ser finito, no negativo y entero

source: 'T' must be nonnegative
es: 'T' debe ser no negativo

source: not enough data
es: no hay suficientes datos

source: the case k > 2 is unimplemented
es: el caso k > 2 no está implementado

source: 'r' must be a single positive number
es: 'r' debe ser un único número positivo

source: exactly one of 'n', 'delta', 'sd', 'power', and 'sig.level' must be NULL
es: exactamente uno de 'n', 'delta', 'sd', 'power' y 'sig.level' debe ser NULL

source: exactly one of 'n', 'p1', 'p2', 'power', and 'sig.level' must be NULL
es: exactamente uno de 'n', 'p1', 'p2', 'power' y 'sig.level' debe ser NULL

source: No p1 in [0, p2] can be found to achieve the desired power
es: No se puede encontrar p1 en [0, p2] para lograr el poder estadístico deseado

source: No p2 in [p1, 1] can be found to achieve the desired power
es: No se puede encontrar p2 en [p1, 1] para lograr el poder estadístico deseado

source: No significance level [0, 1] can be found to achieve the desired power
es: No se puede encontrar ningún nivel de significancia en [0, 1] para lograr la potencia deseada

source: '%s' must be numeric in [0, 1]
es: '%s' debe ser numérico en [0, 1]

source: exactly one of 'groups', 'n', 'between.var', 'within.var', 'power', and 'sig.level' must be NULL
es: exactamente uno de 'groups', 'n', 'between.var', 'within.var', 'power' y 'sig.level' debe ser NULL

source: number of groups must be at least 2
es: el número de grupos debe ser al menos 2

source: number of observations in each group must be at least 2
es: el número de observaciones en cada grupo debe ser al menos 2

source: 'nterms' is missing with no default
es: Falta 'nterms' sin valor predeterminado

source: 'ppr' applies only to numerical variables
es: 'ppr' solo se aplica a variables numéricas

source: mismatched 'x' and 'y'
es: 'x' y 'y' no coinciden

source: wrong number of columns in 'x'
es: número incorrecto de columnas en 'x'

source: cannot rescale a constant/zero column to unit variance
es: no se puede reescalar a varianza unitaria una columna constante o cero

source: PCA applies only to numerical variables
es: PCA se aplica solo a variables numéricas

source: no scores are available: refit with 'retx=TRUE'
es: no hay puntuaciones (scores) disponibles: se ajusta de nuevo con 'retx=TRUE'

source: 'newdata' must be a matrix or data frame
es: 'newdata' debe ser una matriz o un data frame

source: 'newdata' does not have named columns matching one or more of the original columns
es: 'newdata' no tiene columnas con nombre que coincidan con una o más de las columnas originales

source: 'newdata' does not have the correct number of columns
es: 'newdata' no tiene el número correcto de columnas

source: both 'x' and 'covmat' were supplied: 'x' will be ignored
es: se proporcionaron 'x' y 'covmat': 'x' se ignorará

source: 'princomp' can only be used with more units than variables
es: 'princomp' sólo se puede utilizar con más unidades que variables

source: cannot use 'cor = TRUE' with a constant variable
es: no se puede utilizar 'cor = TRUE' con una variable constante

source: covariance matrix is not non-negative definite
es: la matriz de covarianza no es definida no negativa

source: argument does not include a 'qr' component
es: el argumento no incluye un componente 'qr'

source: argument does not include an 'effects' component
es: el argumento no incluye un componente 'effects'

source: 'proj' is not implemented for multiple responses
es: 'proj' no está implementado para múltiples variables respuesta

source: table 'x' should have 2 entries
es: la tabla 'x' debe tener 2 entradas

source: elements of 'n' must be positive
es: los elementos de 'n' deben ser positivos

source: elements of 'x' must be nonnegative
es: Los elementos de 'x' deben ser no negativos

source: elements of 'x' must not be greater than those of 'n'
es: Los elementos de 'x' no deben ser mayores que los de 'n'

source: 'p' must have the same length as 'x' and 'n'
es: 'p' debe tener la misma longitud que 'x' y 'n'

source: elements of 'p' must be in (0,1)
es: los elementos de 'p' deben estar en (0,1)

source: 'conf.level' is not a probability
es: 'conf.level' no es una probabilidad

source: 'formula' missing
es: falta 'fórmula'

source: 'type' must be 1 or 3 for ordered factors
es: 'type' debe ser 1 o 3 para factores ordenados

source: (unordered) factors are not allowed
es: los factores (no ordenados) no están permitidos

source: missing values and NaN's not allowed if 'na.rm' is FALSE
es: valores faltantes y NaN's no permitidos si 'na.rm' es FALSE

source: 'probs' outside [0,1]
es: 'probs' fuera del rango [0,1]

source: invalid argument 'n'
es: argumento no válido 'n'

source: invalid argument 'r'
es: argumento no válido 'r'

source: invalid argument 'c'
es: argumento no válido 'c'

source: arguments 'r' and 'c' must have the same sums
es: los argumentos 'r' y 'c' deben tener las mismas sumas

source: 'relevel' only for (unordered) factors
es: 'relevel' solo para factores (no ordenados)

source: 'relevel' only for unordered factors
es: 'relevel' solo para factores no ordenados

source: 'ref' must be of length one
es: 'ref' debe tener una longitud de uno

source: 'ref' must be an existing level
es: 'ref' debe ser un nivel existente

source: ref = %d must be in 1L:%d
es: ref = %d debe estar en 1L:%d

source: failed to guess time-varying variables from their names
es: no fue imposible inferir las variables que varían en el tiempo (time-varying) partir de sus nombres

source: 'varying' arguments must be the same length
es: los argumentos 'varying' deben tener la misma longitud

source: 'lengths(varying)' must all match 'length(times)'
es: 'lengths(varying)' deben coincidir con 'length(times)'

source: 'idvar' must uniquely identify records
es: 'idvar' debe identificar de forma única los registros

source: there are records with missing times, which will be dropped.
es: hay registros con tiempos faltantes, que se eliminarán.

source: some constant variables (%s) are really varying
es: algunas variables constantes (%s) en realidad varían

source: no 'reshapeWide' attribute, must specify 'varying'
es: sin atributo 'reshapeWide', debe especificar 'varying'

source: 'varying' must be nonempty list or vector
es: 'varying' debe ser una lista o un vector no vacío

source: length of 'v.names' does not evenly divide length of 'varying'
es: la longitud de 'v.names' no divide uniformemente la longitud de 'varying'

source: length of 'varying' must be the product of length of 'v.names' and length of 'times'
es: la longitud de 'varying' debe ser el producto de la longitud de 'v.names' y la longitud de 'times'

source: 'k' must be positive
es: 'k' debe ser positivo

source: 'k' must be odd! Changing 'k' to %d
es: ¡'k' debe ser impar! Cambiando 'k' a %d

source: 'k' is bigger than 'n'! Changing 'k' to %d
es: ¡'k' es más grande que 'n'! Cambiando 'k' a %d

source: bandwidth 'k' must be >= 1 and odd!
es: ¡el ancho de banda 'k' debe ser >= 1 e impar!

source: argument 'object' has an impossible length
es: el argumento 'object' tiene una longitud imposible

source: right-hand side of formula is not a call
es: el lado derecho de la fórmula no es una llamada

source: no 'getInitial' method found for "%s" objects
es: no se encontró ningún método 'getInitial' para los objetos "%s"

source: sample size must be between 3 and 5000
es: el tamaño de la muestra debe estar entre 3 y 5000

source: all 'x' values are identical
es: todos los valores 'x' son idénticos

source: attempt to smooth non-numeric values
es: intento de suavizar valores no numéricos

source: attempt to smooth NA values
es: intento de suavizar valores NA

source: invalid 'endrule' argument
es: argumento 'endrule' no válido

source: invalid 'control.spar'
es: 'control.spar' no válido

source: missing or infinite values in inputs are not allowed
es: no se permiten valores de entrada faltante so infinitos

source: invalid number of points
es: número de puntos no válido

source: lengths of 'x' and 'w' must match
es: las longitudes de 'x' y 'w' deben coincidir

source: all weights should be non-negative
es: todos los pesos deben ser no negativos

source: some weights should be positive
es: algunos pesos deben ser positivos

source: 'tol' must be strictly positive and finite
es: 'tol' debe ser estrictamente positivo y finito

source: invalid 'keep.stuff'
es: 'keep.stuff' no válido

source: need at least four unique 'x' values
es: necesita al menos cuatro valores 'x' únicos

source: 'cv' must not be NA when 'df' is specified
es: 'cv' no debe ser NA cuando se especifica 'df'

source: cross-validation with non-unique 'x' values seems doubtful
es: la validación cruzada con valores 'x' no únicos parece dudosa

source: Numeric 'all.knots' must be strictly increasing
es: El número 'all.knots' debe ser estrictamente creciente

source: 'all.knots' is vector of knots; 'nknots' specification is disregarded
es: 'all.knots' es un vector de nudos; La especificación 'nknots' no se tiene en cuenta

source: numeric 'all.knots' must cover [0,1] (= the transformed data-range)
es: el numérico 'all.knots' debe cubrir [0,1] (= el rango de datos transformado)

source: 'all.knots' is TRUE; 'nknots' specification is disregarded
es: 'all.knots' es VERDADERO; La especificación 'nknots' no se tiene en cuenta

source: 'nknots' must be numeric (in {1,..,n})
es: 'nknots' debe ser numérico (en {1,..,n})

source: 'nknots' must be at least 1
es: 'nknots' debe ser al menos 1

source: cannot use more inner knots than unique 'x' values
es: no se pueden utilizar más nudos internos que valores únicos 'x'

source: must not specify both 'spar' and 'lambda'
es: no debe especificar tanto 'spar' como 'lambda'

source: 'spar' must be of length 1
es: 'spar' debe tener una longitud de 1

source: not using invalid df; must have 1 < df <= n := #{unique x} =
es: no se utiliza el valor de 'df' no válido; debe tener 1 < df <= n := #{unique x} =

source: NA lev[]; probably smoothing parameter 'spar' way too large!
es: lev[] NA; ¡probablemente el parámetro de suavizado 'spar' es demasiado grande!

source: setting df = 1 __use with care!__
es: se establece df = 1 __¡úselo con cuidado!__

source: need result of smooth.spline(keep.data = TRUE)
es: se requiere el resultado de smooth.spline(keep.data = TRUE)

source: type = "partial" is not yet implemented
es: type = "partial" aún no está implementado

source: not a valid "smooth.spline" object
es: no es un objeto "smooth.spline" válido

source: 'span' must be between 0 and 1.
es: 'span' debe estar entre 0 y 1.

source: 'y' must be numeric vector
es: 'y' debe ser un vector numérico

source: number of observations in 'x' and 'y' must match.
es: el número de observaciones en 'x' y 'y' debe coincidir.

source: number of weights must match number of observations.
es: el número de pesos debe coincidir con el número de observaciones.

source: 'x' must be between 0 and 1 for periodic smooth
es: 'x' debe estar entre 0 y 1 para suavizado periódico

source: no finite observations
es: no hay observaciones finitas

source: 'p' must be between 0 and 0.5
es: 'p' debe estar entre 0 y 0,5

source: length of 'p' must be 1 or equal the number of columns of 'x'
es: la longitud de 'p' debe ser 1 o igual al número de columnas de 'x'

source: 'x' must be a time series or an ar() fit
es: 'x' debe ser una serie temporal o un ajuste ar()

source: must specify 'spans' or a valid kernel
es: debe especificar 'spans' o un kernel válido

source: coverage probability out of range [0,1)
es: probabilidad de cobertura fuera de rango [0,1)

source: spline: first and last y values differ - using y[1] for both
es: spline: el primer y último valor de y difieren - usando y[1] para ambos

source: 'y' must be increasing or decreasing
es: 'y' debe ser creciente o decreciente

source: 'spline' requires n >= 1
es: 'spline' requiere n >= 1

source: spline: first and last y values differ - using y[1L] for both
es: spline: el primer y último valor de y difieren - usando y[1L] para ambos

source: 'deriv' must be between 0 and 3
es: 'deriv' debe estar entre 0 y 3

source: 'x' must be *strictly* increasing (non - NA)
es: 'x' debe ser *estrictamente* creciente (no NA)

source: stepfun: 'x' must be ordered increasingly
es: stepfun: 'x' debe ordenarse cada vez más

source: 'x' must have length >= 1
es: 'x' debe tener una longitud >= 1

source: 'y' must be one longer than 'x'
es: 'y' debe ser uno más largo que 'x'

source: no 'as.stepfun' method available for 'x'
es: no hay ningún método 'as.stepfun' disponible para 'x'

source: not a valid step function
es: no es una función de paso válida

source: 'plot.stepfun' called with wrong type of argument 'x'
es: 'plot.stepfun' llamado con un tipo de argumento incorrecto 'x'

source: %s must be 0 or 1
es: %s debe ser 0 o 1

source: only univariate series are allowed
es: solo se permiten series univariadas
