Repository: daroczig/R-weblate-fork
Catalog: src/library/tools/po/R-*.po
Languages: es

source: Checking %s
es: Comprobando %s

source: Processing %s ...
es: Procesando %s ...

source: argument 'package' must be of length 1
es: argumento 'package' debe ser de longitud 1

source: you must specify 'package' or 'dir'
es: Debe especificar 'package' o 'dir'

source: directory '%s' does not exist
es: El directorio '%s' no existe

source: neither code nor data objects found
es: No se encontraron ni los objetos de datos ni el código

source: Undocumented code objects:
es: Objetos de código no documentados:

source: Undocumented data sets:
es: Conjuntos de datos no documentados:

source: Undocumented S4 classes:
es: Clases S4 no documentadas:

source: Undocumented S4 methods:
es: Métodos S4 no documentados:

source: Prototyped non-primitives:
es: No-primitivas con prototipo:

source: Undocumented %s:
es: %s no documentados/as:

source: directory '%s' does not contain R code
es: el directorio '%s' no contiene código R

source: directory '%s' does not contain Rd objects
es: el directorio '%s' no contiene objetos Rd

source: Functions or methods with usage in Rd file '%s' but not in code:
es: Funciones o métodos con uso en el archivo Rd '%s' pero no en el código:

source: Data with usage in Rd file '%s' but not in code:
es: Datos con uso en el archivo Rd '%s' pero no en el código:

source: Variables with usage in Rd file '%s' but not in code:
es: Variables con uso en el archivo Rd '%s' pero no en el código:

source: Argument names in code not in docs:
es: Nombres de argumentos en el código, no en los documentos:

source: Argument names in docs not in code:
es: Nombres de argumentos en documentos que no están en el código:

source: Mismatches in argument names (first 3):
es: Discrepancias en los nombres de los argumentos (los 3 primeros):

source: Mismatches in argument names:
es: Discrepancias en los nombres de los argumentos:

source: Mismatches in argument default values (first 3):
es: Discrepancias en los valores predeterminados de los argumentos (los primeros 3):

source: Mismatches in argument default values:
es: Discrepancias en los valores predeterminados de los argumentos:

source: Codoc mismatches from Rd file '%s':
es: Discrepancias de Codoc del archivo Rd '%s':

source: Code: %s
es: Código: %s

source: S4 class codoc mismatches from Rd file '%s':
es: Discrepancias de codoc de clase S4 del archivo Rd '%s':

source: Slots for class '%s'
es: Slots para la clase '%s'

source: Data codoc mismatches from Rd file '%s':
es: Discrepancias de codoc de datos del archivo Rd '%s':

source: Variables in data frame '%s'
es: Variables en el data frame '%s'

source: Undocumented arguments in Rd file '%s'
es: Argumentos no documentados en el archivo Rd '%s'

source: Duplicated \argument entries in Rd file '%s':
es: Entradas \argument duplicadas en el archivo Rd '%s':

source: Documented arguments not in \usage in Rd file '%s':
es: Argumentos documentados no están en \usage en el archivo Rd '%s':

source: Objects in \usage without \alias in Rd file '%s':
es: Objetos en \usage sin \alias en el archivo Rd '%s':

source: Assignments in \usage in Rd file '%s':
es: Asignaciones en \usage en el archivo Rd '%s':

source: Bad \usage lines found in Rd file '%s':
es: Líneas \usage erróneas en el archivo Rd '%s':

source: S3 methods shown with full name in Rd file '%s':
es: Métodos S3 se muestran con nombre completo en el archivo Rd '%s':

source: you must specify 'package', 'dir' or 'file'
es: debe especificar 'package', 'dir', o 'file'

source: file '%s' does not exist
es: archivo '%s' no existe

source: parse error in file '%s': %s
es: error de parseo en el archivo '%s': %s

source: cannot check R code installed as image
es: no se puede comprobar el código R instalado como imagen

source: parse error in examples from file '%s': %s
es: error de parseo en ejemplos del archivo '%s': %s

source: File '%s':
es: Archivo '%s':

source: found T/F in %s
es: se encontró T/F en %s

source: The package 'dir' argument must be of length 1
es: El argumento 'dir' del paquete debe tener una longitud de 1

source: package name '%s' seems invalid; using directory name '%s' instead
es: el nombre del paquete '%s' parece no válido; usando el nombre de directorio '%s' en su lugar

source: Vignette dependencies (%s entries) must be contained in the DESCRIPTION Depends/Suggests/Imports entries.
es: Las dependencias de viñeta (entradas %s) deben estar contenidas en las entradas Depends/Suggests/Imports de DESCRIPTION.

source: Malformed package name
es: Nombre del paquete mal formado

source: Unknown encoding
es: Codificación desconocida

source: Fields with non-ASCII tags:
es: Campos con etiquetas no ASCII:

source: All field tags must be ASCII.
es: Todas las etiquetas de campo deben ser ASCII.

source: Fields with non-ASCII values:
es: Campos con valores no ASCII:

source: These fields must have ASCII values.
es: Estos campos deben tener valores ASCII.

source: Malformed package version.
es: Versión del paquete mal formada.

source: Malformed maintainer field.
es: Campo de mantenedor mal formado.

source: Malformed Depends or Suggests or Imports or Enhances field.
es: Formato incorrecto en Depends, Suggests, Imports, o Enhaces.

source: Offending entries:
es: Entradas ilegales:

source: Entries must be names of packages optionally followed by '<=' or '>=', white space, and a valid version number in parentheses.
es: Las entradas deben ser nombres de paquetes seguidos opcionalmente de '<=' o '>=', espacios en blanco y un número de versión válido entre paréntesis.

source: Entries with infeasible comparison operator:
es: Entradas con operador de comparación imposible:

source: Only operators '<=' and '>=' are possible.
es: Sólo son posibles los operadores '<=' y '>='.

source: Entries with infeasible version number:
es: Entradas con número de versión no factible:

source: Version numbers must be sequences of at least two non-negative integers, separated by single '.' or '-'.
es: Los números de versión deben ser secuencias de al menos dos números enteros no negativos, separados por un solo '.' o '-'.

source: Invalid VignetteBuilder field.
es: Campo VignetteBuilder no válido.

source: This field must contain one or more packages (and no version requirement).
es: Este campo debe contener uno o más paquetes (y ningún requisito de versión).

source: Invalid Priority field.
es: Campo Priority no válido.

source: Packages with priorities 'base' or 'recommended' or 'defunct-base' must already be known to R.
es: Los paquetes con prioridades 'base', 'recommended' o 'defunct-base' ya deben ser conocidos por R.

source: Malformed Title field: should not end in a period.
es: Campo Título mal formado: no debe terminar en un punto.

source: Malformed Description field: should contain one or more complete sentences.
es: Campo de descripción mal formado: debe contener una o más oraciones completas.

source: See section 'The DESCRIPTION file' in the 'Writing R Extensions' manual.
es: Consulte la sección 'The DESCRIPTION file' en el manual 'Writing R Extensions'.

source: Malformed Authors@R field:
es: Campo Authors@R con formato incorrecto:

source: Cannot extract Author field from Authors@R field:
es: No se puede extraer el campo Author del campo Autores@R:

source: Authors@R field gives no person with name and roles.
es: El campo Authors@R no proporciona ninguna persona con nombre ni funciones.

source: Authors@R field gives persons with no name:
es: El campo Authors@R proporciona personas sin nombre:

source: Authors@R field gives persons with no role:
es: El campo Authors@R proporciona personas sin rol:

source: Authors@R field gives no person with name and author role
es: El campo Authors@R no proporciona ninguna persona con nombre ni función de autor

source: Cannot extract Maintainer field from Authors@R field:
es: No se puede extraer el campo Mantenedor del campo Authors@R:

source: Authors@R field gives more than one person with maintainer role:
es: El campo Authors@R proporciona más de una persona con rol de mantenedor:

source: Authors@R field gives no person with maintainer role, valid email address and non-empty name.
es: El campo Authors@R no proporciona ninguna persona con rol de mantenedor, dirección de correo electrónico válida y nombre que no esté vacío.

source: Authors@R field gives persons with invalid ORCID identifiers:
es: El campo Authors@R proporciona personas con identificadores ORCID no válidos:

source: Encoding '%s' is not portable
es: La codificación '%s' no es portable

source: Unknown encoding with non-ASCII data
es: Codificación desconocida con datos no ASCII

source: Record: %d Field(s): %s
es: Registro: %d Campo(s): %s

source: Non-standard license specification:
es: Especificación de licencia no estándar:

source: Standardizable: %s
es: Estandarizable: %s

source: Standardized license specification:
es: Especificación de licencia estandarizada:

source: Deprecated license: %s
es: Licencia obsoleta: %s

source: Invalid license file pointers: %s
es: Puntero de archivo de licencia no válido: %s

source: License components with restrictions not permitted:
es: Componentes de licencia con restricciones no permitidas:

source: License components which are templates and need '+ file LICENSE':
es: Componentes de licencia que son plantillas necesitan '+ file LICENCE':

source: License stub is invalid DCF.
es: Registros para completar de licencia no es DCF válido.

source: License stub records with missing/empty fields:
es: Registros para completar de licencia tienen campos faltantes o vacíos:

source: Uses ACM license: only appropriate for pre-2013 ACM TOMS code
es: Utiliza licencia ACM: solo es apropiado para el código ACM TOMS anterior a 2013

source: Non-portable flags in variable '%s':
es: Marca no portable en variable '%s':

source: Non-portable flags in file '%s':
es: Marca no portable en archivo '%s':

source: Variables overriding user/site settings:
es: Variables que anulan la configuración del usuario/sitio:

source: invalid 'OS.type' "%s". Should not happen
es: 'Tipo de sistema operativo' "%s" no válido. no debería suceder

source: Missing link or links in Rd file '%s':
es: Enlace(s) faltante(s) en el archivo Rd '%s':

source: Non-file package-anchored link(s) in Rd file '%s':
es: Enlace(s) anclado(s) a paquete que no son archivos en el archivo Rd '%s':

source: See section 'Cross-references' in the 'Writing R Extensions' manual.
es: Consulte la sección 'Cross-references' en el manual 'Writing R Extensions'.

source: Call sequence:
es: Secuencia de llamada:

source: No dataset created in 'envir'
es: No se creó ningún dataset en 'envir'

source: Search path was changed
es: Se cambió la ruta de búsqueda

source: File %s:
es: Archivo %s:

source: %s has wrong argument list %s
es: %s tiene una lista de argumentos incorrecta %s

source: %s calls:
es: llamadas %s :

source: Package startup functions should have two arguments with names starting with %s and %s, respectively.
es: Las funciones de startup de paquetes deben tener dos argumentos con nombres que comiencen con %s y %s, respectivamente.

source: Package startup functions should not change the search path.
es: Las funciones de inicio del paquete no deberían cambiar la ruta de búsqueda.

source: Package startup functions should use %s to generate messages.
es: Las funciones de inicio de paquetes deben usar %s para generar mensajes.

source: Package startup functions should not call %s.
es: Las funciones de startup del paquete no deben llamar a %s.

source: See section %s in '%s'.
es: Ver sección %s en '%s'.

source: Package detach functions should have one argument with name starting with %s.
es: Las funciones de detach de paquetes deben tener un argumento con un nombre que comience con %s.

source: Package detach functions should not call %s.
es: Las funciones de detach de paquetes no deben llamar a %s.

source: unable to create
es: no se puede crear

source: unable to write code files
es: no se pueden escribir archivos de código

source: package 'methods' is used but not declared
es: el paquete 'methods' se utiliza pero no se declara

source: '::' or ':::' imports not declared from:
es: importaciones '::' o ':::' no declaradas desde:

source: '::' or ':::' import not declared from: %s
es: importación '::' o ':::'no declarada desde: %s

source: 'library' or 'require' calls not declared from:
es: llamadas 'library' o 'require' no declaradas desde:

source: 'library' or 'require' call not declared from: %s
es: llamada 'library' o 'require' no declarada desde: %s

source: 'loadNamespace' or 'requireNamespace' calls not declared from:
es: llamadas 'loadNamespace' o 'requireNamespace' no declaradas desde:

source: 'loadNamespace' or 'requireNamespace' call not declared from: %s
es: llamada 'loadNamespace' o 'requireNamespace' no declarada desde: %s

source: 'library' or 'require' calls to packages already attached by Depends:
es: llamadas 'library' o 'require' a paquetes ya adjuntos por Depends:

source: 'library' or 'require' call to %s which was already attached by Depends.
es: llamada a 'library' o 'require' a %s que ya estaba adjuntado por Depends.

source: 'library' or 'require' calls in package code:
es: llamados a 'library' o 'require' en el código del paquete:

source: 'library' or 'require' call to %s in package code.
es: llamado a 'library' o 'require' a %s en el código del paquete.

source: Namespaces in Imports field not imported from:
es: Espacios de nombres en el campo Imports no importados desde:

source: Namespace in Imports field not imported from: %s
es: Espacio de nombres en el campo Imports no importado desde: %s

source: Packages in Depends field not imported from:
es: Paquetes en el campo Depends no importados de:

source: Package in Depends field not imported from: %s
es: Paquete en el campo Depends no importado de: %s

source: Missing or unexported objects:
es: Objetos faltantes o no exportados:

source: Missing or unexported object: %s
es: Objeto faltante o no exportado: %s

source: ':::' calls which should be '::':
es: 'llamadas :::' que deberían ser '::':

source: ':::' call which should be '::': %s
es: llamada ':::' que debería ser '::': %s

source: Missing objects imported by ':::' calls:
es: Objetos faltantes importados por llamadas ':::':

source: Missing object imported by a ':::' call: %s
es: Objeto faltante importado por una llamada ':::': %s

source: Unexported objects imported by ':::' calls:
es: Objetos importados mediante ':::' no exportados:

source: Unexported object imported by a ':::' call: %s
es: Objeto importado mediante ':::' no exportado: %s

source: Unavailable namespaces imported from by ':::' calls:
es: Espacio de nombres desde los que se importaba mediante ':::' no disponibles:

source: Unavailable namespace imported from by a ':::' call: %s
es: Espacio de nombres desde el que se importaba mediante ':::' no disponible: %s

source: 'data(package=)' calls not declared from:
es: llamadas 'data(package=)' no declaradas desde:

source: 'data(package=)' call not declared from: %s
es: llamadas 'data(package=)' no declaradas desde: %s

source: Package has no 'Version' field
es: El paquete no tiene el campo 'Version'

source: NB: need Internet access to use CRAN incoming checks
es: NB: necesita acceso a Internet para utilizar verifaciones entrantes de CRAN

source: Rd files with duplicated name '%s':
es: Archivos Rd con nombre duplicado '%s':

source: Rd files with duplicated alias '%s':
es: Archivos Rd con alias duplicado '%s':

source: Rd files without \alias:
es: Archivos Rd sin \alias:

source: Invalid package aliases in Rd file '%s':
es: Alias de paquetes no válidos en el archivo Rd '%s':

source: Argument items with no description in Rd file '%s':
es: Elementos de argumento sin descripción en el archivo Rd '%s':

source: Auto-generated content requiring editing in Rd file '%s':
es: Contenido generado automáticamente que requiere edición en el archivo Rd '%s':

source: Rd files without \description:
es: Archivos Rd sin \descripción:

source: no Rd sections specified
es: no se especifican secciones Rd

source: Generics 'g' in 'env' %s where '%s' errors: %s May need something like %s in NAMESPACE.
es: Genéricos 'g' en 'env' %s donde '%s' son error: %s Puede necesitar algo como %s en NAMESPACE.

source: concordance is not valid
es: la concordancia no es válida

source: Rd object required
es: Se requiere objeto Rd

source: missing/empty %s field in '%s'
es: campo %s faltante/vacío en '%s'

source: Rd files must have a non-empty %s.
es: Los archivos Rd deben tener un %s que no esté vacío.

source: See chapter 'Writing R documentation' in manual 'Writing R Extensions'.
es: Consulte el capítulo 'Writing R documentation' en el manual 'Writing R Extensions'.

source: missing/empty \title field in '%s'
es: campo \title faltante/vacío en '%s'

source: Rd files must have a non-empty \title.
es: Los archivos Rd deben tener un campo \title que no vacío.

source: argument 'outFile' must be a character string or connection
es: el argumento 'outFile' debe ser una cadena de caracteres o una conexión

source: you must specify 'dir' or 'files'
es: debes especificar 'dir' o 'files'

source: cannot deal with Rd objects with missing/empty names
es: no se pueden manejar objetos Rd con nombres faltantes o vacíos

source: No help on %s found in RdDB %s
es: No hay ayuda sobre %s encontrada en RdDB %s

source: 'macros' must be TRUE or must specify existing macros
es: 'macros' debe ser TRUE o debe especificar macros existentes

source: Macro file %s should only contain Rd macro definitions and comments
es: El archivo de macro %s solo debe contener definiciones y comentarios de macro Rd

source: Rd macro package '%s' is not installed.
es: El paquete de macros '%s' no está instalado.

source: No Rd macros in package '%s'.
es: No hay macros Rd en el paquete '%s'.

source: links not supported for 'standalone = FALSE' when _R_HELP_LINKS_TO_TOPICS_=false
es: enlaces no admitidos para 'standalone = FALSE' cuando _R_HELP_LINKS_TO_TOPICS_=false

source: more than one \examples section, using the first
es: más de una sección \examples, usando la primera

source: is not one line
es: no es una línea

source: Converting Rd files to LaTeX ...
es: Convirtiendo archivos Rd a LaTeX...

source: -t option without value
es: opción -t sin valor

source: -o option without value
es: opción -o sin valor

source: Warning: unknown option
es: Advertencia: opción desconocida

source: exactly one Rd file must be specified
es: se debe especificar exactamente un archivo Rd

source: no 'type' specified
es: no se ha especificado ningún 'type'

source: 'type' must be one of 'txt', 'html', 'latex' or 'example'
es: 'type' debe ser uno de 'txt', 'html', 'latex' o 'example'

source: current working directory cannot be ascertained
es: no se puede determinar el directorio de trabajo actual

source: no inputs
es: sin entradas

source: Error in running tools::texi2pdf()
es: Error al ejecutar tools::texi2pdf()

source: invalid value for '%s' : %s
es: valor no válido para '%s': %s

source: Only one Rd section per %s is supported.
es: Solo se admite una sección Rd por %s.

source: DESCRIPTION file is for package '%s', not '%s'
es: El archivo DESCRIPTION es para el paquete '%s', no para '%s'

source: Vignette product %s does not have a known filename extension (%s)
es: producto de viñeta %s no tiene una extensión de nombre de archivo conocida (%s)

source: Failed to locate %s output file %s or %s for vignette with name %s and engine %s. The following files exist in working directory %s: %s
es: Error al localizar archivo de salida (%s) %s o %s para la viñeta con el nombre %s y el motor %s. Los siguientes archivos existen en el directorio de trabajo %s: %s

source: Located more than one %s output file (by engine %s) for vignette with name %s: %s
es: Se ubicó más de un archivo de salida %s (por motor %s) para la viñeta con nombre %s: %s

source: Failed to locate %s output file %s for vignette with name %s and engine %s. The following files exist in working directory %s: %s
es: Error al localizar archivo de salida (%s) %s para la viñeta con nombre %s y motor %s. Los siguientes archivos existen en el directorio de trabajo %s: %s

source: unable to create temp directory %s
es: no se puede crear el directorio temporal %s

source: Vignette '%s' is non-ASCII but has no declared encoding
es: La viñeta '%s' no es ASCII pero no tiene codificación declarada

source: Running
es: Ejecutando

source: Vignette %s overwrites the following %s output by vignette %s: %s
es: La viñeta %s sobrescribe la siguiente salida %s de la viñeta %s: %s

source: Detected vignette source files (%s) with shared names (%s) and therefore risking overwriting each other's output files
es: Se detectaron archivos fuente de viñeta (%s) con nombres compartidos (%s) y, por tanto, sus archivos de salida con riesgo de sobrescribirse el uno al otro

source: Note: skipping %s
es: Nota: omitiendo %s

source: Error: Vignette '%s' is non-ASCII but has no declared encoding
es: Error: La viñeta '%s' no es ASCII pero no tiene codificación declarada

source: --- re-building %s using %s
es: --- reconstruyendo %s usando %s

source: Error: processing vignette '%s' failed with diagnostics: %s
es: Error: falló el procesamiento de la viñeta '%s' con el diagnóstico: %s

source: Error: tangling vignette '%s' failed with diagnostics: %s
es: Error: Falló la intercalación de la viñeta '%s' con el diagnóstico: %s

source: --- finished re-building %s
es: --- terminada la reconstrucción %s

source: --- failed re-building %s
es: --- reconstrucción fallida de %s

source: running 'make' failed
es: Fallo al ejecutar 'make'

source: file '%s' not found
es: archivo '%s' no encontrado

source: vignette filename '%s' does not match any of the '%s' filename patterns
es: el nombre de archivo de la viñeta '%s' no coincide con ninguno de los patrones de nombre de archivo '%s'

source: In '%s' vignettes '%s' and '%s' have the same vignette name
es: En las viñetas '%s', '%s' y '%s' tienen el mismo nombre de viñeta

source: Vignette engine package not specified
es: Paquete de motor viñeta no especificado

source: Unsupported engine name
es: Nombre de motor no admitido

source: Vignette engine %s is not registered
es: El motor de viñetas %s no está registrado

source: Vignette engine %s is not registered by any of the packages %s
es: El motor de viñeta %s no está registrado en ninguno de los paquetes %s

source: Engine name %s and package %s do not match
es: El nombre del motor %s y el paquete %s no coinciden

source: Argument %s must be a function and not %s
es: El argumento %s debe ser una función y no %s

source: Argument %s must be a character vector or NULL and not %s
es: El argumento %s debe ser un vector de caracteres o NULL y no %s

source: Cannot change the %s engine or use an engine of that name
es: No se puede cambiar el motor %s ni usar un motor con ese nombre

source: vignette builder '%s' not found
es: generador de viñetas '%s' no encontrado

source: Invalid DESCRIPTION file
es: Archivo DESCRIPTION no válido

source: *** someone has corrupted the Built field in package '%s' ***
es: *** alguien ha dañado el campo Built en el paquete '%s' ***

source: cannot open directory '%s'
es: no se puede abrir el directorio '%s'

source: WARNING: omitting pointless dependence on 'R' without a version requirement
es: AVISO: se omite la dependencia inútil de 'R' sin un requisito de versión

source: cannot turn off locale-specific sorting via LC_COLLATE
es: no se puede desactivar la clasificación específica de la configuración regional mediante LC_COLLATE

source: duplicated files in '%s' field:
es: archivos duplicados en el campo '%s':

source: files in '%s' field missing from '%s':
es: faltan archivos en el campo '%s' de '%s':

source: files in '%s' missing from '%s' field:
es: faltan archivos en '%s' en el campo '%s':
