Repository: daroczig/R-weblate-fork
Catalog: src/library/tools/po/R-*.po
Languages: es

source: unable to create '%s'
es: no se puede crear '%s'

source: unable to copy INDEX to '%s'
es: no se puede copiar INDEX a '%s'

source: cannot create directory '%s'
es: no se puede crear el directorio '%s'

source: processing %s
es: procesando %s

source: running %s on vignette '%s' failed with message: %s
es: Fallo al ejecutar %s en la viñeta '%s', mensaje: %s

source: compiling TeX file %s failed with message: %s
es: Fallo al compilar el archivo TeX %s, mensaje: %s

source: cannot copy '%s' to '%s'
es: no se puede copiar '%s' a '%s'

source: WARNING: malformed 'Depends' field in 'DESCRIPTION'
es: AVISO: campo 'Depends' con formato incorrecto en 'DESCRIPTION'

source: ERROR: this R is version %s, package '%s' requires R %s %s
es: ERROR: esta es la versión %s de R, el paquete '%s' requiere R %s %s

source: ERROR: this R is version %s, required is R %s %s
es: ERROR: estaes la versión %s de R, se requiere R %s %s

source: loading failed
es: la carga falló

source: Got %s in evaluating %s; wanted %s
es: Se obtuvo %s al evaluar %s; se buscaba %s

source: Failed to get %s in evaluating %s
es: No se pudo obtener %s al evaluar %s

source: Failed to get error in evaluating %s
es: No se pudo obtener error al evaluar %s

source: Got warning in evaluating %s, but also an error
es: Se obtuvo una advertencia (warning) al evaluar %s, pero también un error

source: Changes require specified 'style'
es: Los cambios requieren especificar 'style'

source: The default JSS style may not be modified.
es: El estilo JSS predeterminado podría no modificarse.

source: ignored as vignettes have been rebuilt.
es: ignorado ya que las viñetas han sido reconstruidas.

source: Run R CMD build with --no-build-vignettes to prevent rebuilding.
es: Ejecute R CMD build con --no-build-vignettes para evitar la reconstrucción.

source: invalid value for '--compact-vignettes', assuming %s
es: valor no válido para '--compact-vignettes', asumiendo %s

source: Error: cannot rename directory to %s
es: Error: no se puede cambiar el nombre del directorio a %s

source: elapsed-time limit of %g %s reached for sub-process
es: se alcanzó el límite de tiempo %g %s para el subproceso

source: cannot link from %s
es: no se puede vincular desde %s

source: -l option without value
es: opción -l sin valor

source: configuration files are not supported as from R 2.12.0
es: los archivos de configuración no son compatibles a partir de R 2.12.0

source: '--multiarch' specified with only one usable sub-architecture
es: '--multiarch' especificado con una sola subarquitectura utilizable

source: '--as-cran' turns off '--extra-arch'
es: '--as-cran' desactiva '--extra-arch'

source: Error: no packages were specified
es: Error: no se especificaron paquetes

source: ERROR: cannot create check dir %s
es: ERROR: no se puede crear el directorio de verificación %s

source: package directory %s does not exist
es: el directorio del paquete %s no existe

source: no packages to check
es: no hay paquetes para revisar

source: 'reverse$repos' should be a subset of getOption("repos")
es: 'reverse$repos' debería ser un subconjunto de getOption("repos")

source: downloading reverse dependencies ...
es: descargando dependencias inversas...

source: downloading %s ...
es: descargando %s...

source: checking %s ...
es: comprobando %s...

source: wrong class
es: clase incorrecta

source: non-ASCII input in a CITATION file without a declared encoding
es: entrada no ASCII en un archivo CITATION sin codificación declarada

source: <p><code class='language-R'>%s</code> was run in the console.</p>
es: <p><code class='language-R'>%s</code> se ejecutó en la consola.</p>

source: <p>To view output in the browser, the <a href='https://CRAN.R-project.org/package=knitr'>knitr</a> package must be installed.</p>
es: <p>Para ver el resultado en el navegador, se debe instalar el paquete <a href='https://CRAN.R-project.org/package=knitr'>knitr</a>.</p>

source: <p>To view output in the browser, the <a href='https://CRAN.R-project.org/package=knitr'>knitr</a> package must be installed and the environment variable <code>_R_HELP_ENABLE_ENHANCED_HTML_</code> must be set to TRUE.</p>
es: <p>Para ver el resultado en el navegador, se debe instalar el paquete <a href='https://CRAN.R-project.org/package=knitr'>knitr</a> y la variable de entorno <code >_R_HELP_ENABLE_ENHANCED_HTML_</code> debe estar establecido en TRUE.</p>

source: No files in this directory
es: No hay archivos en este directorio

source: No results found
es: No se encontraron resultados

source: Vignettes:
es: Viñetas:

source: Code demonstrations:
es: Demostraciones de código:

source: Help pages:
es: Páginas de ayuda:

source: No package named %s could be found
es: No se pudo encontrar ningún paquete llamado %s

source: No help found for topic %s in any package.
es: No se encontró ayuda para el tema %s en ningún paquete.

source: No package index found for package %s
es: No se encontró ningún índice de paquete para el paquete %s

source: No help found for package %s
es: No se encontró ayuda para el paquete %s

source: Link %s in package %s could not be located
es: No se pudo localizar el enlace %s en el paquete %s

source: No docs found for package %s
es: No se encontraron documentos para el paquete %s

source: URL %s was not found
es: URL %s no fue encontrada

source: No NEWS found for package %s
es: No se encontraron NEWS para el paquete %s

source: Only help files, %s, %s and files under %s and %s in a package can be viewed
es: Solo se pueden ver los archivos de ayuda, %s, %s y los archivos bajo %s y %s en un paquete

source: unsupported URL %s
es: URL no admitida %s

source: httpd server disabled by R_DISABLE_HTTPD
es: servidor httpd deshabilitado por R_DISABLE_HTTPD

source: server already running
es: servidor ya está en ejecución

source: server could not be started on an earlier attempt
es: el servidor no pudo iniciarse en un intento anterior

source: no running server to stop
es: no hay ningún servidor en ejecución para detener

source: starting httpd help server ...
es: iniciando el servidor de ayuda httpd...

source: done
es: hecho

source: failed to start the httpd server
es: no se pudo iniciar el servidor httpd

source: * Package: %s
es: * Paquete: %s

source: cannot read index information in file '%s'
es: no se puede leer la información del índice en el archivo '%s'

source: .install_packages() exit status
es: estado de salida de .install_packages()

source: restoration failed
es: la restauración falló

source: invalid value
es: valor no válido

source: for R_CROSS_BUILD
es: para R_CROSS_BUILD

source: error reading file '%s'
es: error al leer el archivo '%s'

source: this seems to be a bundle -- and they are defunct
es: esto parece ser un bundle -- y están obsoletos

source: 'cleanup' exists but is not executable -- see the 'R Installation and Administration Manual'
es: 'cleanup' existe pero no es ejecutable; consulte 'R Installation and Administration Manual'

source: generating debug symbols (%s)
es: generando símbolos de depuración (%s)

source: no DLL was created
es: no se creó ninguna DLL

source: NOTE: fixed path
es: NOTA: ruta fija

source: NOTE: fixed library identification name
es: NOTA: nombre de identificación de biblioteca fijo

source: NOTE: fixed library path
es: NOTA: ruta de biblioteca fija

source: NOTE: fixed rpath
es: NOTA: ruta fija

source: WARNING: shared objects/dynamic libraries with hard-coded temporary installation paths
es: AVISO: objetos compartidos/bibliotecas dinámicas con rutas de instalación temporales escritas a mano

source: package %s successfully unpacked and MD5 sums checked
es: paquete %s descomprimido exitosamente y sumas MD5 verificadas

source: not using staged install with --libs-only
es: no usar instalación por etapas con --libs-only

source: staged installation is only possible with locking
es: la instalación por etapas sólo es posible con bloqueo

source: WARNING: installation-time patches will not be applied, could not get the patches index
es: AVISO: los parches en el momento de la instalación no se aplicarán, no se pudo obtener el índice de parches

source: patch utility is needed for installation-time patching
es: la utilidad patch es necesaria para aplicar parches durante la instalación

source: NOTE: Skipping installation-time patch
es: NOTA: Se omite el parche en el momento de la instalación

source: which seems to be already applied.
es: que parece ya estar aplicado.

source: WARNING: failed to apply patch
es: AVISO: no se pudo aplicar el parche

source: Applied installation-time patch
es: Se aplicó un parche de tiempo de instalación

source: and saved it as
es: y se guardó como

source: in package installation
es: en la instalación del paquete

source: R include directory is empty -- perhaps need to install R-devel.rpm or similar
es: El directorio 'include' de R está vacío; quizás sea necesario instalar R-devel.rpm o similar

source: package %s %s was found, but %s %s is required by %s
es: Se encontró el paquete %s %s, pero %s %s es requerido por %s

source: no source files found
es: no se encontraron archivos fuente

source: empty 'data' directory
es: directorio 'data' vacío

source: WARNING: moving package to final location failed, copying instead
es: AVISO: fallo al mover el paquete a la ubicación final, en cambio, fue copiado

source: cannot create unique directory for build
es: no se puede crear un directorio único para la compilación

source: cannot create temporary directory
es: no se puede crear un directorio temporal

source: ERROR: '--merge-multiarch' applies only to a single tarball
es: ERROR: '--merge-multiarch' se aplica solo a un único tarball

source: invalid package
es: paquete no válido

source: ERROR: no packages specified
es: ERROR: no se especificaron paquetes

source: ERROR: cannot cd to directory %s
es: ERROR: no se puede acceder al directorio %s

source: ERROR: no permission to install to directory
es: ERROR: no hay permiso para instalar en el directorio

source: building a fake installation is disallowed
es: no se permite construir una instalación fake

source: using C compiler:
es: usando el compilador de C:

source: using Fortran compiler:
es: usando el compilador Fortran:

source: using C++ compiler:
es: usando el compilador C++:

source: using C++
es: usando C++

source: using SDK:
es: usando SDK:

source: WARNING: failed to revert patch
es: AVISO: no se pudo revertir el parche

source: Reverted installation-time patch
es: Parche de tiempo de instalación revertido

source: See %s for details.
es: Ver %s para más detalles.

source: namespace must not be already loaded
es: el espacio de nombres no debe estar previamente cargado

source: all packages should have a NAMESPACE
es: todos los paquetes deben tener un NAMESPACE

source: package seems to be using lazy loading for data already
es: el paquete ya parece estar usando carga diferida (lazy) para los datos

source: source list must have names for all elements
es: la lista de fuentes debe tener nombres para todos los elementos

source: source must be an environment or a list
es: la fuente debe ser un entorno o una lista

source: this cannot be used for package 'base'
es: esto no se puede utilizar para el paquete 'base'

source: package contains no R code
es: el paquete no contiene código R

source: package seems to be using lazy loading already
es: el paquete parece ya estar usando carga diferida (lazy)

source: Cannot process chunk/lines: %s
es: No se pueden procesar fragmentos/líneas: %s

source: DESCRIPTION file not found
es: archivo DESCRIPTION no encontrado

source: NEWS file not found
es: Archivo NEWS no encontrado

source: No news found in given file using package default format.
es: No se encontraron noticias en el archivo dado usando el formato predeterminado del paquete.

source: Could not extract news from the following text chunks:
es: No se pudieron extraer noticias de los siguientes fragmentos de texto:

source: Chunk %s: %s
es: Parte %s: %s

source: Cannot extract version info from the following section titles: %s
es: No se puede extraer información de la versión de los siguientes títulos de sección: %s

source: Malformed NEWS.Rd file: Chunk starting %s contains no \itemize.
es: Archivo NEWS.Rd con formato incorrecto: El fragmento inicial %s no contiene \itemize.

source: Malformed NEWS.Rd file: Chunk starting %s contains more than one \itemize. Using the first one.
es: Archivo NEWS.Rd con formato incorrecto: El fragmento inicial %s contiene más de un \itemize. Usando el primero.

source: Malformed NEWS.Rd file: Chunk starting %s contains no \item.
es: Archivo NEWS.Rd con formato incorrecto: El fragmento inicial %s no contiene ningún \elemento.

source: Processing packages:
es: Paquetes de procesamiento:

source: Invalid DESCRIPTION file for package %s
es: Archivo DESCRIPTION no válido para el paquete %s

source: reading DESCRIPTION for package %s failed with message: %s
es: La lectura de DESCRIPTION del paquete %s falló con el mensaje: %s

source: unable to create temporary directory %s
es: no se puede crear el directorio temporal %s

source: expected one package directory, found %d.
es: se esperaba un directorio de paquetes, se encontró %d.

source: argument '%s' must be a character string or connection
es: el argumento '%s' debe ser una cadena de caracteres o una conexión

source: unimplemented encoding
es: codificación no implementada

source: this requires 'objdump.exe' to be on the PATH
es: esto requiere que 'objdump.exe' esté en PATH

source: this requires 'nm' to be on the PATH
es: esto requiere que 'nm' esté en PATH

source: Found %s, possibly from %s
es: Encontrado %s, posiblemente de %s

source: no native symbols were extracted
es: no se extrajeron símbolos nativos

source: not a PDF file
es: no es un archivo PDF

source: 'diff' is not available so useDiff = FALSE will be used
es: 'diff' no está disponible por lo que se utilizará useDiff = FALSE

source: testing '%s' failed
es: prueba fallida de '%s'

source: Testing examples for package %s
es: Ejemplos de prueba para el paquete %s

source: comparing %s to %s ...
es: comparando %s con %s...

source: NOTE
es: NOTA

source: results differ from reference results
es: los resultados difieren de los resultados de referencia

source: no examples found for package %s
es: no se encontraron ejemplos para el paquete %s

source: Running specific tests for package %s
es: Ejecutando pruebas específicas para el paquete %s

source: Running %s
es: Ejecutando %s

source: Running vignettes for package %s
es: Ejecutando viñetas para el paquete %s

source: Comparing %s to %s ...
es: Comparando %s con %s...

source: no parsed files found
es: no se encontraron archivos analizados

source: FAILED
es: FALLÓ

source: directory %s is not writeable
es: el directorio %s no se puede escribir

source: DIFFERED
es: DIFERIDO

source: running tests of random deviate generation (should no longer ever fail)
es: ejecutar pruebas de generación de desviación aleatoria (ya no debería fallar)

source: unknown header specification
es: especificación de encabezado desconocida

source: R CMD build failed
es: Falló la compilación R CMD

source: PACKAGES files do not include MD5 sums in the win.binary case
es: Los archivos PACKAGES no incluyen sumas MD5 en el caso win.binary

source: , so strict checking is impossible. Calling down to write_PACKAGES
es: , por lo que una verificación estricta es imposible. Llamando a write_PACKAGES

source: directly.
es: directamente.

source: No existing PACKAGES file found at
es: No se encontró ningún archivo PACKAGES existente en

source: Existing PACKAGES file contained no rows and/or no columns
es: El archivo PACKAGES existente no contenía filas ni columnas

source: Specified fields no present in existing PACKAGES file:
es: Los campos especificados no están presentes en el archivo PACKAGES existente:

source: Unable to update existing PACKAGES file. Calling write_PACKAGES directly.
es: No se puede actualizar el archivo PACKAGES existente. Llamando a write_PACKAGES directamente.

source: Updating existing repository [strict mode:
es: Actualizando el repositorio existente [modo estricto:

source: ] Detected PACKAGES file with
es: ] Archivo PACKAGES detectado con

source: entries at
es: entradas en

source: unable to find any package tarballs in
es: no se pueden encontrar ningún tarball de paquete en

source: All existing entry MD5sums match tarballs.
es: Todas las sumas MD5 de entrada existentes coinciden con los archivos comprimidos.

source: Found
es: Encontrado

source: package versions to process.
es: versiones del paquete para procesar.

source: No new packages or updated package versions detected
es: No se detectaron paquetes nuevos ni versiones actualizadas de paquetes

source: [dryrun mode] Dryrun complete.
es: [modo de ejecución dryrun] Ejecución dryrun completa.

source: Writing final updated PACKAGES files.
es: Escribir archivos PACKAGES actualizados finales.

source: update_PACKAGES complete.
es: update_PACKAGES completo.

source: '%s' must be a character string
es: ' %s' debe ser una cadena de caracteres

source: test '%s' is not available
es: la prueba '%s' no está disponible

source: argument 'x' must be a character vector
es: el argumento 'x' debe ser un vector de caracteres

source: argument 'delim' must specify two characters
es: el argumento 'delim' debe especificar dos caracteres

source: only Rd syntax is currently supported
es: actualmente solo se admite la sintaxis Rd

source: texi2dvi script/program not available, using emulation
es: script/programa texi2dvi no disponible, usando emulación

source: Running 'texi2dvi' on '%s' failed.
es: Error al ejecutar 'texi2dvi' en '%s'.

source: running 'texi2dvi' on '%s' failed
es: Error al ejecutar 'texi2dvi' en '%s'

source: unable to run %s on '%s'
es: no se puede ejecutar %s en '%s'

source: unable to run '%s' on '%s'
es: no se puede ejecutar '%s' en '%s'

source: File 'DESCRIPTION' is missing.
es: Falta el archivo 'DESCRIPTION'.

source: Files 'DESCRIPTION' and 'DESCRIPTION.in' are missing.
es: Faltan los archivos 'DESCRIPTION' y 'DESCRIPTION.in'.

source: invalid package layout
es: diseño de paquete no válido

source: *not* using 'C' for LC_COLLATE locale
es: *no* usando 'C' para la configuración regional LC_COLLATE

source: file '%s' is not in valid DCF format
es: el archivo '%s' no tiene un formato DCF válido

source: contains a blank line
es: contiene una línea en blanco

source: Unknown encoding with non-ASCII data: converting to ASCII
es: Codificación desconocida con datos no ASCII: se convierte a ASCII

source: cannot source package code:
es: no se puede hacer source() sobre el código del paquete:

source: inferior call failed
es: llamada inferior fallida

source: 'text' must be a character vector
es: 'text' debe ser un vector de caracteres

source: parsing '%s'
es: parseando '%s'

source: Undeclared package %s in Rd xrefs
es: Paquete no declarado %s en Rd xrefs

source: Package unavailable to check Rd xrefs: %s
es: Paquete no disponible para verificar Rd xrefs: %s

source: Unknown package %s in Rd xrefs
es: Paquete desconocido %s en Rd xrefs

source: Note: found %d marked Latin-1 string
es: Nota: se encontró %d cadena marcada como Latin-1

source: Note: found %d marked UTF-8 string
es: Nota: se encontró %d cadena marcada como UTF-8

source: Note: found %d string marked as "bytes"
es: Nota: se encontró %d cadena marcada como "bytes"

source: Warning in file %s:
es: Advertencia en el archivo %s:

source: Found possibly global 'T' or 'F' in the following function:
es: Se encontró posible 'T' o 'F' global en la siguiente función:

source: Found possibly global 'T' or 'F' in the examples of the following Rd file:
es: Se encontró posible 'T' o 'F' global en los ejemplos del siguiente archivo Rd:

source: Possibly missing '()' after 'return' in the following function:
es: Posiblemente falte '()' después de 'return' en la siguiente función:

source: Found a .Internal call in the following function:
es: Se encontró una llamada a .Internal en la siguiente función:

source: Found a.Internal call in methods for the following S4 generic:
es: Se encontró una llamada a .Internal en métodos para el siguiente genérico de S4:

source: Found a .Internal call in methods for the following reference class:
es: Se encontró una llamada a .Internal en métodos para la siguiente clase de referencia (refClass):

source: Found an obsolete/platform-specific call in the following function:
es: Se encontró una llamada obsoleta o específica de la plataforma en la siguiente función:

source: Found an obsolete/platform-specific call in methods for the following S4 generic:
es: Se encontró una llamada obsoleta o específica de la plataforma en métodos para el siguiente genérico de S4:

source: Found an obsolete/platform-specific call in methods for the following reference class:
es: Se encontró una llamada obsoleta o específica de la plataforma en métodos para la siguiente clase de referencia (refClass):

source: Found the deprecated function:
es: Se encontró la función obsoleta:

source: Found the defunct/removed function:
es: Se encontró la función obsoleta/eliminada:

source: Found the platform-specific device:
es: Se encontró el dispositivo específico de la plataforma:

source: Generic without any methods in %s: %s
es: Genérico sin ningún método en %s: %s

source: missing/empty \name field in Rd file %s
es: campo \name faltante/vacío en el archivo Rd %s

source: SUMMARY: processing the following file failed:
es: RESUMEN: falló el procesamiento del siguiente archivo:

source: unable to re-encode %s line %s
es: no se puede volver a codificar líneas en %s: %s

source: %s file
es: archivo de %s

source: Required field missing or empty:
es: Campo obligatorio faltante o vacío:

source: Help on topic '%s' was found in the following package:
es: Se encontró ayuda sobre el tema '%s' en el siguiente paquete:

source: object %s is created by more than one data call
es: el objeto %s es creado por más de una llamada de datos

source: %d of the package tests failed
es: %d de las pruebas del paquete fallaron

source: Corresponding BibTeX entry:
es: Entrada BibTeX correspondiente:
