Repository: daroczig/R-weblate-fork
Catalog: src/library/methods/po/R-*.po
Languages: es

source: OOPS: something wrong with '.OldClassesPrototypes[[%d]]'
es: OOPS: hubo algún error con '.OldClassesPrototypes[[%d]]'

source: unnamed argument to initialize() for S3 class must have a class definition; %s does not
es: Argumento no nombrado en initialize() para clase S3 debe tener una definición de clase; %s no tiene

source: unnamed argument must extend either the S3 class or the class of the data part; not true of class %s
es: argumento sin nombre debe extender la clase S3 o la clase de parte de los datos; no es el caso de clase %s

source: class %s does not have an S3 data part, and so is of type "S4"; no S3 equivalent
es: la clase %s no tiene una parte de datos S3, por lo que es de tipo "S4"; sin equivalente S3

source: class %s is VIRTUAL; not meaningful to create an S4 object from this class
es: la clase %s es VIRTUAL; no tiene sentido crear un objeto S4 a partir de esta clase

source: object must be a valid data part for class %s; not true of type %s
es: el objeto debe ser una parte de datos válida para la clase %s; no es cierto para el tipo %s

source: cannot specify matrix() arguments when specifying '.Data'
es: Los argumentos de matrix() no pueden especificarse cuando se especifica '.Datos'

source: cannot specify array() arguments when specifying '.Data'
es: No se pueden especificar argumentos array() cuando se especifica '.Datos'

source: cannot have more than one unnamed argument as environment
es: no puede tener más de un argumento sin nombre como entorno

source: unnamed argument to new() must be an environment for the new object
es: el argumento sin nombre de new() debe ser un entorno para el nuevo objeto

source: methods may not be defined for primitive function %s in this version of R
es: no es posible definir métodos para la función primitiva %s en esta versión de R

source: S3Part() is only defined for classes set up by setOldCLass(), basic classes or subclasses of these: not true of class %s
es: S3Part() sólo está definida para clases establecidas por setOldCLass(), clases base o subclases de las mismas: not true of class %s

source: the 'S3Class' argument must be a superclass of %s: not true of class %s
es: el argumento 'S3Class' debe ser una superclase de %s: no es cierto para la clase %s

source: replacement value must extend class %s, got %s
es: el valor de reemplazo debe extender la clase %s, se obtuvo %s

source: replacement value must be of class %s, got one of class %s
es: el valor de sustitución debe extender la clase %s, got %s

source: no 'replace' method was defined for 'as(x, "%s") <- value' for class %s
es: no se ha definido el método 'replace' para 'as(x, «%s») <- value' para la clase %s

source: the 'coerce' argument to 'setIs' should be a function of one argument, got an object of class %s
es: el argumento 'coerce' de 'setIs' debería ser una función de un solo argumento, obtenido un objeto de la clase %s

source: the computation: 'as(object,"%s") <- value' is valid when object has class %s only if 'is(value, "%s")' is TRUE ('class(value)' was %s)
es: el cálculo: 'as(object,«%s») <- valor' es válido cuando el objeto tiene clase %s solo si 'is(valor,«%s»)' es TRUE ('clase(valor)' era %s)

source: there is no automatic definition for 'as(object, "%s") <- value' when object has class %s and no 'replace' argument was supplied; replacement will be an error
es: sin definición automática para 'as(object, "%s") <- value' cuando el objeto es de clase %s y no se proporcionó argumento 'replace'; el reemplazo generará error

source: the 'replace' argument to setIs() should be a function of 2 or 3 arguments, got an object of class %s
es: el argumento 'replace' de setIs() debería ser una función de 2 o 3 argumentos, obteniendo un objeto de clase %s

source: the member classes must be defined: not true of %s
es: Las clases miembro deben estar definidas: no es cierto para %s

source: unable to create union class: could not set members %s
es: No se puede crear la clase de unión: no se pudieron establecer los miembros %s

source: methods:::bind_activation() is defunct; rather provide methods for cbind2() / rbind2()
es: methods:::bind_activation() está difunto; En su lugar, proporcione métodos para cbind2() / rbind2()

source: invalid argument 'name': %s
es: argumento no válido 'nombre': %s

source: %s dispatches internally; methods can be defined, but the generic function is implicit, and cannot be changed.
es: %s se despacha internamente; . . Los métodos se pueden definir, pero la función genérica está implícita y no se puede cambiar.

source: if the 'def' argument is supplied, it must be a function that calls standardGeneric("%s") or is the default
es: si se proporciona el argumento 'def', debe ser una función que llame a standardGeneric("%s") o sea el valor predeterminado

source: must supply a function skeleton for %s, explicitly or via an existing function
es: debe proporcionar un esqueleto de función para %s, explícitamente o a través de una función existente

source: Creating a generic function for %s from %s in %s (from the saved implicit definition)
es: Creación de una función genérica para %s a partir de %s en %s (a partir de la definición implícita guardada)

source: Creating a new generic function for %s in %s
es: Creación de una nueva función genérica para %s en %s

source: no generic version of %s on package %s is allowed; a new generic will be assigned for %s
es: no se permite ninguna versión genérica de %s en el paquete %s; Se asignará un nuevo genérico para %s

source: fdef appears to be a generic function, but with generic name %s instead of %s
es: fdef parece ser una función genérica, pero con el nombre genérico %s en lugar de %s

source: generic function %s not found for removal
es: Función genérica %s no encontrada para su eliminación

source: a function for argument 'f' must be a generic function
es: Una función para el argumento 'f' debe ser una función genérica

source: the environment %s is locked; cannot assign methods for function %s
es: el entorno %s está bloqueado; No se pueden asignar métodos para la función %s

source: the 'where' environment (%s) is a locked namespace; cannot assign methods there
es: el entorno 'where' (%s) es un espacio de nombres bloqueado; no se pueden asignar métodos allí

source: Copying the generic function %s to environment %s, because the previous version was in a sealed namespace (%s)
es: Copiar la función genérica %s en el entorno %s, ya que la versión anterior estaba en un espacio de nombres sellado (%s)

source: no existing definition for function %s
es: No existe una definición para la función %s

source: Creating a generic function from function %s in %s
es: Creación de una función genérica a partir de la función %s en %s

source: Creating a generic function for %s from package %s in %s
es: Creación de una función genérica para %s a partir del paquete %s en %s

source: the method for function %s and signature %s is sealed and cannot be re-defined
es: El método para la función %s y la firma %s está sellado y no se puede volver a definir

source: For function %s, signature %s: argument in method definition changed from (%s) to (%s)
es: Para la función %s, el argumento de firma %s: en la definición del método ha cambiado de (%s) a (%s)

source: primitive functions cannot be methods; they must be enclosed in a regular function
es: Las funciones primitivas no pueden ser métodos; Deben estar encerrados en una función regular

source: invalid method definition: expected a function, got an object of class %s
es: Definición de método no válida: se esperaba una función, se obtuvo un objeto de clase %s

source: function supplied as argument 'f' must be a generic
es: La función suministrada como argumento 'f' debe ser una función genérica

source: no generic function %s found
es: No se ha encontrado ninguna función genérica %s

source: no method found for function %s and signature %s
es: No se ha encontrado ningún método para la función %s y la firma %s

source: no environment or package corresponding to argument where=%s
es: ningún entorno o paquete que corresponda al argumento where=%s

source: no generic function found for '%s'
es: No se ha encontrado ninguna función genérica para '%s'

source: no method found for function '%s' and signature %s
es: no se ha encontrado ningún método para la función '%s' y la firma %s

source: 'file' must be a character string or a connection
es: 'file' debe ser una cadena de caracteres o una conexión

source: argument 'signature' is not meaningful with the current implementation and is ignored (extract a subset of the methods list instead)
es: El argumento 'signature' no tiene sentido con la implementación actual y se ignora (extraiga un subconjunto de la lista de métodos en su lugar)

source: no method for %s matches class %s
es: Ningún método para %s coincide con la clase %s

source: no method found for signature %s
es: No se encontró ningún método para la firma %s

source: %s has no methods defined
es: %s no tiene métodos definidos

source: bad class specified for element %d (should be a single character string)
es: Clase incorrecta especificada para el elemento %d (debe ser una cadena de un solo carácter)

source: first argument should be the names of one of more generic functions (got object of class %s)
es: El primer argumento debe ser el nombre de una de las funciones más genéricas (objeto GOT de la clase %s)

source: must supply 'generic.function' or 'class'
es: debe proporcionar 'generic.function' o 'class'

source: %s is not an S4 generic function in %s; methods not removed
es: %s no es una función genérica de S4 en %s; Métodos no eliminados

source: cannot remove methods for %s in locked environment/package %s
es: no se pueden eliminar los métodos para %s en el entorno/paquete bloqueado %s

source: Restoring default function definition of %s
es: Reestableciendo la definición de función predeterminada de %s

source: error in updating S4 generic function %s; the function definition is not an S4 generic function (class %s)
es: error al actualizar la función genérica S4 %s; la definición de la función no es una función genérica S4 (clase %s)

source: Function %s is already a group generic; no change
es: La función %s ya es un grupo genérico; Sin cambios

source: Function %s is a group generic; do not call it directly
es: La función %s es un grupo genérico; No lo llames directamente

source: callGeneric() must be called from within a method body
es: callGeneric() debe llamarse desde el cuerpo de un método

source: expected a non-empty character string for argument name
es: Se esperaba una cadena de caracteres no vacía para el nombre del argumento

source: generic function supplied was not created for %s
es: La función genérica proporcionada no se creó para %s

source: %s is a primitive function; its generic form cannot be redefined
es: %s es una función primitiva; Su forma genérica no puede ser redefinida

source: %s is not currently a generic: define it first to create a non-default implicit form
es: %s no es actualmente un genérico: defínalo primero para crear una forma implícita no predeterminada

source: must provide an environment table; got class %s
es: debe proporcionar una tabla de entorno; Obtuve la clase %s

source: original function is prohibited as a generic function
es: La función original está prohibida como función genérica

source: not both functions!
es: ¡No ambas funciones!

source: argument %s is not S4
es: El argumento %s no es S4

source: formal arguments differ (in default values?)
es: Los argumentos formales difieren (¿en los valores predeterminados?)

source: formal arguments differ: (%s), (%s)
es: Los argumentos formales difieren: (%s), (%s)

source: value classes differ: %s, %s
es: Las clases de valor difieren: %s, %s

source: signatures differ: (%s), (%s)
es: las firmas de método difieren: (%s), (%s)

source: package slots differ: %s, %s
es: Las ranuras de los paquetes difieren: %s, %s

source: groups differ: %s, %s
es: Los grupos difieren: %s, %s

source: generic names differ: %s, %s
es: Los nombres genéricos difieren: %s, %s

source: argument %s must be a generic function or a single character string; got an object of class %s
es: El argumento %s debe ser una función genérica o una cadena de caracteres únicos; Obtuve un objeto de clase %s

source: non-generic function '%s' given to findMethods()
es: función no genérica '%s' dada a findMethods()

source: only FALSE is meaningful for 'inherited', when 'where' is supplied (got %s)
es: solo FALSE es significativo para 'heredado', cuando se proporciona 'donde' (tiene %s)

source: argument 'f' must be a generic function or %s
es: El argumento 'f' debe ser una función genérica o %s

source: '%s' is not a known generic function {and 'package' not specified}
es: '%s' no es una función genérica conocida {y 'paquete' no se especifica}

source: invalid first argument: should be the name of the first argument in the dispatch
es: Primer argumento no válido: debe ser el nombre del primer argumento en el envío

source: duplicate element names in 'MethodsList' at level %d: %s
es: nombres de elementos duplicados en 'MethodsList' en el nivel %d: %s

source: element %d at level %d (class %s) cannot be interpreted as a function or named list
es: el elemento %d en el nivel %d (clase %s) no se puede interpretar como una función o una lista con nombre

source: arguments 'names' and 'signature' must have the same length
es: Los argumentos 'names' y 'signature' deben tener la misma longitud

source: inserting method with invalid signature matching argument '...' to class %s
es: insertando el método con el argumento de coincidencia de firma no válido '...' a la clase %s

source: inserting method corresponding to empty signature
es: Método de inserción correspondiente a la firma vacía

source: inserting method into non-methods-list object (class %s)
es: Insertar un método en un objeto que no es una lista de métodos (clase %s)

source: invalid method sublist
es: Sublista de métodos no válidos

source: %f is not a valid generic function: methods list was an object of class %s
es: %f no es una función genérica válida: la lista de métodos era un objeto de la clase %s

source: %s must be TRUE, FALSE, or a named logical vector of those values; got an object of class %s
es: %s debe ser TRUE, FALSE o un vector lógico con nombre de esos valores; se obtuvo un objeto de clase %s

source: default method must be a method definition, a primitive or NULL: got an object of class %s
es: el método predeterminado debe ser una definición de método, una primitiva o NULL: se obtuvo un objeto de clase %s

source: trying to match a method signature to an object (of class %s) that is not a generic function
es: se intenta buscar una firma de método coincidente con un objeto (de la clase %s) que no es una función genérica

source: invalid 'package' slot or attribute, wrong length
es: ranura o atributo 'package' no válido, longitud incorrecta

source: invalid element in a list for "signature" argument; element %d is neither a class definition nor a class name
es: elemento no válido en una lista para el argumento "firma"; El elemento %d no es ni una definición de clase ni un nombre de clase

source: trying to match a method signature of class %s; expects a list or a character vector
es: intentar hacer coincidir una firma de método de la clase %s; espera una lista o un vector de caracteres

source: object to use as a method signature for function %s does not look like a legitimate signature (a vector of single class names): there were %d class names, but %d elements in the signature object
es: el objeto que se va a utilizar como firma de método para la función %s no parece ser una firma de método legítima (un vector de nombres de clase únicos): el objeto de firma contenía %d nombres de clase, pero %d elementos

source: more elements in the method signature (%d) than in the generic signature (%d) for function %s
es: Más elementos en la signatura del método (%d) que en la signatura genérica (%d) para la función %s

source: no generic function found corresponding to %s
es: No se ha encontrado ninguna función genérica que corresponda a %s

source: skipping methods list element %s of unexpected class %s
es: omitiendo el elemento %s, de clase inesperada %s, de la lista de métodos

source: %s, along with other use of the "MethodsList" metadata objects, is deprecated.
es: %s, junto con otros usos de los objetos de metadatos "MethodsList", es obsoleto.

source: In %s: use of "MethodsList" metadata objects is deprecated.
es: En %s: el uso de objetos de metadatos "MethodsList" está en desuso.

source: Use %s instead.
es: En su lugar, use %s.

source: %s, along with other use of the "MethodsList" metadata objects, is defunct.
es: %s, junto con otros usos de los objetos de metadatos "MethodsList", ha desaparecido.

source: In %s: use of "MethodsList" metadata objects is defunct.
es: En %s: el uso de objetos de metadatos "MethodsList" ha desaparecido.

source: invalid object for formal method definition: type %s
es: Objeto no válido para la definición del método formal: tipo %s

source: missing package slot (%s) in object of class %s (package info added)
es: Falta la ranura de paquete (%s) en el objeto de la clase %s (se agregó información del paquete)

source: 'initialize' method returned an object of class %s instead of the required class %s
es: El método 'initialize' devolvió un objeto de la clase %s en lugar de la clase requerida %s

source: %d: target "%s": chose "%s" (others: %s)
es: %d: objetivo "%s": elige "%s" (otros: %s)

source: Notes: %s.
es: Notas: %s.

source: class generator function for class %s from package %s
es: función generadora de clase para la clase %s del paquete %s

source: the names in signature for method (%s) do not match %s's arguments (%s)
es: Los nombres de la firma del método (%s) no coinciden con los argumentos de %s (%s)

source: the names in signature for method (%s) do not match function's arguments (%s)
es: Los nombres de la firma del método (%s) no coinciden con los argumentos de la función (%s)

source: a call to callNextMethod() appears in a call to %s, but the call does not seem to come from either a generic function or another 'callNextMethod'
es: aparece una llamada a callNextMethod() en una llamada a %s, pero la llamada no parece provenir de una función genérica ni de otro 'callNextMethod'

source: call to 'callNextMethod' does not appear to be in a 'method' or 'callNextMethod' context
es: La llamada a 'callNextMethod' no parece estar en un contexto de 'method' o 'callNextMethod'

source: bad object found as method (class %s)
es: Objeto malo encontrado como método (Clase %s)

source: No next method available
es: No hay ningún método siguiente disponible

source: in constructing the prototype for class %s: prototype has class %s, but the data part specifies class %s
es: Al construir el prototipo para la clase %s: el prototipo tiene la clase %s, pero la parte de datos especifica la clase %s

source: in constructing the prototype for class %s, slots in prototype and not in class: %s
es: al construir el prototipo para la clase %s, ranuras en el prototipo y no en la clase: %so

source: in making the prototype for class %s elements of the prototype failed to match the corresponding slot class: %s
es: Al hacer el prototipo para la clase %s, los elementos del prototipo no coincidían con la clase de ranura correspondiente: %s

source: potential cycle in class inheritance: %s has duplicates in superclasses and subclasses (%s)
es: Ciclo potencial en la herencia de clases: %s tiene duplicados en superclases y subclases (%s)

source: undefined slot classes in definition of %s: %s
es: clases de ranuras no definidas en la definición de %s: %s

source: (class %s)
es: (clase %s)

source: in definition of class %s, information for superclass %s is of class %s (expected "SClassExtension")
es: en la definición de la clase %s, la información para la superclase %s es de la clase %s (esperada "SClassExtension")

source: class %s extends an undefined class, %s
es: class %s extiende una clase indefinida, %s

source: 'Class' must be a valid class definition or class
es: 'Class' debe ser una definición de clase o clase válida

source: trying to assign an object of class %s as the definition of class %s: must supply a "classRepresentation" object
es: intentar asignar un objeto de clase %s como la definición de clase %s: debe proporcionar un objeto "classRepresentation"

source: assigning as %s a class representation with internal name %s
es: Asignar como %s una representación de clase con nombre interno %s

source: class %s has a locked definition in package %s
es: La clase %s tiene una definición bloqueada en el paquete %s

source: 'externalptr' objects cannot be initialized from new()
es: Los objetos 'externalptr' no se pueden inicializar desde new()

source: initializing objects from class %s with these arguments is not supported
es: No se admite la inicialización de objetos de clase %s con estos argumentos

source: in defining class %s, the supplied data part class, %s is not valid (must be a basic class or a virtual class combining basic classes)
es: Al definir la clase %s, la clase de parte de datos proporcionada, %s no es válida (debe ser una clase básica o una clase virtual que combine clases básicas)

source: no definition was found for superclass %s in the specification of class %s
es: No se encontró ninguna definición para la superclase %s en la especificación de la clase %s

source: conflicting definition of data part: .Data = %s, superclass implies %s
es: Definición contradictoria de la parte de datos: . Datos = %s, la superclase implica %s

source: a prototype object was supplied with object slot of class %s, but the class definition requires an object that is class %s
es: se proporcionó un prototipo con un slot de clase de objeto %s, pero la definición de la clase requiere un objeto de clase %s

source: a prototype was supplied of class %s, but the class definition requires an object that is class %s
es: se proporcionó un prototipo de clase %s pero la definición de la clase requiere un objeto de clase %s

source: Definition of slot %s, in class %s, as %s conflicts with definition, inherited from class %s, as %s
es: la definición del slot %s, en la clase %s, como %s está en conflicto con la definición heredada de la clase %s, como %s

source: class %s extends an undefined class (%s)
es: la clase %s extiende una clase no definida (%s)

source: The prototype for class %s has undefined slot(s): %s
es: el prototipo para la clase %s tiene slot(s) no definidos: %s

source: %s is not eligible to be the data part of another class (must be a basic class or a virtual class with no slots)
es: %s no se puede elegir como la parte de datos (.Data) de otra clase (debe ser una clase base o una clase virtual sin slots)

source: prototype is a list with named elements (could be ambiguous): better to use function prototype() to avoid trouble.
es: el prototipo es una lista de elementos con nombre (puede ser ambiguo): es mejor usar prototype() para evitar problemas.

source: the '%s' list for class %s, includes an undefined class %s
es: la lista '%s' para la clase %s incluye una clase no definida %s

source: class %s is inheriting an inconsistent superclass structure from class %s, inconsistent with %s
es: la clase %s hereda una estructura de superclase inconsistente de la clase %s, inconsistente con %s

source: unable to find a consistent ordering of superclasses for class %s: order chosen is inconsistent with the superclasses of %s
es: imposible hallar un ordenamiento consistente de superclases para la clase %s: el orden elegido no es consistente con las superclases de %s

source: "class" is a reserved slot name and cannot be redefined
es: "class" es un nombre de slot reservado y no puede ser redefinido
