Repository: daroczig/R-weblate-fork
Catalog: src/library/methods/po/R-*.po
Languages: es

source: invalid S4 class corresponding to S3 class: slots in S4 version must extend corresponding slots in S3 version: fails for %s
es: clase S4 no válida correspondiente a una clase S3: los slots en la versión S4 deben extender a los slots correspondientes en la versión S3: no se cumple en %s

source: explicit coercion of old-style class (%s) is not defined
es: conversión explícita de clase de viejo estilo (%s) no está definida

source: explicit replacement not defined for as(x, "%s") <- value for old-style class %s
es: reemplazo explícito no definido para as(x, "%s") <- value, para clase de viejo estilo %s

source: argument 'Classes' must be a vector of two classes; got an argument of length %d
es: el argumento 'Classes' debe ser un vector de dos clases; se obtuvo un argumento de longitud %d

source: inconsistent old-style class information for %s (maybe mixing old and new classes?)
es: información de clase de viejo estilo es inconsistente para %s (¿quizá se mezclas clases de viejo y nuevo estilo?)

source: 'S3Class' only defined for extensions of %s or classes with a data part: not true of class %s
es: 'S3Class' solo se define para extensiones de %s o clases con parte de datos (.Data): no se cumple en los de clase %s

source: 'S3Class' can only assign to S4 objects that extend "oldClass"; not true of class %s
es: 'S3Class' solo puede asignar a objetos S4 que extienden "oldClass"; no se cumple en los de clase %s

source: Created a package name, %s, when none found
es: Se creó un nombre de paquete, %s, cuando ninguno fue encontrado

source: no definition of class %s found
es: no se encontró definición de clase %s

source: multiple definitions of %s found; using the one on %s
es: se encontraron múltiples definiciones de %s; se usa la de %s

source: %s is not a valid field or method name for reference class %s
es: %s no es un campo o nombre de método válido en la clase de referencia %s

source: a call to superClass() is in the method %s but there is no superclass definition of this method for class %s
es: hay un llamado a superClass() en el método %s, pero no hay definición de superclase de este método para la clase %s

source: methods declared in usingMethods() but not found: %s
es: métodos declarados en usingMethods(), pero no hallados: %s

source: %s is not a reference class
es: %s no es una clase de referencia

source: %s is not a field in class %s
es: %s no es un campo de la clase %s

source: unnamed arguments to $new() must be objects from a reference class; got an object of class %s
es: los argumentos sin nombre en $new() deben ser objetos de una clase de referencia; se obtuvo un objeto de clase %s

source: %s is not a valid field or method name for this class
es: %s no es un campo válido o nombre de método para esta clase

source: the class of field %s in the object is not compatible with the desired class %s in the target
es: la clase del campo %s en el objeto no es compatible con la clase %s que se buscaba en el objetivo

source: %s is not a defined class in this environment
es: %s no es una clase definida en este entorno

source: invalid 'Class' argument: should be a single string
es: argumento 'Class' no válido: debe ser una cadena simple

source: %s is not one of the reference super classes for this object
es: %s no es una de las superclases de referencia para este objeto

source: direct calls to callSuper() are invalid: should only be called from another method
es: no son válidos los llamados directos a callSuper(): solo debería llamarse desde otro método

source: %s is not a field in this class
es: %s no es un campo en esta clase

source: Methods not found: %s
es: No se encontraron los métodos: %s

source: the definition of class %s in package %s is locked, methods may not be redefined
es: la definición de clase %s en el paquete %s está bloqueada, quizá los métodos no puedan redefinirse

source: arguments to methods() must be named, or one named list
es: los argumentos dados a 'methods()' deben ser con nombre, o una lista con nombres

source: topic %s is not a method name in class %s The class definition follows
es: 'topic' no es un nombre de método en la clase %s Lo que sigue es la definición de la clase

source: the definition of class %s in package %s is locked so fields may not be modified
es: la definición de la clase %s en el paquete %s está bloqueada, por lo que los campos no podrán modificarse

source: the overriding class ("%s") of field %s is not a subclass of the existing field definition ("%s")
es: la clase ("%s") que redefine al campo %s no es una subclase de la actual definición del campo ("%s")

source: invalid assignment for reference class field %s, should be from class %s or a subclass (was class %s)
es: asignación no válida para la clase de referencia %s, debería ser de clase %s o una subclase (se obtuvo clase %s)

source: invalid replacement: reference class field %s is read-only
es: reemplazo no válido: el campo de la clase de referencia %s es de solo lectura

source: the 'contains' argument should be the names of superclasses: got an element of class %s
es: el argumento 'contains' debe consistir en nombres de superclases: se obtuvo un elemento de clase %s

source: no definition found for inherited class: %s
es: no se encontró una definición para la clase heredada: %s

source: a single class name is needed for field %s, got a character vector of length %d
es: se requiere un único nombre de clase para el campo %s, se obtuvo un vector de caracteres de longitud %d

source: class %s for field %s is not defined
es: la clase %s para el campo %s no está definida

source: field %s was supplied as an object of class %s; must be a class name or a binding function
es: el campo %s fue proporcionado como un objeto de clase %s; debe ser una nombre de clase o una función a la que vincularlo

source: code for methods in class %s was not checked for suspicious field assignments (recommended package %s not available?)
es: el código para los métodos en la clase %s no se verificó en busca de asignaciones de campo sospechosas (¿está disponible el paquete recomendado %s?)

source: class %s is defined but is not a reference class
es: la clase %s está definida, pero no es una clase de referencia

source: class must be a reference class representation or a character string; got an object of class %s
es: la clase debe ser la representación de una clase de referencia o una cadena de caracteres; se obtuvo un objeto de clase %s

source: not a reference class: %s
es: no es una clase de referencia: %s

source: local assignment to field name will not change the field: %s Did you mean to use "<<-"? ( in method %s for class %s)
es: asignación local a nombre de campo no cambiará el campo: %s ¿quizá su intención era usar "<<-"? ( en el método %s para la clase %s )

source: non-local assignment to non-field names (possibly misspelled?) %s ( in method %s for class %s)
es: asignación no local (<<-) para nombre(s) que no son de campo (¿quizá un error de ortografía?) %s ( en el método %s para la clase %s )

source: non-local assignment to method names is not allowed %s ( in method %s for class %s)
es: no se permite asignación no local (<<-) para nombres de método %s ( en el método %s para la clase %s )

source: arguments must all be character string names of fields
es: todos los argumentos deben ser nombres de campos dados como cadenas de caracteres

source: field %s is already locked
es: el campo %s ya había sido bloqueado

source: field %s of class %s has a non-default binding and cannot be locked
es: el campo %s de la clase %s tiene una vínculo activo que no es el predeterminado, y no puede ser bloqueado

source: Reference superclasses must come from the same package for the environment to be defined: got %s and %s
es: Las superclases de referencia deben provenir del mismo paquete para que el entorno pueda definirse: se obtuvo %s y %s

source: Class %s is not a subclass of %s; functional semantics not defined for this class
es: La clase %s no es una subclase de %s; la semántica funcional no está definida para esta clase

source: Could not find local object in supplied environment
es: No se puede encontrar un objeto local en el entorno proporcionado

source: invalid 'ignore' argument; should be a class definition or a character vector, got an object of class %s
es: argumento 'ignore' no válido; debe ser una definición de clase o un vector de caracteres, se obtuvo un objeto de clase %s

source: An object of class %s
es: Un objeto de clase %s

source: invalid call to 'classLabel': expected a name or a class definition, got an object of class %s
es: llamado a 'classLabel' no válido: se esperaba un nombre o una definición de clase, se obtuvo un objeto de clase %s

source: argument 'signature' is not meaningful for tracing reference methods
es: el argumento 'signature' no tiene sentido para traza de depuración en métodos de referencia

source: %s is not a method for reference class %s
es: %s no es un método para la clase de referencia %s

source: argument 'what' should be the name of a function
es: el argumento 'what' debe ser el nombre de una función

source: tracing the internal function %s is not allowed
es: no se permite la traza de depuración en la función interna %s

source: no function definition for %s found
es: no se encontró definición para la función %s

source: cannot untrace method for %s; no method defined for this signature: %s
es: no se puede desactivar traza de depuración para el método %s; no hay método definido para esta firma: %s

source: the method for %s for this signature was not being traced
es: el método para %s para esta firma no está siendo trazado para depuración

source: making a traced version of a special; arguments may be altered
es: creando una versión con traza de depuración para una función 'special'; los argumentos podrían alterarse

source: the editing in trace() can only change the body of the function; got an object of class %s
es: la edición en trace() solo puede cambiar el cuerpo de la función; se obtuvo un objeto de clase %s

source: the editing in trace() can only change the body of the function, not the arguments or defaults
es: la edición en trace() solo puede cambiar el cuerpo de una función, no los argumentos o los valores por defecto

source: cannot use 'at' argument without a trace expression
es: no se puede usar el argumento 'at' sin una expresión para traza de depuración

source: cannot use 'at' argument unless the function body has the form '{ ... }'
es: no se puede usar el argumento 'at' salvo que el cuerpo de la función tenga la forma '{...}'

source: assigning over the binding of symbol %s in environment/package %s
es: asignando sobre el vínculo activo del símbolo %s en el entorno o paquete %s

source: setting a method over the binding of symbol %s in environment/package %s
es: estableciendo un método sobre el vínculo activo del símbolo %s en el entorno o paquete %s

source: Environment of class %s is locked; using global environment for new class
es: El entorno de clase %s está bloqueado; se usa el entorno global para la nueva clase

source: none of the objects in the source code could be found: need to attach or specify the package
es: no pudo encontrarse ninguno de los objetos en el código fuente: debe especificar o adjuntar el paquete

source: objects found in multiple packages: using %s and ignoring %s
es: se encontraron los objetos en múltiples paquetes: se usa(n) %s y se ignora(n) %s

source: package %s is not attached and no namespace found for it
es: el paquete %s no está adjunto y no se encontró un espacio de nombres para el mismo

source: invalid 'source' argument: expected file names or a connection but got an object of class %s
es: argumento 'source' no válido: se esperaban nombres de archivo o una conexión; se obtuvo un objeto de clase %s

source: cannot find an environment corresponding to package name '%s"
es: no se puede encontrar un entorno correspondiente al nombre de paquete "%s"

source: supplied package, %s, differs from package inferred from source, %s
es: el paquete proporcionado, %s, difiere del paquete inferido del código fuente, %s

source: cannot insert these (not found in source): %s
es: no se pueden insertar los siguientes (no se encontraron en código fuente): %s

source: cannot insert methods for these functions (methods table not found in source): %s
es: no se pueden insertar métodos para estas funciones (no se encontró la tabla de métodos en el código fuente): %s

source: Non-function objects are not currently inserted (not traceable): %s
es: Actualmente no se insertan los objetos que no son funciones (no son trazables): %s

source: New functions are not currently inserted (not untraceable): %s
es: Actualmente no se insertan las nuevas funciones (no son des-trazables): %s

source: Modified functions inserted through trace(): %s
es: Funciones modificadas insertadas mediante trace(): %s

source: %s() is not a generic function in the target environment -- methods will not be inserted
es: %s() no es una función genérica en el entorno objetivo -- los métodos no serán insertados

source: Methods inserted for function %s(): %s
es: Métodos insertados para la función %s(): %s

source: no definition for object %s found in tracing environment
es: no se encontró definición para el objeto %s en el entorno con traza de depuración

source: multiple generics match pattern, using table %s
es: múltiples genéricos coinciden con el patrón, se usa la tabla %s

source: does not seem to be a method table for generic %s in tracing environment
es: al parecer, no hay una tabla de métodos para el genérico %s en el entorno con traza de depuración

source: no method in methods table for %s for signature %s
es: no se encontraron métodos en la tabla de métodos para %s con la firma %s

source: unloading 'methods' package ...
es: desvinculando el paquete 'methods' ...

source: apparently bad method or class metadata in saved environment;
es: metadatos de clase o de método aparentemente erróneos en el entorno guardado;

source: move the file or remove the class/method
es: mueva el archivo o elimine la clase o método

source: no definition for class %s
es: sin definición para la clase %s

source: in the method signature for function %s invalid argument name in the signature: %s
es: en la firma de método para la función %s, nombre de argumento no válido en la firma: %s

source: Reported %d ambiguous selection out of %d for function %s
es: Se reportó %d selección ambigua de un total de %d para la función %s

source: named elements of prototype do not correspond to slot name: %s
es: los elementos con nombre del prototipo no corresponden al nombre de slot: %s

source: non-argument found in the signature: %s
es: se encontró un elemento que no es un argumento en la firma de método: %s

source: the formal argument of the generic function for %s (%s) differs from that of the non-generic to be used as the default (%s)
es: el argumento formal para la función genérica para %s (%s) difiere del de la no genérica para usarse como valor por defecto (%s)

source: duplicated slot name: %s
es: nombre de slot duplicado: %s

source: invalid name for slot of class %s: %s
es: nombre de slot de clase %s no válido: %s

source: multiple definition of class %s visible (%s); using the definition in package %s for %s
es: múltiple definición de la clase %s visible (%s); se usa la definición en el paquete %s para %s

source: class %s is missing slot from class %s (%s), and no coerce method was supplied
es: en la clase %s falta un slot de la clase %s (%s), y no se proporcionó un método 'coerce'

source: slot in class %s must extend corresponding slot in class %s: fails for %s
es: el slot en la clase %s debe extender al slot correspondiente en la clase %s: no se cumple para %s

source: found %d equally good next method
es: se encontró %d siguiente método igualmente bueno

source: Selecting %d method of minimum distance
es: Seleccionando % método de distancia mínima

source: Selecting %d non-group method
es: Seleccionando %d método que no es de grupo

source: Selecting %d partially exact-matching method
es: Seleccionando %d método de coincidencia parcialmente exacta

source: Choosing method %s from %d ambiguous possibility
es: Se elige el método %s de %d posibilidad ambigua

source: no definition of class %s in the specified position, %s, definition on : %s
es: no se encontró definición de clase %s en la posición especificada, %s, definición en : %s
