Repository: daroczig/R-weblate-fork
Catalog: src/library/methods/po/R-*.po
Languages: es

source: Data part is undefined for general S4 object
es: parte de datos (Data part, .Data) no está definido para un objeto S4 general

source: no '.Data' slot defined for class %s
es: no existe slot '.Data' para la clase %s

source: class %s does not have a data part (a .Data slot) defined
es: la lcase %s no tiene una parte de datos (un slot .Data) definido

source: more than one possible class for the data part: using %s rather than %s
es: más de una clase posible para la parte de datos (.Data): se usa %s en vez de %s

source: class cannot have both an ordinary and hidden data type
es: la clase no puede tener tanto un tipo de datos ordinario como uno oculto

source: a validity method must be a function of one argument, got an object of class %s
es: un método de validación debe ser una función de un argumento, se obtuvo un objeto de clase %s

source: unable to find required package %s
es: imposible hallar el paquete requerido %s

source: unable to find an environment containing class %s
es: imposible hallar un entorno que contenga la clase %s

source: Note: some superclasses of class %s in package %s have duplicate definitions. This definition is not being treated as equivalent to that from package %s
es: Nota: algunas superclases de clase %s en el paquete %s tienen definiciones duplicadas. Esta definición no será tratada como equivalente a la del paquete %s

source: Note: the specification for class %s in package %s seems equivalent to one from package %s: not turning on duplicate class definitions for this class.
es: Nota: la especificación para la clase %s en el paquete %s parece ser equivalente a una del paquete %s: no se avanzará en definir clases duplicadas para esta clase.

source: Found more than one class "%s" in cache; using the first, from namespace '%s'
es: Se encontró más de una clase "%s" en caché; se usa la primera ocurrencia, del espacio de nombres '%s'

source: Also defined by
es: También definido/a por

source: undefined subclass %s of class %s; definition not updated
es: subclase %s de la clase %s no definida; no se actualiza la definición

source: no definition of inheritance from %s to %s, though the relation was implied by the setIs() from %s
es: no está definida la herencia de %s a %s, aunque la relación puede inferirse de setIs() para %s

source: Debugging .checkSubclasses(): assignClassDef(what="%s", *, where=%s, force=TRUE);
es: Depurando .checkSubclasses(): assignClassDef(what="%s", *, where=%s, force=TRUE);

source: argument 'includeSubclasses' must be a logical, either one value or a vector of the same length as argument 'classes'
es: el argumento 'includeSubclasses' debe ser lógico, o bien un valor o bien un vector de la misma longitud que el argumento 'classes'

source: argument 'abbreviate' must be 0, 1, 2, or 3
es: el argumento 'abbreviate' debe ser 0, 1, 2, o 3

source: needed the supplied labels vector of length %d, got %d
es: se requería el vector de etiquetas proporcionado de longitud %d, se obtuvo %d

source: the function being used as %s in making a generic function for %s is currently traced; the function used will have tracing removed
es: la función que es utilizada como %s al construir una función genérica para %s está actualmente marcada para depuración; la función que se use tendrá la marca removida

source: must supply either a generic function or a function as default for %s
es: debe proporcionar o bien una función genérica o bien una función como valor predeterminado para %s

source: the %s argument must be NULL or a generic function object; got an object of class %s
es: el argumento %s debe ser NULL o un objeto de función genérica; se obtuvo un objeto de clase %s

source: no suitable arguments to dispatch methods in this function
es: no se hallaron argumentos adecuados para resolver métodos en esta función

source: making a generic for special function %s
es: creando genérico para función 'special' %s

source: in method for %s with signature %s:
es: en método para %s con la firma %s:

source: formal arguments in method and generic do not appear in the same order
es: los argumentos formales en el método y en el genérico no aparecen en el mismo orden

source: formal arguments (%s) omitted in the method definition cannot be in the signature
es: los argumentos formales (%s) omitidos en la definición del método no pueden estar en la firma de método

source: expanding the signature to include omitted arguments in definition: %s
es: expandiendo la firma de método para incluir argumentos omitidos en la definición: %

source: methods can add arguments to the generic %s only if '...' is an argument to the generic
es: los métodos pueden agregar argumentos al genérico %s solo si '...' es un argumento del genérico

source: %s arguments (%s) after %s in the generic must appear in the method, in the same place at the end of the argument list
es: %s argumentos (%s) después de %s en el genérico deben aparecer en el método, en la misma posición al final de la lista de argumentos

source: argument 'f' must be a string, generic function, or primitive: got an ordinary function
es: el arguento 'f' debe ser una cadena, función genérica, o primitiva: se obtuvo una función ordinaria

source: no generic function found for %s
es: no se encontró función genérica para %s

source: Empty function name in .getGeneric
es: nombre de función vacío en .getGeneric

source: --- caching class
es: --- almacenando clases en caché

source: --- done caching class
es: --- listo almacenar clases en caché

source: --- getting generic
es: --- obteniendo genérico

source: (and methods)
es: (y métodos)

source: --- done getting generic
es: --- listo obtener genéricos

source: no methods found for %s; cacheGenericsMetaData() will have no effect
es: no se hallaron métodos para %s; cacheGenericsMetaData() no tendrá efecto

source: invalid value from generic function %s, class %s, expected %s
es: valor no válido desde la función genérica %s, clase %s, se esperaba %s

source: "MethodsList" is defunct; allMethods now are empty
es: "MethodsList" está obsoleto; allMethods ahora está vacío

source: the body of the generic function for %s calls 'standardGeneric' to dispatch on a different name ("%s")!
es: ¡el cuerpo de una función genérica para %s llama a 'standardGeneric' para resolver el método hacia un nombre diferente ("%s")!

source: trying to change the formal arguments in %s in an object of class %s; expected a function definition
es: se intenta cambiar la lista de argumentos formales en %s en un objeto de clase %s, se esperaba una definición de función

source: trying to change the formal arguments in %s, but getting the new formals from an object of class %s; expected a function definition
es: se intenta cambiar lista de argumentos formales en %s tratando de obtener los nuevos desde un objeto de clase %s; se esperaba una definición de función

source: trying to change the formal arguments in %s, but the number of existing arguments is less than the number of new arguments: (%s) vs (%s)
es: se intenta cambiar lista de argumentos formales en %s pero el número de argumentos actual es menor al de los nuevos: (%s) vs (%s)

source: trying to change the formal arguments in %s, but the number of existing arguments is greater than the number of new arguments (the extra arguments won't be used): (%s) vs (%s)
es: se intenta cambiar lista de argumentos formales en %s pero el número de argumentos actual es mayor al de los nuevos (los argumentos extra no serán usados: (%s) vs (%s)

source: in changing formal arguments in %s, some of the old names are not in fact arguments: %s
es: al cambiar la lista de argumentos formales en %s, algunos de los nombres anteriores no son de hecho argumentos: %s

source: got a negative maximum number of frames to look at
es: se obtuvo un número máximo negativo de marcos de la pila de llamadas para revisar

source: %s is not a generic function (or not visible here)
es: %s no es una función genérica (o no es visible desde aquí)

source: invalid element in the "groupMembers" slot (class %s)
es: elemento no válido en el slot "groupMembers" (clase %s)

source: argument f must be a generic function with signature "..."
es: el argumento 'f' debe ser una función genérica con la firma "..."

source: no method or default matching the "..." arguments in %s
es: no se encuentra método o instancia por defecto que coincida con los argumentos "..." en %s

source: multiple direct matches: %s; using the first of these
es: múltiples coincidencias directas: %s; se usa primera de ellas

source: multiple equivalent inherited matches: %s; using the first of these
es: múltiples coincidencias heredadas equivalentes: %s; se usa la primera de ellas

source: single string; got an object of class %s
es: cadena simple; se obtuvo un objeto de clase %s

source: multiple definitions exist for class %s, but the supplied package (%s) is not one of them (%s)
es: existen múltiples definiciones para la clase %s, pero el paquete proporcionado (%s) no es una de ellas (%s)

source: multiple definitions exist for class %s; should specify one of them (%s), e.g. by className()
es: existen múltiples definiciones para la clase %s; debería especificar una (%s), por ejemplo, mediante className()

source: no definition found for class %s
es: no se encontró definición para la clase %s

source: missing function for load action: %s
es: función faltante para la acción de carga: %s

source: error in load action %s for package %s: %s: %s
es: error en acción de carga %s para el paquete %s: %s: %s

source: non-function action: %s
es: la acción no es una función: %s

source: action function %s has no arguments, should have at least 1
es: función de acción %s no tiene argumentos, debe tener al menos 1

source: some actions are missing: %s
es: acciones faltantes: %s

source: %s has a sealed class definition and cannot be redefined
es: %s tiene una definición de clase sellada y no puede redefinirse

source: Argument "representation" cannot be used if argument "slots" is supplied
es: El argumento "representation" no puede ser usado si se proporciona el argumento "slots"

source: only arguments 'Class' and 'where' can be supplied when argument 'representation' is a 'classRepresentation' object
es: solo los argumentos 'Class' y 'where' pueden proporcionarse cuando el argumento 'representation' es un objeto de tipo 'classRepresentation'

source: error in contained classes (%s) for class %s and unable to remove definition from %s
es: error en las clases contenidas (%s) por la clase %s, además, no fue posible eliminar la definición de %s

source: error in contained classes (%s) for class %s; class definition removed from %s
es: error en las clases contenidas (%s) por la clase %s; la definición de clase fue eliminada de %s

source: error in contained classes (%s) for class %s and unable to restore previous definition from %s
es: error en las clases contenidas (%s) por la clase %s, además, no fue posible restaurar la definición previa desde %s

source: error in contained classes (%s) for class %s; previous definition restored to %s
es: error en las clases contenidas (%s) por la clase %s; la definición previa fue restaurada a %s

source: element %d of the representation was not a single character string
es: el elemento %d de la representación no era una cadena de caracteres simple

source: duplicate class names among superclasses: %s
es: nombres de clases duplicados entre las superclases: %s

source: only one data object (unnamed argument to prototype) allowed
es: solo se permite un unico objeto de datos (argumento sin nombre del prototipo)

source: %s is not a defined class
es: % no es una clase definida

source: %s is not a slot in class %s
es: %s no es un slot en la clase %s

source: assignment of an object of class %s is not valid for slot %s in an object of class %s; is(value, "%s") is not TRUE
es: asignación de un objeto de clase %s no válida para el slot %s en un objeto de clase %s; is(value, "%s") no es TRUE

source: assignment of an object of class %s is not valid for @%s in an object of class %s; is(value, "%s") is not TRUE
es: asignación de un objeto de clase %s no es válida para @%s en un objeto de clase %s; is(value, "%s") no es TRUE

source: class definition for %s not found (no action taken)
es: no se encontró definición de clase para %s (no se efectúa ninguna acción)

source: class %s has multiple definitions visible; only the first removed
es: la clase %s tiene múltiples definiciones visibles; solo la primera será eliminada

source: invalid class %s object
es: objeto de clase %s no válido

source: validity method must be NULL or a function of one argument
es: el método de validación debe ser NULL o una función de un solo argumento

source: class %s not found on %s; 'resetClass' will have no effect
es: no se encuentra la clase %s; 'resetClass' no tiene ningún efecto

source: argument 'classDef' must be a string or a class representation; got an object of class %s
es: el argumento 'cassDef' debe ser una cadena o la representación de una clase; se obtuvo un objeto de clase %s

source: class %s is sealed; 'resetClass' will have no effect
es: la clase %s está sellada; 'resetClass' no tiene ningún efecto

source: cannot use object of class %s in new(): class %s does not extend that class
es: no se puede usar un objeto de clase %s en new(): la clase %s no extiende esa clase

source: duplicated slot names: %s
es: nombres de slot duplicados: %s

source: class %s is defined, with package %s, but no corresponding metadata object was found (not exported?)
es: la clase %s está definida, con el paquete %s, pero no se encontró el objeto de metadatos correspondiente (¿quizá no fue exportado?)

source: no definition of %s to use for %s
es: no hay definición de %s para usar para %s

source: class definition cannot extend more than one of these data types: %s
es: la definición de la clase no puede extender más de uno de estos tipos de datos: %s

source: abnormal type %s is not supported as a superclass of a class definition
es: tipo anormal %s no soportado como superclase de una definición de clase

source: multiple class definitions for %s from packages: %s; picking the first
es: múltiples definiciones de clase para %s de los paquetes: %s; se toma la primera

source: no package name supplied and no class definition found for %s
es: no se proporcionó un nombre de paquete y no se encontró una definición de clase para %s

source: argument 'classDef' must be a class definition or the name of a class
es: el argumento 'classDef' debe ser una definición de clase o el nombre de una clase

source: No %s names supplied
es: No se proporcionaron nombres de %s

source: All %s names must be nonempty in: (%s)
es: Todos los nombres de '“%s”' deben ser no vacíos en: (%s)

source: All %s names must be distinct in: (%s)
es: Los &

source: argument %s must be a list or a character vector; got an object of class %s
es: el argumento '%s' debe ser una lista o vector de caracteres; se obtuvo un objeto de clase %s

source: expected a non-empty character string for argument 'name'
es: se esperaba una cadena de caracteres no vacía para el argumento 'name'

source: no function %s found
es: no se encontró la función %s

source: no non-generic function %s found
es: no se encontró la función no genérica %s

source: %s is not one of the element names
es: %s no es uno de los nombres de los elementos

source: no method or default for coercing %s to %s
es: no se encontró método o método por defecto para convertir %s a %s

source: no method or default for as() replacement of %s with Class="%s"
es: no se encontró método o método por defecto para la forma de reemplazo de as() de %s, con Class="%s"

source: trying to set an 'as' relation from %s to itself
es: se intenta establecer una relación 'as()' de %s hacia sí mismo

source: class %s is not defined in this environment
es: la clase %s no está definida en este entorno

source: class %s is a class union: 'coerce' relations to a class union are not meaningful
es: %s es una unión de clases, las relaciones de 'coerce' no tienen sentido para una unión de clases

source: 'as' method should have one argument, or match the arguments of coerce(): got (%s)
es: el método 'as' debería tener un argumento, o sus argumentos coincidir con los de coerce(): se obtuvo (%s)

source: a 'replace' method definition in 'setAs' must be a function of two arguments, got %d
es: la definición de un método 'replace' en 'setAs' debe ser una función de dos argumentos, se obtuvo %d

source: argument names in 'replace' changed to agree with 'coerce<-' generic: %s
es: los nombres de argumentos en 'replace' cambiaron para concordar con el genérico 'coerce<-': %s

source: ambiguous object (length != 1) to coerce to "name"
es: objeto ambiguo (longitud != 1) para ser convertido a "name"

source: undefined 'coerce' method
es: método 'coerce' no definido

source: methods currently exist for coercing from %s to %s; they will be replaced.
es: actualmente existen métodos para convertir de %s a %s; serán reemplazados.

source: Function must be an S4 generic
es: La función debe ser un genérico S4

source: method is not being debugged
es: el método no está siendo depurado

source: object %s not found
es: no se encontró el objeto %s

source: object %s not changed (it is not consistent with the current definition of class %s from %s)
es: el objeto %s no cambió (no es consistente con la actual definición de clase % de %s)

source: no definition for the class of %s (class %s) found
es: no se encontró definición para la clase de %s (clase %s)

source: object %s not changed (it does not appear to be from a version of R earlier than 1.8.0)
es: el objeto %s no cambió (no parece ser de una versión de R anterior a 1.8.0)

source: 'class1' must be the name of a class or a class definition
es: 'class1' debe ser el nombre de una clase o una definición de clase

source: 'class2' must be the name of a class or a class definition
es: 'class2' debe ser el nombre de una clase o una definición de clase

source: class %s has no visible definition from package or environment %s
es: la clase %s no tiene definición visible desde el paquete o entorno %s

source: cannot create a 'setIs' relation when neither of the classes (%s and %s) is local and modifiable in this package
es: no se puede crear una relación 'setIs' cuando ni la clase %s ni la clase %s son locales y modificables en este paquete

source: class %s is sealed; new superclasses can not be defined, except by 'setClassUnion'
es: la clase %s está sellada; no se puede definir una nueva superclase salvo mediante 'setClassUnion'

source: class %s is defined (with package slot %s) but no metadata object found to revise %s information---not imported? Making a copy in package %s
es: la clase %s está definida (con slot de paquete %s) pero no se encontró objeto de metadatos para revisar la información %s---¿fue importada? Se hace una copia en el paquete %s

source: class %s cannot extend class %s
es: la clase %s no puede extender a la clase %s

source: both classes must be defined
es: ambas clases deben definirse

source: invalid index for function argument
es: índice no válido como argumento de función

source: no function definition found for %s
es: no se encontró definición de función para %s

source: need a definition for the method here
es: aquí se requiere una definición para el método

source: Skeleton of method written to %s
es: Esqueleto para método se escribió en %s

source: invalid object in meta table of methods for %s, label %s, had class %s
es: objeto no válido en la metatabla de métodos para %s, etiqueta %s, tenía clase %s

source: invalid mlist element for signature %s at level %d (should be MethodDefinition or .Primitive, had class %s)
es: elemento mlist no válido para la firma de método %s en el nivel %d (debe ser MethodDefinition o .Primitive, tenía clase %s)

source: bad method object stored in method table, class %s
es: objeto de método erróneo almacenado en la tabla de métodos, clase %s

source: invalid object in methods table (%s), expected a method, got an object of class %s
es: objeto no válido en la tabla de métodos (%s), se esperaba un método, se obtuvo un objeto de clase %s

source: invalid or unset methods table in generic function %s
es: tabla de métodos no válida o no establecida en función genérica %s

source: trying to find a methods table in a non-generic function
es: se intenta buscar una tabla de métodos en una función no genérica

source: the "ambiguousMethodSelection" option should be a function to be called as the condition action; got an object of class %s
es: la opción "ambiguousMethodSelection" debe ser una función para ser llamada como acción de condición; se obtuvo un objeto de clase %s

source: No simply inherited methods found for function %s; using non-simple method
es: No se encontraron métodos simplemente heredados para la función %s, se usa un método no simple

source: Note: method with signature %s chosen for function %s, target signature %s. %s would also be valid
es: Nota: se eligió el método con firma %s para la función %s, firma de método objetivo: %s %s también debería ser válida

source: unable to find an inherited method for function %s for signature %s
es: imposible encontrar un método heredado para la función %s para la firma %s

source: failed to find expected group generic function:
es: no se pudo encontrar la función genérica de grupo esperada:

source: invalid group generic function in search for inherited method (class %s)
es: función genérica de grupo no válida al buscar un método heredado (clase %s)

source: invalid methods table request
es: requerimiento de tabla de métodos no válido

source: trying to check signature length of group generic '%s', but it is not a group generic
es: se intenta verificar la longitud de la firma de método para una genérico de grupo '%s', pero no es un genérico de grupo

source: trying to check signature length of generic '%s', but it is not a generic function: i = %d, funs = %s, gnames = %s
es: se intenta verificar la longitud de la firma de método el genérico '%s', pero no es una función genérica: i = %d, funs = %s, gnames = %s

source: no methods table for generic %s from package %s in package %s
es: no se encontró tabla de métodos para el genérico %s del paquete %s en el paquete %s

source: undefined classes (%s) will be ignored for argument '%s'
es: las clases no definidas (%s) se ignorarán para el argumento '%s'

source: argument 'signatures' must be a character matrix whose rows are method signatures
es: el argumento 'signatures' debe ser una matriz de tipo carácter cuyas filas son firmas de método

source: not allowed to have test==TRUE and an S4Class definition
es: no se permite test==TRUE y una definición de S4Class

source: argument 'S4Class' must be a class definition: got an object of class %s
es: el argumento 'S4Class' debe ser una definición de clase: se obtuvo un objeto de clase %s

source: inconsistent old-style class information for %s; the class is defined but does not extend %s and is not valid as the data part
es: información de clase de estilo antiguo para %s es inconsistente; la clase está definida, pero no extiende a %s y no es válida como parte de datos (.Data)

source: the S3 class of the prototype, "%s", is undefined; only allowed when this is the S3 class being registered ("%s")
es: la clase S3 del prototipo ("%s") no está definida; solo se permite cuando es la clase S3 siendo registrada ("%s")

source: restoring definition of class %s
es: restaurando la definición de la clase %s

source: slot %s: class %s should extend class %s
es: slot %s: la clase %s debería extender a la clase %s
