Repository: daroczig/R-weblate-fork
Catalog: src/library/*/po/R-*.po
Languages: es

source: '%s' is defunct.
es: '%s' ha desaparecido.

source: Use '%s' instead.
es: Utilizar '%s' en su lugar.

source: See help("Defunct") and help("%s-defunct").
es: Ver help("Defunct") y help("%s-defunct").

source: See help("Defunct")
es: Ver help("Defunct")

source: '%s' is deprecated.
es: '%s' es obsoleto.

source: See help("Deprecated") and help("%s-deprecated").
es: Ver help("Deprecated") y help("%s-deprecated").

source: See help("Deprecated")
es: Ver help("Deprecated")

source: argument to 'La.svd' must be numeric or complex
es: el argumento para 'La.svd' debe ser numérico o complejo

source: infinite or missing values in 'x'
es: Valores infinitos o faltantes en 'x'

source: a dimension is zero
es: una dimensión es cero

source: "all" and "exact" are mutually exclusive
es: "all" y "exact" son mutuamente excluyentes

source: "hexNumeric" and "digits17" are mutually exclusive
es: "hexNumeric" y "digits17" son mutuamente excluyentes

source: second argument must be a list
es: el segundo argumento debe ser una lista

source: 'iconvlist' is not available on this system
es: 'iconvlist' no está disponible en este sistema

source: '%s' is not a valid abbreviation of an RNG
es: '%s' no es una abreviatura válida de un RNG

source: '%s' is not a valid choice
es: '%s' no es una elección válida

source: malformed version string
es: versión deformada de string

source: target is %s, current is %s
es: target es %s, el actual es %s

source: 'tolerance' should be numeric
es: 'tolerance' debe ser de tipo numérico

source: 'scale' should be numeric or NULL
es: 'scale' debe ser de tipo numérico o NULL

source: '%s' must be logical
es: '%s' debe ser lógico

source: dim(X) must have a positive length
es: dim(X) debe tener una longitud positiva

source: 'X' must have named dimnames
es: 'X' debe tener 'dimnames' con nombre

source: not all elements of 'MARGIN' are names of dimensions
es: no todos los elementos de 'MARGIN' son nombres de dimensiones

source: 'MARGIN' does not match dim(X)
es: 'MARGIN' no coincide con dim(X)

source: 'dim' cannot be of length 0
es: 'dim' no puede ser de largo 0

source: 'dim' specifies too large an array
es: 'dim' especifica un array muy grande

source: 'x' must have named dimnames
es: 'x' debe tener dimnames con nombres

source: incorrect value for 'MARGIN'
es: valor incorrecto para 'MARGIN'

source: dim(x) must have a positive length
es: dim(x) debe tener una longitud positiva

source: 'pos=1' is not possible and has been warned about for years
es: 'pos=1' no es posible y ha sido advertido durante años

source: file '%s' not found
es: archivo '%s' no encontrado

source: invalid 'name' argument
es: argumento 'name' es inválido

source: package %s is required by %s, which may no longer work correctly
es: %s requiere el paquete %s, que puede ya no funcionar correctamente

source: package %s is required by %s so will not be detached
es: paquete %s es requerido por %s por lo que no será desactivado

source: %s failed in %s() for '%s', details: call: %s error: %s
es: %s falló en %s() para '%s', detalles: llamada: %s error: %s

source: %s namespace cannot be unloaded:
es: namespace %s no puede ser descargado:

source: %s converted to character string
es: %s convertido a una cadena de caracteres

source: replaced regular expression pattern '[' by '\\['
es: se reemplazó la expresión regular '[' por '\\['

source: replaced '[<-' by '\\[<-' in regular expression pattern
es: se reemplazó '[<-' por '\\[<-' en el patrón de expresión regular

source: 'value' must be a list
es: 'value' debe ser una lista

source: an object with that name already exists
es: Ya existe un objeto con ese nombre

source: autoloader did not find '%s' in '%s'
es: autoloader no encontró '%s' en '%s'

source: can only splice inside a call
es: solo puede ser unido dentro de una llamada

source: can only splice vectors
es: Solo puede empalmar vectores

source: the LINPACK argument has been defunct since R 3.1.0
es: El argumento LINPACK ya no existe desde R 3.1.0

source: complex matrices not permitted at present
es: matrices complejas no permitidas actualmente

source: 'x' must be an array of at least two dimensions
es: 'x' debe ser un array de al menos dos dimensiones

source: invalid 'dims'
es: 'dims' no válidas

source: condition handlers must be specified with a condition class
es: gestores de condición deben especificarse con una clase de condición

source: no 'restart' '%s' found
es: ningún 'restart' '%s' encontrado

source: not an interactive session
es: no es una sesión interactiva

source: not a valid restart specification
es: especificación de reinicio inválida

source: condition handlers must be functions
es: los gestores de condición deben ser funciones

source: pushing duplicate `%s` handler on top of the stack
es: empujar el gestor '%s' duplicado en la parte superior de la pila

source: argument 'where' of length 0
es: el argumento 'where' de longitud 0

source: can only write character objects
es: sólo se pueden escribir objetos de tipo character

source: 'headers' must have names and must not be NA
es: 'headers' debe tener nombres y no deben ser NA

source: 'name' must be a single character string
es: 'name' debe ser un string de un solo caracter

source: 'origin' must be one of 'start', 'current' or 'end'
es: 'origin' debe ser uno entre 'start, 'current' o 'end'

source: can only truncate an open connection
es: sólo se puede truncar una conexión abierta

source: invalid 'endian' argument
es: argumento 'endian' no válido

source: can only write vector objects
es: sólo se pueden escribir objetos de tipo vector

source: 'timeout' must be NULL or a non-negative number
es: 'timeout' debe ser NULL o un número no negativo

source: 'from' must be raw or character
es: 'from' debe ser de tipo raw o character

source: 'x' must be numeric
es: 'x' debe ser numérico

source: invalid number of intervals
es: número inválido de intervalos

source: 'breaks' are not unique
es: los 'breaks' no son únicos

source: number of intervals and length of 'labels' differ
es: El número de intervalos y la longitud de las 'etiquetas' difieren

source: invalid 'row.names' length
es: longitud de 'row.names' inválida

source: invalid 'make.names'
es: 'make.names' inválido

source: duplicate 'row.names' are not allowed
es: no se permiten 'row.names' duplicados

source: missing values in 'row.names' are not allowed
es: no se permiten valores faltantes en 'row.names'

source: invalid 'dimnames' given for data frame
es: 'dimnames' inválidos dados para data frame

source: cannot coerce class %s to a data.frame
es: no se puede forzar la clase %s a un data.frame

source: 'row.names' is not a character or integer vector of length %d
es: 'row.names' no es un vector de caracteres o enteros de longitud %d

source: mismatch of row names in arguments of 'data.frame', item %d
es: no coinciden los nombres de fila en los argumentos de 'data.frame', item %d

source: some row.names duplicated: %s --> row.names NOT used
es: algunos row.names duplicados: %s --> row.names NO utilizados

source: row names contain missing values
es: los nombres de fila contienen valores faltantes

source: duplicate row.names: %s
es: duplicar row.names: %s

source: arguments imply differing number of rows: %s
es: los argumentos implican un número diferente de filas: %s

source: 'row.names' should specify one of the variables
es: 'row.names' debería especificar una de las variables

source: row names supplied are of the wrong length
es: los nombres de fila suministrados tienen una longitud incorrecta

source: row names were found from a short variable and have been discarded
es: los nombres de fila se encontraron a partir de una variable corta y se descartaron

source: named arguments other than 'drop' are discouraged
es: se desaconsejan los argumentos con nombre que no sean 'drop'

source: 'drop' argument will be ignored
es: argumento 'drop' será ignorado

source: undefined columns selected
es: columnas no definidas seleccionadas

source: named arguments other than 'exact' are discouraged
es: se desaconsejan los argumentos con nombre que no sean 'exact'

source: named arguments are discouraged
es: se desaconsejan los argumentos con nombre

source: number of items to replace is not a multiple of replacement length
es: el número de elementos a sustituir no es un múltiplo de la longitud del reemplazo

source: 'value' is the wrong length
es: 'value' es de la longitud incorrecta

source: unsupported matrix index in replacement
es: Índice de matriz no admitido en reemplazo

source: need 0, 1, or 2 subscripts
es: necesita 0, 1 o 2 subíndices

source: missing values are not allowed in subscripted assignments of data frames
es: No se permiten valores faltantes en asignaciones con subíndices de data frames

source: non-existent rows not allowed
es: filas inexistentes no permitidas

source: column name "" cannot match any column
es: nombre de columna "" no corresponde a ninguna columna

source: new columns would leave holes after existing columns
es: las nuevas columnas dejarían agujeros después de las columnas existentes

source: duplicate subscripts for columns
es: subíndices duplicados para columnas

source: only valid calls are x[[j]] <- value or x[[i,j]] <- value
es: las únicas instrucciones válidas son x[[j]] <- valor o x[[i,j]] <- valor

source: replacing element in non-existent column: %s
es: reemplazando elemento en columna inexistente: %s

source: only a single element should be replaced
es: solamente un único elemento debe ser sustituido

source: names do not match previous names
es: los nombres no coinciden con los nombres anteriores

source: numbers of columns of arguments do not match
es: el número de columnas de los argumentos no coincide

source: invalid list argument: all variables should have the same length
es: argumento de lista inválido: todas las variables deben tener la misma longitud

source: number of columns of result, %d, is not a multiple of vector length %d of arg %d
es: El número de columnas del resultado, %d, no es un múltiplo de la longitud del vector %d del argumento %d

source: <0 rows> (or 0-length row.names)
es: <0 rows> (o 0- extensión row.names)

source: invalid 'max' / getOption("max.print"):
es: 'max' / getOption("max.print") inválido:

source: non-numeric-alike variable(s) in data frame:
es: Variable(s) no numérica(s) en el data frame:

source: %s only defined for equally-sized data frames
es: %s definido solamente para data frames con tamaños iguales

source: list of length %d not meaningful
es: lista de longitud %d no significativa

source: only defined on a data frame with all numeric-alike variables
es: solo se define en un data frame con todas las variables numéricas

source: cannot xtfrm data frames
es: no es possible aplicar xtfrm a un data frame

source: all variables should have the same length
es: todas las variables deben tener la misma longitud

source: character string is not in a standard unambiguous format
es: la cadena de caracteres no está en un formato estándar inequívoco

source: do not know how to convert '%s' to class %s
es: incapaz de convertir '%s' a clase %s

source: binary + is not defined for "Date" objects
es: el operador binario + no está definido para objetos "Date"

source: can only subtract from "Date" objects
es: solo se puede restar de los objetos "Date"

source: unary - is not defined for "Date" objects
es: el operador unitario - no está definido para objetos "Date"

source: can only subtract numbers from "Date" objects
es: solo se puede restar números de los objetos "Date"

source: unary %s not defined for "Date" objects
es: el operador unitario %s no está definido para objetos "Date"

source: %s not defined for "Date" objects
es: %s no definido para objetos "Date"

source: 'from' must be specified
es: 'from' debe ser especificado

source: 'from' must be a "Date" object
es: 'from' debe ser un objeto "Date"

source: 'from' must be of length 1
es: «from» debe ser de longitud 1

source: 'to' must be a "Date" object
es: 'to' debe ser un objeto "Date"

source: 'to' must be of length 1
es: «to» debe ser de longitud 1

source: 'length.out' must be of length 1
es: 'length.out' debe ser de longitud 1

source: exactly two of 'to', 'by' and 'length.out' / 'along.with' must be specified
es: exactamente dos 'to', 'by' y 'length.out' / 'along.width' deben ser especificados

source: 'by' must be of length 1
es: «by» debe ser de longitud 1

source: invalid 'by' string
es: cadena de caracteres 'by' inválida

source: invalid string for 'by'
es: cadena de caracteres no válida para 'by'

source: invalid mode for 'by'
es: modo inválido para 'by'

source: 'by' is NA
es: 'by' es NA

source: 'x' must be a date-time object
es: 'x' debe ser un objeto date-time

source: invalid specification of 'breaks'
es: especificación de 'breaks' inválida

source: 'origin' must be of length one
es: 'origen' debe ser de longitud 1

source: 'lag' and 'differences' must be integers >= 1
es: 'lag' y 'differences' deben ser enteros >= 1

source: unable to deduce timezone name from
es: imposible de deducir nombre de timezone de

source: wrong class
es: clase incorrecta

source: binary '+' is not defined for "POSIXt" objects
es: el operador binario '+' no esta definido para objetos "POSIXt"

source: can only subtract from "POSIXt" objects
es: solo se puede sustraer de objetos "POSIXt"

source: unary '-' is not defined for "POSIXt" objects
es: el operador unitario - no está definido para objetos "POSIXt”

source: can only subtract numbers from "POSIXt" objects
es: solo se puede sustraer números de objetos "POSIXt"

source: unary '%s' not defined for "POSIXt" objects
es: el operador unario '%s' no está definido para objetos "POSIXt"

source: '%s' not defined for "POSIXt" objects
es: '%s' no definido para objetos "POSIXt"

source: 'tzone' attributes are inconsistent
es: los atributos 'tzone' son inconsistentes

source: as.character(td, ..) no longer obeys a 'format' argument; use format(td, ..) ?
es: as.character(td, ..) ya no obedece a un argumento de 'formato'; use format(td, ..) ?

source: 'digits' must be numeric, integer valued
es: 'digits' debe ser numérico, con valores enteros

source: 'tim' is not character or numeric
es: 'tim' no es carácter ni numérico

source: need explicit units for numeric conversion
es: necesita unidades explícitas para conversión numérica

source: invalid units specified
es: unidades especificadas inválidas

source: unary '%s' not defined for "difftime" objects
es: el operador unario '%s' no está definido para objetos "difftime"

source: '%s' not defined for "difftime" objects
es: '%s' no está definido para objetos "difftime"

source: both arguments of * cannot be "difftime" objects
es: ambos argumentos de * no pueden ser objetos "difftime"

source: second argument of / cannot be a "difftime" object
es: el segundo argumento de / no puede ser un objeto "difftime"

source: 'from' must be a "POSIXt" object
es: 'from' debe ser un objeto "POSIXt"

source: 'to' must be a "POSIXt" object
es: 'to' debe ser un objeto "POSIXt"

source: component subscript must be a character string
es: el subíndice del componente debe ser una cadena de caracteres

source: no Olson database found
es: base de datos Olson no encontrada

source: 'file' must be a character string or connection
es: 'file' debe ser una conexión o cadena de caracteres

source: Invalid DCF format. Regular lines must have a tag. Offending lines start with: %s
es: Formato DCF inválido Las líneas regulares deben tener una etiqueta. Las líneas ofensivas deben empezar con: %s

source: Invalid DCF format. Continuation lines must not start a record. Offending lines start with: %s
es: Formato DCF inválido. Las líneas de continuación no deben iniciar un registro. Las líneas erróneas empiezan con: %s

source: failed to load the methods package for debugging by signature
es: no se pudo cargar el paquete de métodos para la depuración firmada

source: failed to load methods package for undebugging by signature
es: no se pudo cargar el paquete 'methods' para desactivar la depuración del método con esta firma

source: failed to load methods package for handling signature
es: no se pudo cargar el paquete 'methods' para manejar el método con esta firma

source: 'x' must be a square matrix
es: 'x' debe ser una matriz cuadrada

source: 'determinant' not currently defined for complex matrices
es: 'determinant' no definido actualmente para matrices complejas

source: 'nrow' or 'ncol' cannot be specified when 'x' is a matrix
es: 'nrow' o 'ncol' no pueden ser especificados cuando 'x' es una matriz

source: 'x' is an array, but not one-dimensional.
es: 'x' es un array, pero no uno unidimensional.

source: only matrix diagonals can be replaced
es: solo se pueden reemplazar las diagonales de las matrices

source: replacement diagonal has wrong length
es: la diagonal de reemplazo tiene una longitud errónea

source: MARGIN = %s is invalid for dim = %s
es: MARGIN = %s es inválido para dim = %s

source: must pass a package name, %s or %s object
es: se debe brindar un nombre de paquete, %s o un objeto %s

source: No DLL currently loaded with name or path %s
es: No existe una DLL actualmente cargada con nombre o ruta %s

source: multiple DLLs match '%s'. Using '%s'
es: múltiples DLLs coinciden con '%s'. Usando '%s'

source: must specify DLL via a %s object. See getLoadedDLLs()
es: se debe especificar una DLL a través de un objeto %s. Ver getLoadedDLLs()

source: function is not in a namespace, so cannot locate associated DLL
es: función no es un espacio de nombres, por lo que no se puede ubicar DLL asociada

source: looking for DLL for native routine call, but no DLLs in namespace of call
es: buscando una DLL para el llamado nativo de rutina, pero no hay DLLs en el espacio de nombres del llamado

source: non-square matrix in 'eigen'
es: matriz no cuadrada en 'eigen'

source: 0 x 0 matrix
es: matriz 0 x 0

source: invalid nrow(x)
es: nrow(x) inválido

source: invalid 'labels'; length %d should be 1 or %d
es: 'labels' inválidas; la longitud %d debe ser 1 o %d

source: number of levels differs
es: los números de niveles difieren

source: %s not meaningful for factors
es: %s no es significativo para factores

source: level sets of factors are different
es: los conjuntos de niveles de los factores son diferentes

source: invalid factor level, NA generated
es: nivel de factor inválido, se ha generado NA

source: '%s' is not meaningful for ordered factors
es: '%s' no es significativo para factores ordenados

source: '%s' not defined for ordered factors
es: '%s' no está definido para factores ordenados

source: '%s' is only meaningful for ordered factors if all arguments have the same level sets
es: '%s' solo es significativo para factores ordenados si todos los argumentos tienen el mismo conjunto de niveles

source: no files to copy to
es: no hay archivos por copiar

source: attempt to copy a directory to itself
es: intento de copiar un directorio a sí mismo

source: more 'from' files than 'to' files
es: más archivos en 'from' que archivos en 'to'

source: 'recursive' will be ignored as 'to' is not a single existing directory
es: 'recursive' será ignorado porque 'to' no es un directorio existente único

source: cannot overwrite a non-directory with a directory
es: no se puede sobreescribir un no-directorio con un directorio

source: directories are omitted unless 'recursive = TRUE'
es: los directorios se omiten a menos que 'recursive = TRUE'

source: file can not be copied both 'from' and 'to'
es: un archivo no puede ser copiado si aparece tanto en 'from' como en 'to'

source: no files to link from
es: sin archivos desde donde vincular

source: no files/directory to link to
es: sin archivos/directorio para vincular

source: no files to link to
es: sin archivos a los que vincular

source: 'package' must be of length 1
es: 'package' debe ser de longitud 1

source: no file found
es: no se encontró el archivo

source: invalid 'path' argument
es: argumento 'path' inválido

source: invalid 'time' argument
es: argumento 'time' inválido

source: 'vec' must be sorted non-decreasingly and not contain NAs
es: 'vec' debe ser ordenado de forma no descendente y no debe contener NAs

source: 'fun' is not a function
es: 'fun' no es una función

source: using the first element of 'value' of type "expression"
es: usando el primer elemento de 'value' de tipo "expression"

source: Found no format() method for class "%s"
es: No se encontró un método format() para la clase "%s"

source: class of 'x' was discarded
es: se descartó la clase de 'x'

source: 'flag' must be a string, i.e., of length 1
es: 'flag' debe ser una cadena, por ejemplo, de longitud 1

source: 'flag' should contain only characters from [0+- #'I]
es: 'flag' debería contener solo caracteres de entre [0+- #'I]

source: 'mode' must be "double" ("real"), "integer" or "character"
es: 'mode' debe ser "double" ("real"), "integer" o "character"

source: coercing argument to "character" for format="s"
es: forzando argumento a tipo "character" para 'format'="s"

source: 'format' must be one of {"f","e","E","g","G", "fg", "s"}
es: 'format' debe ser uno de {"f","e","E","g","G", "fg", "s"}

source: 'digits' reduced to %d
es: 'digits' reducido a %d

source: corrupt data frame: columns will be truncated or padded with NAs
es: data frame dañado: las columnas serán truncadas o rellenadas con NAs

source: 'zero.print' has length > 1
es: 'zero.print' tiene longitud > 1

source: 'zero.print' must be character, logical or NULL
es: 'zero.print' debe ser carácter, lógico o NULL

source: 'zero.print' is truncated to fit into formatted zeros; consider 'replace=TRUE'
es: 'zero.print' está truncado para coincidir con ceros formateados; considere usar 'replace=TRUE'

source: 'big.mark' and 'decimal.mark' are both '%s', which could be confusing
es: 'big.mark' y 'decimal.mark' son ambos '%s', lo cual puede ser confuso

source: 'input.d.mark' has no characters
es: 'input.d.mark' no tiene caracteres

source: 'subset' must be logical
es: 'subset' debe ser lógico

source: value for %s not found
es: no se encontró valor para %s

source: all arguments must be named
es: todos los argumentos deben ser nombrados

source: argument '%s' will be ignored
es: el argumento '%s' será ignorado

source: match distance components must be non-negative
es: los componentes de distancia de coincidencia no deben ser negativos

source: unknown match distance components ignored
es: los componentes de distancia de coincidencia desconocidos fueron ignorados

source: unknown cost components ignored
es: los componentes de coste desconocidos fueron ignorados

source: cost components must be non-negative
es: los componentes de coste no deben ser negativos

source: %s and %s must have the same length
es: %s y %s deben tener la misma longitud

source: need non-overlapping matches for %s
es: se necesitan coincidencias no superpuestas para %s

source: missing replacement values are not allowed
es: no se permiten valores de reemplazo faltantes

source: must have replacement values for matches
es: se debe tener valores de reemplazo para las coincidencias

source: value does not provide any replacement values
es: el valor no provee ningún valor de reemplazo

source: must have replacements for non-matches
es: debe haber reemplazos para las no coincidencias

source: must have replacements for matches
es: se debe tener reemplazos para las coincidencias

source: No factors specified
es: factores no especificados

source: invalid '%s': type "%s"
es: '%s' inválido: tipo "%s"

source: 'uplo' must be "U" or "L"
es: 'uplo' debe ser de "U" o "L"

source: invalid nrow(z)
es: nrow(z) no válido

source: triangular matrix should be square
es: la matriz triangular debe ser cuadrada

source: using 1-norm approximation for approximate 2-norm
es: utilizando norma-1 como aproximación para la norma-2 aproximada
