Repository: daroczig/R-weblate-fork
Catalog: src/library/*/po/R-*.po
Languages: es

source: norm="%s" not available here; using norm="1"
es: norm="%s" no disponible; usando norm="1"

source: unknown conflict policy: %s
es: política de conflictos desconocida: %s

source: only one of 'include.only' and 'exclude' can be used
es: solo uno de 'include.only' y 'exclude' puede ser usado

source: package %s has not been installed properly
es: el paquete %s no ha sido instalado adecuadamente

source: package %s was built before R 3.0.0: please re-install it
es: el paquete %s ha sido construido antes de R 3.0.0: por favor reinstálelo

source: This is R %s, package %s needs %s %s
es: Esto es R %s, el paquete %s requiere %s %s

source: package %s was built under R version %s
es: el paquete %s ha sido construido bajo la versión %s de R

source: package %s was built for %s
es: el paquete %s ha sido compilado para %s

source: package %s is not installed for 'arch = %s'
es: el paquete %s no está instalado para la arquitectura 'arch=%s'

source: Conflicts attaching package %s: %s
es: Conflictos adjuntando el paquete %s: %s

source: Attaching package: %s
es: Adjuntando el paquete: %s

source: 'verbose' and 'quietly' are both true; being verbose then ..
es: 'verbose' y 'quietly' son ambos verdaderos; se elige 'verbose'

source: invalid package name
es: nombre de paquete no válido

source: there is no package called %s
es: no hay paquete llamado %s

source: no library trees found in 'lib.loc'
es: no se encontraron árboles de bibliotecas en 'lib.loc'

source: %s is not a valid installed package
es: %s no es un paquete instalado válido

source: %s not found on search path, using pos = 2
es: no se encontró %s en la ruta de búsqueda, usando pos = 2

source: Package %s version %s cannot be unloaded: %s
es: El paquete cargado %s versión %s no puede ser descargado %s

source: package or namespace load failed for %s%s: %s
es: error en la carga del paquete o espacio de nombres para %s%s: %s

source: package %s already present in search()
es: el paquete %s ya está presente en search()

source: 'DESCRIPTION' has an 'Encoding' field and re-encoding is not possible
es: 'DESCRIPTION' tiene un campo 'Encoding' y la re-codificación no es posible

source: %sPackages in library %s:
es: Paquetes %s en la biblioteca %s:

source: no packages found
es: no se encontraron paquetes

source: R packages available
es: paquetes R disponibles

source: DLL %s not found: maybe not installed for this architecture?
es: DLL %s no encontrada: ¿quizás no está instalado para esta arquitectura?

source: shared object %s not found
es: objeto compartido %s no encontrado

source: DLL %s already loaded
es: DLL %s ya cargado

source: shared object '%s' already loaded
es: el objeto compartido '%s' ya está cargado

source: now dyn.load("%s") ...
es: ahora hacieno dyn.load("%s") ...

source: no DLL was specified
es: ningún DLL fue especificado

source: no shared object was specified
es: ningún objeto compartido fue especificado

source: DLL %s was not loaded
es: DLL %s no fue cargado

source: shared object %s was not loaded
es: el objeto compartido %s no fue cargado

source: DLL %s not found
es: DLL %s no fue cargado

source: shared object '%s' not found
es: objeto compartido '%s' no encontrado

source: now dyn.unload("%s") ...
es: ahora haciendo dyn.unload("%s") ...

source: Loading required package: %s
es: Cargando paquete requerido: %s

source: none of the packages are loaded
es: ninguno de los paquetes está cargado

source: package %s found more than once, using the first from %s
es: el paquete %s fue encontrado más de una vez, usando el primero desde %s

source: Further information is available in the following vignettes in directory %s:
es: Más información disponible en las siguientes viñetas en el directorio %s:

source: Description:
es: Descripción:

source: Index:
es: Índice:

source: Information on package %s
es: Información sobre el paquete %s

source: Documentation for package %s
es: Documentación para el paquete %s

source: package %s required by %s could not be found
es: el paquete %s requerido por %s no pudo ser encontrado

source: version %s of %s masked by %s in %s
es: la versión %s de %s enmascarada por %s en %s

source: package %s could not be loaded
es: el paquete %s no pudo ser cargado

source: empty (zero-byte) input file
es: archivo de entrada vacío (cero bytes)

source: input has been corrupted, with LF replaced by CR
es: la entrada se ha dañado, LF fue reemplazado por CR

source: bad 'file' argument
es: argumento 'file' erróneo

source: 'file' must be specified
es: 'file' debe ser especificado

source: nothing specified to be save()d
es: nada especificado para ser guardado por save()

source: '%s' must be a non-empty string
es: '%s' debe ser una cadena no vacía

source: 'compress' must be logical or character
es: 'compress' debe ser lógico o carácter

source: 'compress = "%s"' is invalid
es: 'compress = "%s" ' es inválido

source: bad file argument
es: argumento de archivo erróneo

source: can only save to a binary connection
es: sólo se puede escribir en una conexión binaria

source: image could not be renamed and is left in %s
es: no se pudo modificar el nombre de la imagen y se deja en %s

source: [Previously saved workspace restored]
es: [El espacio de trabajo previamente guardado ha sido restaurado]

source: Attempting to load the environment %s
es: Intentando cargar el entorno %s

source: Specified environment not found: using '.GlobalEnv' instead
es: Entorno especificado no encontrado: usando '.GlobalEnv' en su lugar

source: invalid 'category' argument
es: argumento 'category' inválido

source: must specify names of formal arguments for 'vectorize'
es: se deben especificar los nombres de los argumentos formales para 'vectorize'

source: may not have argument(s) named
es: puede no tener argumento(s) de nombre

source: 'arg' must be NULL or a character vector
es: 'arg' debe ser NULL o un vector de tipo carácter

source: 'arg' must be of length 1
es: 'arg' debe ser de longitud 1

source: 'arg' must be of length >= 1
es: 'arg' debe ser de longitud >= 1

source: there is more than one match in 'match.arg'
es: hay más de una coincidencia en 'match.arg'

source: no match
es: sin coincidencias

source: 'input' must have length 1
es: 'input' debe tener longitud 1

source: 'input' and 'target' must be character vectors
es: 'input' y 'target' deben ser vectores de tipo carácter

source: cannot mtfrm
es: no se puede hacer mtfrm ("match form")

source: '%s' is not a function, character or symbol
es: '%s' no es una función, un carácter o un símbolo

source: found non-function '%s'
es: se encontró una no-función '%s'

source: attempt to set 'rownames' on an object with no dimensions
es: intento de asignar 'rownames' a un objeto sin dimensiones

source: attempt to set 'colnames' on an object with less than two dimensions
es: intento de establecer 'colnames' en un objeto con menos de dos dimensiones

source: argument is not numeric or logical: returning NA
es: argumento no es numérico o lógico: se devuelve NA

source: 'trim' must be numeric of length one
es: 'trim' debe ser numérico de longitud uno

source: trimmed means are not defined for complex data
es: medias truncadas no están definidas para datos complejos

source: 'by' must match numbers of columns
es: 'by' debe coincidir con los números de columnas

source: 'by' must match number of columns
es: 'by' debe coincidir con el número de columnas

source: 'by' must specify one or more columns as numbers, names or logical
es: 'by' debe especificar una o más columnas como números, nombres o lógicos

source: long vectors are not supported
es: vectores largos no son soportados

source: 'by.x' and 'by.y' specify different numbers of columns
es: 'by.x' y 'by.y' especifican distinto número de columnas

source: 'incomparables' is supported only for merging on a single column
es: 'incomparables' solo se admite para combinar en una sola columna

source: additional arguments ignored in message()
es: argumentos adicionales ignorados en message()

source: tracing functions requires the 'methods' package, but unable to load the 'methods' namespace
es: trazar las funciones requiere el paquete 'methods', pero no se puede cargar el espacio de nombres 'methods'

source: invalid to change the storage mode of a factor
es: no es válido cambiar el modo de almacenamiento de un factor

source: namespace %s is not available and has been replaced by .GlobalEnv when processing object %s
es: el espacio de nombres %s no está disponible y se ha reemplazado por. GlobalEnv al procesar el objeto %s

source: namespace is already attached
es: El espacio de nombres ya había sido adjuntado

source: not found in namespace %s: %s
es: No se encuentra en el espacio de nombres %s: %s

source: %s not found
es: '%s' no encontrado

source: namespace %s %s is already loaded, but %s %s is required
es: El espacio de nombres %s %s ya está cargado, pero se requiere %s %s

source: - loading
es: - cargando

source: namespace %s is already sealed in 'loadNamespace'
es: el espacio de nombres %s ya está sellado en 'loadNamespace'

source: failed to assign RegisteredNativeSymbol for %s to %s since %s is already defined in the %s namespace
es: no se pudo asignar RegisteredNativeSymbol para %s a %s, ya que %s ya está definido en el espacio de nombres %s

source: failed to assign NativeSymbolInfo for %s to %s since %s is already defined in the %s namespace
es: no se pudo asignar NativeSymbolInfo para %s a %s ya que %s ya está definido en el espacio de nombres %s

source: failed to assign NativeSymbolInfo for %s since %s is already defined in the %s namespace
es: no se pudo asignar NativeSymbolInfo para %s, ya que %s ya está definido en el espacio de nombres %s

source: package %s does not have a namespace
es: El paquete %s no tiene un espacio de nombres

source: package %s was installed before R 4.0.0: please re-install it
es: el paquete %s fue instalado antes de R 4.0.0: por favor reinstálelo

source: namespace %s %s is being loaded, but %s %s is required
es: se está cargando el espacio de nombres %s %s, pero se requiere %s %s

source: package %s has no 'package.rds' in Meta/
es: el package %s no tiene 'package.rds' en Meta/

source: package %s has a license that you need to accept in an interactive session
es: el paquete %s tiene una licencia que se necesita aceptar en una sesión interactiva

source: package %s has a license that you need to accept after viewing
es: el paquete %s tiene una licencia que necesita aceptar después de revisar

source: package %s has a license that you need to accept:
es: el paquete %s tiene una licencia que necesita aceptar:

source: according to the DESCRIPTION file it is
es: según el archivo DESCRIPTION es

source: license for package %s not accepted
es: licencia para el paquete %s no aceptada

source: package %s was installed by an R version with different internals; it needs to be reinstalled for use with this R version
es: el paquete %s fue instalado por una versión de R con distinto 'internals'; debe reinstalarse para su uso con esta versión de R

source: -- processing imports for
es: -- procesando imports para

source: -- done processing imports for
es: -- fin de procesamiento de imports para

source: -- loading code for
es: -- cargando código para

source: unable to load R code in package %s
es: no fue posible cargar el código de R en el paquete %s

source: -- loading sysdata for
es: -- cargando sysdata para

source: -- loading lazydata for
es: -- cargando datos diferidos (lazydata) para

source: -- registerS3methods for
es: -- registrando métodos S3 para

source: -- done registerS3methods for
es: -- hecho registerS3methods para

source: -- running .onLoad for
es: -- ejecutando .onLoad para

source: -- done running .onLoad for
es: -- hecho ejecutar .onLoad para

source: S4 exports specified in 'NAMESPACE' but not defined in package %s
es: exportaciones de S4 especificadas en 'NAMESPACE' pero no definidas en el paquete %s

source: -- processing S4 stuff for
es: -- procesando cosas de S4 para

source: --- caching metadata
es: --- cargando metadatos en caché

source: --- done caching metadata
es: --- hecho carga de metadatos en caché

source: --- processing classes
es: --- procesando clases

source: 'exportClassPattern' specified in 'NAMESPACE' but no matching classes in package %s
es: 'exportClassPattern' especificado en 'NAMESPACE' pero no hay clases coincidentes en el paquete %s

source: in package %s classes %s were specified for export but not defined
es: En el paquete %s se especificaron las clases %s para la exportación, pero no están definidas

source: no function found corresponding to methods exports from %s for: %s
es: no se ha encontrado ninguna función que corresponda a las exportaciones de métodos de %s para: %s

source: in %s methods for export not found: %s
es: No se encontraron los métodos para exportación en %s: %s

source: ---- export method
es: ---- exportar método

source: multiple methods tables found for %s
es: se han encontrado varias tablas de métodos para %s

source: failed to find metadata object for %s
es: no se pudo encontrar el objeto de metadatos para %s

source: in package %s methods %s were specified for export but not defined
es: en el paquete %s se especificaron los métodos %s para la exportación, pero no están definidos

source: -- done processing S4 stuff for
es: -- hecho procesar cosas de S4 para

source: --- processing exports for
es: --- procesando exportaciones para

source: --- sealing exports for
es: --- sellando exportaciones para

source: - done loading
es: - carga finalizada

source: Loading required namespace: %s
es: Cargando el espacio de nombres requerido: %s

source: not loading a namespace
es: no se carga un espacio de nombres

source: namespace %s is imported by %s so cannot be unloaded
es: el espacio de nombres %s es importado por %s, por lo que no se puede descargar

source: not a namespace
es: no es un espacio de nombres

source: operation not allowed on base namespace
es: Operación no permitida en el espacio de nombres base

source: duplicate import names %s
es: nombres de importación duplicados %s

source: replacing local value with import %s when loading %s
es: Se reemplaza el valor local con la importación %s al cargar %s

source: cannot import into a sealed namespace
es: no se puede importar en un espacio de nombres sellado

source: replacing previous import by %s when loading %s
es: reemplazando la importación anterior por %s al cargar %s

source: invalid import target
es: destino de importación no válido

source: found methods to import for function %s but not the generic itself
es: se encontraron métodos para importar para la función %s, pero no la función genérica en sí

source: replacing previous import %s by %s when loading %s
es: reemplazando la importación previa por %s al cargar %s

source: No generic function %s found corresponding to requested imported methods from package %s when loading %s (malformed exports?)
es: No se ha encontrado ninguna función genérica %s que corresponda a los métodos importados solicitados del paquete %s al cargar %s (¿exportaciones mal formadas?)

source: cannot add to exports of a sealed namespace
es: no se puede agregar a las exportaciones de un espacio de nombres sellado

source: undefined exports: %s
es: exportaciones no definidas: %s

source: unable to re-encode some lines in NAMESPACE file
es: no se pueden re-codificar algunas líneas en el archivo NAMESPACE

source: package %s has no 'NAMESPACE' file
es: el paquete %s no tiene ningún archivo 'NAMESPACE'

source: empty name in directive '%s' in 'NAMESPACE' file
es: nombre vacío en la directiva '%s' en el archivo 'NAMESPACE'

source: duplicate symbol names %s in useDynLib("%s")
es: nombres de símbolos duplicados %s en useDynLib("%s")

source: bad 'S3method' directive: %s
es: directiva 'S3method' errónea: %s

source: unknown namespace directive: %s
es: directiva de espacio de nombres desconocida: %s

source: S3 method %s was declared but not found
es: el método S3 %s fue declarado, pero no fue encontrado

source: bad method
es: método incorrecto

source: object '%s' not found whilst loading namespace '%s'
es: el objeto '%s' no se encontró mientras se cargaba el espacio de nombres '%s'

source: While loading namespace "%s": "%s" differ in ncol(.), env=%d, newNS=%d.
es: Al cargar el espacio de nombres "%s": "%s" difieren en ncol(.), env=%d, newNS=%d.

source: Maybe package installed with version of R newer than %s ?
es: ¿Tal vez el paquete instalado con una versión de R más reciente que %s?

source: '%s' is not implemented yet
es: '%s' aún no se ha implementado

source: argument '%s' is not used (yet)
es: el argumento '%s' no se usa (todavía)

source: 'x' cannot be coerced to class "octmode"
es: 'x' no puede ser convertido a la clase "octmode"

source: 'x' cannot be coerced to class "hexmode"
es: 'x' no puede ser convertido a la clase "hexmode"

source: using ... with FUN = "*" is an error
es: es un error usar ... con FUN = "*"

source: no arguments
es: sin argumentos

source: an argument will be fractionally recycled
es: un argumento será reciclado en forma fraccional

source: invalid ncol(x)
es: ncol(x) no válido

source: too large a matrix for LINPACK
es: matriz demasiado grande para LINPACK

source: first argument must be a QR decomposition
es: el primer argumento debe ser una descomposición QR

source: invalid nrow(qr$qr)
es: nrow no válido(qr$qr)

source: invalid ncol(qr$qr)
es: ncol(qr$qr) no válido

source: invalid ncol(qr$rank)
es: ncol no válido(qr$rank)

source: invalid ncol(y)
es: ncol(y) no válido

source: 'qr' and 'y' must have the same number of rows
es: 'qr' e 'y' deben tener el mismo número de filas

source: exact singularity in 'qr.coef'
es: singularidad exacta en 'qr.coef'

source: argument is not a QR decomposition
es: argumento no es una descomposición QR

source: invalid NCOL(y)
es: NCOL(y) no válido

source: not implemented for complex 'qr'
es: no implementado para 'qr' complejo

source: not supported for LAPACK QR
es: no soportado para QR de LAPACK

source: 'k' is too large
es: 'k' es demasiado grande

source: need larger value of 'ncol' as pivoting occurred
es: se requiere un valor mayor de 'ncol' ya que se debió pivotar

source: invalid NCOL(R)
es: NCOL(R) no válido

source: 'x' must be a vector of an atomic type
es: 'x' debe ser un vector de tipo atómico

source: invalid 'rle' structure
es: estructura 'rle' no válida

source: ... must contain names or character strings
es: ... debe contener nombres o cadenas de caracteres

source: invalid 'x'
es: 'x' no válido

source: incorrect length for 'group'
es: longitud incorrecta para 'group'

source: missing values for 'group'
es: valores faltantes para 'group'

source: not a data frame
es: no es un data frame

source: length of 'center' must equal the number of columns of 'x'
es: la longitud de 'center' debe ser igual al número de columnas de 'x'

source: length of 'scale' must equal the number of columns of 'x'
es: la longitud de 'scale' debe ser igual al número de columnas de 'x'

source: either specify 'nmax' or 'n', but not both.
es: especifique o bien 'nmax' o o bien 'n', pero no ambos.

source: 'from' must be a finite number
es: 'from' debe ser un número finito

source: argument 'length.out' must be of length 1
es: el argumento 'length.out' debe tener una longitud de 1

source: first element used of 'length.out' argument
es: se utiliza el primer elemento del argumento 'length.out'

source: 'to' must be a finite number
es: 'to' debe ser un número finito

source: invalid '(to - from)/by'
es: '(to - from)/by' no es válido

source: wrong sign in 'by' argument
es: signo erróneo en argumento 'by'

source: 'by' argument is much too small
es: el argumento 'by' es demasiado pequeño

source: 'length.out' must be a non-negative number
es: 'length.out' debe ser un número no negativo

source: too many arguments
es: demasiados argumentos

source: invalid 'compress' argument:
es: argumento 'compress' no válido:

source: 'compress' is ignored unless 'file' is a file name
es: 'compress' se ignorará a menos que 'file' sea un nombre de archivo

source: 'connection' must be a connection
es: 'connection' debe ser una conexión

source: 'file' must be NULL or an already open connection
es: 'file' debe ser NULL o una conexión previamente abierta

source: cannot split the message connection
es: no se puede dividir la conexión para mensajes

source: 'file' must be NULL, a connection or a character string
es: 'file' debe ser NULL, una conexión, o una cadena de caracteres

source: this is the "qr" method for the generic function solve()
es: este es el método "qr" para la función genérica solve()

source: singular matrix 'a' in 'solve'
es: matriz singular 'a' en 'solve'

source: only square matrices can be inverted
es: solo las matrices cuadradas pueden invertirse

source: solve.default called with a "qr" object: use 'qr.solve'
es: 'solve.default' llamado con un objeto "qr": use 'qr.solve'

source: singular matrix 'a' in solve
es: matriz singular 'a' en 'solve'

source: 'decreasing' must be a length-1 logical vector. Did you intend to set 'partial'?
es: 'decreasing' debe ser un vector lógico de longitud 1. ¿Intentaba establecer 'partial'?

source: 'partial' sorting not supported by radix method
es: ordenamiento 'partial' no soportado por el método radix

source: 'index.return' only for non-factors
es: 'index.return' solo para no factores

source: 'x' must be atomic
es: 'x' debe ser atómico

source: 'index.return' only for 'na.last = NA'
es: 'index.return' solo para 'na.last = NA'

source: unsupported options for partial sorting
es: opciones no soportadas para ordenamiento parcial

source: non-finite 'partial'
es: 'partial' no es finito

source: 'decreasing' of length > 1 is only for method = "radix"
es: 'decreasing' de longitud > 1 es solo para 'method' = "radix"

source: argument lengths differ
es: longitudes de los argumentos difieren

source: method = "quick" is only for numeric 'x'
es: el método "quick" es solo para 'x' numérico

source: 'x' must be atomic for 'sort.list', method "shell" and "quick" Have you called 'sort' on a list?
es: 'x' debe ser atómico para 'sort.list', método "shell" y "quick" ¿Ha llamado a 'sort' sobre una lista?

source: cannot xtfrm 'x'
es: no se puede hacer "xtfrm" en 'x'

source: 'local' must be TRUE, FALSE or an environment
es: 'local' debe ser TRUE, FALSE, o un entorno

source: 'echo' must be logical
es: 'echo' debe ser lógico

source: 'verbose' is TRUE, 'echo' not; ... coercing 'echo <- TRUE'
es: 'verbose' es TRUE, 'echo' no lo es; ... se fuerza 'echo <- TRUE'

source: empty file/url name
es: nombre de archivo o url vacío

source: unable to find a plausible encoding
es: no es posible encontrar una codificación admisible

source: encoding = "%s" chosen
es: se escogió codificación = "%s"

source: 'chdir = TRUE' makes no sense for a URL
es: 'chdir = TRUE' no tiene sentido para una URL

source: cannot 'chdir' as current directory is unknown
es: no se pudo cambiar de directorio (chdir) ya que el actual se desconoce

source: 'chdir = TRUE' makes no sense for a connection
es: 'chdir = TRUE' no tiene sentido en una conexión

source: specify either 'file' or 'exprs' but not both
es: especifique o bien 'file' o bien 'exprs', pero no ambos

source: '%s' is not an existing file
es: '%s' no es un archivo existente

source: 'formula' must be a formula
es: 'formula' debe ser una fórmula

source: Unexpected LHS in 'formula' has been ignored.
es: Lado izquierdo inesperado en 'formula', se ha ignorado.

source: Unexpected LHS in 'formula' has been combined with RHS.
es: Lado izquierdo inesperado en 'formula'; se ha combinado con el lado derecho.

source: Timestamp of %s has changed
es: Marca temporal de %s ha cambiado

source: 'x' and 'to' must refer to same file
es: 'x' y 'to' deben referirse al mismo archivo
