Repository: daroczig/R-weblate-fork
Catalog: src/library/*/po/R-*.po
Languages: es

source: additional arguments ignored in stop()
es: argumentos adicionales ignorados en stop()

source: Only one of 'exprs', 'exprObject' or expressions, not more
es: Solo uno de 'exprs', 'exprObject' o expressions, no más

source: %s and %s are not equal: %s
es: %s y %s no son iguales: %s

source: additional arguments ignored in warning()
es: argumentos adicionales ignorados en warning()

source: Sys.setenv(LANGUAGE="%s") may have failed
es: Sys.setenv(LANGUAGE="%s") podría haber fallado

source: Calling 'structure(NULL, *)' is deprecated, as NULL cannot have attributes. Consider 'structure(list(), *)' instead.
es: La llamada 'structure(NULL, *)' es obsoleta ya que NULL no puede tener atributos. Considere 'structure(list(), *)' en su lugar.

source: incorrect value for 'x'
es: valor incorrecto para 'x'

source: 'x' and 'y' must have the same length
es: 'x' e 'y' deben tener la misma longitud

source: probably wrong encoding in names(.) of column
es: codificación probablemente incorrecta en names(.) de columna

source: STATS is longer than the extent of 'dim(x)[MARGIN]'
es: STATS es más largo que la extensión de 'dim(x)[MARGIN]'

source: STATS does not recycle exactly across MARGIN
es: STATS no se recicla en forma exacta a lo largo de MARGIN

source: length(STATS) or dim(STATS) do not match dim(x)[MARGIN]
es: length(STATS) o dim(STATS) no coinciden con dim(x)[MARGIN]

source: 'exclude' containing NA and 'useNA' != "no"' are a bit contradicting
es: 'exclude' que contiene NAs y 'useNA' != "no" es algo contradictorio

source: nothing to tabulate
es: nada para tabular

source: all arguments must have the same length
es: todos los argumentos deben tener la misma longitud

source: attempt to make a table with >= 2^31 elements
es: se intenta crear una tabla con más de 2^31 elementos

source: 'object' must inherit from class %s
es: 'object' debe heredar de la clase %s

source: 'x' must inherit from class %s
es: 'x' debe heredar de la clase %s

source: cannot coerce to a table
es: no se puede convertir a una tabla

source: 'x' is not an array
es: 'x' no es un array

source: 'bin' must be numeric or a factor
es: 'bin' debe ser numérico o factor

source: invalid value of %s
es: valor invalido de %s

source: 'X' must be a data frame when 'INDEX' is a formula
es: 'X' debe ser un data frame cuando 'INDEX' es una fórmula

source: 'INDEX' is of length zero
es: 'INDEX' de longitud cero

source: arguments must have same length
es: los argumentos deben tener la misma longitud

source: total number of levels >= 2^31
es: número total de niveles >= 2^31

source: handler must be a function
es: controlador de devolución de llamada debe ser una función

source: 'which' must be of length 1
es: 'which' debe ser de longitud 1

source: no such element '%s'
es: no hay tal elemento '%s'

source: invalid 'which' argument
es: argumento 'which' no válido

source: 'which' must be character or numeric
es: 'which' debe ser de tipo carácter o numérico

source: Removing %s
es: Removiendo %s

source: Registering 'evaluate' as low-level callback
es: Registrando 'evaluate' como devolución de llamada de bajo nivel

source: Timing stopped at:
es: Temporizador detenido en:

source: user
es: usuario/a

source: system
es: sistema

source: elapsed
es: transcurrido

source: 'width' must be positive
es: 'width' debe ser positivo

source: No traceback available
es: no hay traza de depuración disponible

source: invalid non-character version specification 'x' (type: %s)
es: especificación de versión 'x' (no carácter) no es válida (tipo: %s)

source: Calls
es: Llamadas

source: invalid version specification %s
es: especificación de versión no válida %s

source: invalid 'value'
es: 'value' no válido

source: unary '%s' not defined for "numeric_version" objects
es: '%s' unario no está definido para objetos de tipo "numeric_version"

source: '%s' not defined for "numeric_version" objects
es: '%s' no está definido para objetos de tipo "numeric_version"

source: %s not defined for "numeric_version" objects
es: %s no está definido para objetos de tipo "numeric_version"

source: <0 elements>
es: <0 elementos>

source: 'tags' must be a character vector of the same length as 'x'
es: 'tags' debe ser vector de tipo carácter de la misma longitud que 'x'

source: Summary of (a total of %d) warning messages:
es: Resumen de (en total %d) mensajes de advertencia:

source: invalid 'digits'
es: 'digits' no es válido

source: Direct call of '%s()' is deprecated. Use '%s()' or '%s()' instead
es: Llamada directa de '%s()' es obsoleta. Use '%s()' o '%s()' en su lugar

source: arguments 'show.output.on.console', 'minimized' and 'invisible' are for Windows only
es: los argumentso 'show.output.on.console', 'minimized' e 'invisible' son solo para Windows

source: 'intern' must be TRUE or FALSE
es: 'intern' debe ser TRUE o FALSE

source: 'ignore.stdout' must be TRUE or FALSE
es: 'ignore.stdout' debe ser TRUE o FALSE

source: 'ignore.stderr' must be TRUE or FALSE
es: 'ignore.stderr' debe ser TRUE o FALSE

source: 'wait' must be TRUE or FALSE
es: 'wait' debe ser TRUE o FALSE

source: 'receive.console.signals' must be TRUE or FALSE
es: 'receive.console.signals' debe ser TRUE o FALSE

source: 'input' must be a character vector or 'NULL'
es: 'input' debe ser vector de tipo carácter o 'NULL'

source: arguments 'minimized' and 'invisible' are for Windows only
es: los argumentos 'minimized' y 'invisible' son solo para Windows

source: setting stdout = TRUE
es: estableciendo stdout = TRUE

source: 'stdout' must be of length 1
es: 'stdout' debe ser de longitud 1

source: 'stderr' must be of length 1
es: 'stderr' debe ser de longitud 1

source: 'which' was not found on this platform
es: 'which' no se encontró en esta plataforma

source: fewer 'from' files than 'to' files
es: menos archivos en 'from' que en 'to'

source: link '%s' already exists
es: vínculo '%s' ya existe

source: failed to create directory for link '%s
es: fallo al crear directorio para vínculo '%s

source: 'show.output.on.console' must be TRUE or FALSE
es: 'show.output.on.console' debe ser TRUE o FALSE

source: 'minimized' must be TRUE or FALSE
es: 'minimized' debe ser TRUE o FALSE

source: 'invisible' must be TRUE or FALSE
es: 'invisible' debe ser TRUE o FALSE

source: running command '%s' had status %d
es: el comando ejecutado '%s' tenía estado %d

source: '%s' could not be run
es: '%s' no puede ser ejecutado

source: '%s' execution failed with error code %d
es: ejecución de '%s' falló con código de error %d

source: -l option without value
es: opción -l sin valor

source: ERROR: no packages specified
es: ERROR: no se especificaron paquetes

source: Removing from library
es: eliminando de la biblioteca

source: ERROR: cannot cd to directory
es: ERROR: no se puede cambiar al directorio

source: ERROR: no permission to remove from directory
es: ERROR: no tiene permiso para eliminar del directorio

source: deparse option %s is not recognized
es: opción de 'deparse' %s no se reconoce

source: The following object is masked _by_ %s:
es: El siguiente objeto está enmascarado _por_ %s:

source: The following object is masked from %s:
es: El siguiente objeto está enmascarado desde %s:

source: invalid 'row.names', length %d for a data frame with %d row
es: 'row.names' no válido, longitud %d para un data frame de %d fila

source: supplied %d row name for %d rows
es: se suministró %d nombre de fila para %d filas

source: replacement has %d row, data has %d
es: reemplazo tiene %d fila, los datos tienen %d

source: replacement has %d item, need %d
es: reemplazo tiene %d ítem, se necesitan %d

source: replacement element %d is a matrix/data frame of %d row, need %d
es: elemento de reemplazo %d es una matriz o data frame de %d fila, se necesita(n) %d

source: replacement element %d has %d row, need %d
es: elemento de reemplazo %d tiene %d fila, se necesita(n) %d

source: replacement element %d has %d row to replace %d rows
es: elemento de reemplazo %d tiene %d fila para reemplazar % fila(s)

source: %d row in value to replace %d rows
es: %d fila en 'value' para reemplazar %d fila(s)

source: replacement data has %d row to replace %d rows
es: datos de reemplazo tienen %d fila para reemplazar %d fila(s)

source: provided %d variable to replace %d variables
es: se suministró %d variable para reemplazar %d variable(s)

source: data frame with 0 columns and %d row
es: data frame con 0 columnas y %d fila

source: library %s contains no packages
es: biblioteca %s no contiene paquetes

source: package %s is not loaded
es: el paquete %s no está cargado

source: there is no package called
es: no hay un paquete llamado

source: object %s not found
es: objeto %s no encontrado

source: 'arg' should be %s
es: 'arg' debe ser %s

source: 'by' must specify a uniquely valid column
es: 'by' debe especificar una columna válida única

source: Function found when exporting methods from the namespace %s which is not S4 generic: %s
es: Se encontró una función al exportar métodos desde el espacio de nombres %s que no es S4 genérica: %s

source: No methods found in package %s for request: %s when loading %s
es: No se encontraron métodos en el paquete %s para el requerimiento: %s mientras se cargaba %s

source: requested method not found in environment/package %s: %s when loading %s
es: método requerido no encontrado en el entorno/paquete %s: %s mientras se cargaba %s

source: class %s is not exported by 'namespace:%s'
es: la clase %s no es exportada por 'namespace:%s'

source: object %s is not exported by 'namespace:%s'
es: el objeto %s no es exportado por 'namespace:%s'

source: previous export '%s' is being replaced
es: exportación previa '%s' está siendo reemplazada

source: S3 method %s was declared in NAMESPACE but not found
es: método S3 %s fue declarado en NAMESPACE, pero no se encontró

source: %s is not TRUE
es: %s no es TRUE

source: Warning message:
es: Aviso:

source: In %s : extra argument %s will be disregarded
es: En %s : argumento extra %s no será considerados
